TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B02C8BF6-0ACA-41A2-B915-35365B871E2A} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sun Jan 28 18:07:52 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/drivers/adc/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("G:\code\c\ccs\remote_car\Flash")
      13              ;       D:\ti\ccsv7\tools\compiler\ti-cgt-c2000_16.9.6.LTS\bin\opt2000.exe C:\\Users\\Zulolo\\AppData\\Local\

    3354              
    3355              $C$DW$T$62      .dwtag  DW_TAG_typedef
    3356                      .dwattr $C$DW$T$62, DW_AT_name("ADC_TempSensorSrc_e")
    3357                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    3358                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3359              
    3360              $C$DW$344       .dwtag  DW_TAG_TI_far_type
    3361                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$62)
    3362              
    3363              $C$DW$T$63      .dwtag  DW_TAG_const_type
    3364                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$344)
    3365              
    3366              
    3367              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    3368                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    3369              $C$DW$345       .dwtag  DW_TAG_enumerator
    3370                      .dwattr $C$DW$345, DW_AT_name("ADC_VoltageRefSrc_Int")
    3371                      .dwattr $C$DW$345, DW_AT_const_value(0x00)
    3372              
    3373              $C$DW$346       .dwtag  DW_TAG_enumerator
    3374                      .dwattr $C$DW$346, DW_AT_name("ADC_VoltageRefSrc_Ext")
    3375                      .dwattr $C$DW$346, DW_AT_const_value(0x08)
    3376              
    3377                      .dwendtag $C$DW$T$64
    3378              
    3379              $C$DW$T$65      .dwtag  DW_TAG_typedef
    3380                      .dwattr $C$DW$T$65, DW_AT_name("ADC_VoltageRefSrc_e")
    3381                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    3382                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3383              
    3384              $C$DW$347       .dwtag  DW_TAG_TI_far_type
    3385                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$65)
    3386              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B02C8BF6-0ACA-41A2-B915-35365B871E2A} PAGE   64

    3387              $C$DW$T$66      .dwtag  DW_TAG_const_type
    3388                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$347)
    3389              
    3390              
    3391              $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
    3392                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
    3393              $C$DW$348       .dwtag  DW_TAG_enumerator
    3394                      .dwattr $C$DW$348, DW_AT_name("ADC_DivideSelect_ClkIn_by_1")
    3395                      .dwattr $C$DW$348, DW_AT_const_value(0x00)
    3396              
    3397              $C$DW$349       .dwtag  DW_TAG_enumerator
    3398                      .dwattr $C$DW$349, DW_AT_name("ADC_DivideSelect_ClkIn_by_2")
    3399                      .dwattr $C$DW$349, DW_AT_const_value(0x01)
    3400              
    3401                      .dwendtag $C$DW$T$67
    3402              
    3403              $C$DW$T$68      .dwtag  DW_TAG_typedef
    3404                      .dwattr $C$DW$T$68, DW_AT_name("ADC_DivideSelect_e")
    3405                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    3406                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3407              
    3408              $C$DW$350       .dwtag  DW_TAG_TI_far_type
    3409                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$68)
    3410              
    3411              $C$DW$T$69      .dwtag  DW_TAG_const_type
    3412                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$350)
    3413              
    3414              
    3415              $C$DW$T$74      .dwtag  DW_TAG_enumeration_type
    3416                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    3417              $C$DW$351       .dwtag  DW_TAG_enumerator
    3418                      .dwattr $C$DW$351, DW_AT_name("ADC_NoIntTriggersSOC")
    3419                      .dwattr $C$DW$351, DW_AT_const_value(0x00)
    3420              
    3421              $C$DW$352       .dwtag  DW_TAG_enumerator
    3422                      .dwattr $C$DW$352, DW_AT_name("ADC_Int1TriggersSOC")
    3423                      .dwattr $C$DW$352, DW_AT_const_value(0x01)
    3424              
    3425              $C$DW$353       .dwtag  DW_TAG_enumerator
    3426                      .dwattr $C$DW$353, DW_AT_name("ADC_Int2TriggersSOC")
    3427                      .dwattr $C$DW$353, DW_AT_const_value(0x02)
    3428              
    3429                      .dwendtag $C$DW$T$74
    3430              
    3431              $C$DW$T$75      .dwtag  DW_TAG_typedef
    3432                      .dwattr $C$DW$T$75, DW_AT_name("ADC_IntTriggerSOC_e")
    3433                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3434                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3435              
    3436              $C$DW$354       .dwtag  DW_TAG_TI_far_type
    3437                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$75)
    3438              
    3439              $C$DW$T$76      .dwtag  DW_TAG_const_type
    3440                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$354)
    3441              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B02C8BF6-0ACA-41A2-B915-35365B871E2A} PAGE   65

    3442              
    3443              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3444                      .dwattr $C$DW$T$27, DW_AT_name("_ADC_Obj_")
    3445                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x6650)
    3446              $C$DW$355       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$21)
    3448                      .dwattr $C$DW$355, DW_AT_name("ADCRESULT")
    3449                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_ADCRESULT")
    3450                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3451                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3452              
    3453              $C$DW$356       .dwtag  DW_TAG_member
    3454                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$22)
    3455                      .dwattr $C$DW$356, DW_AT_name("resvd_1")
    3456                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_resvd_1")
    3457                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3458                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3459              
    3460              $C$DW$357       .dwtag  DW_TAG_member
    3461                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    3462                      .dwattr $C$DW$357, DW_AT_name("ADCCTL1")
    3463                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_ADCCTL1")
    3464                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3465                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3466              
    3467              $C$DW$358       .dwtag  DW_TAG_member
    3468                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    3469                      .dwattr $C$DW$358, DW_AT_name("ADCCTL2")
    3470                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_ADCCTL2")
    3471                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3472                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3473              
    3474              $C$DW$359       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
    3476                      .dwattr $C$DW$359, DW_AT_name("rsvd_2")
    3477                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_rsvd_2")
    3478                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3479                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3480              
    3481              $C$DW$360       .dwtag  DW_TAG_member
    3482                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    3483                      .dwattr $C$DW$360, DW_AT_name("ADCINTFLG")
    3484                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_ADCINTFLG")
    3485                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3486                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3487              
    3488              $C$DW$361       .dwtag  DW_TAG_member
    3489                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    3490                      .dwattr $C$DW$361, DW_AT_name("ADCINTFLGCLR")
    3491                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3492                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3493                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3494              
    3495              $C$DW$362       .dwtag  DW_TAG_member
    3496                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B02C8BF6-0ACA-41A2-B915-35365B871E2A} PAGE   66

    3497                      .dwattr $C$DW$362, DW_AT_name("ADCINTOVF")
    3498                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_ADCINTOVF")
    3499                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3500                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3501              
    3502              $C$DW$363       .dwtag  DW_TAG_member
    3503                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    3504                      .dwattr $C$DW$363, DW_AT_name("ADCINTOVFCLR")
    3505                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3506                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3507                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3508              
    3509              $C$DW$364       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$24)
    3511                      .dwattr $C$DW$364, DW_AT_name("INTSELxNy")
    3512                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_INTSELxNy")
    3513                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3514                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3515              
    3516              $C$DW$365       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$25)
    3518                      .dwattr $C$DW$365, DW_AT_name("rsvd_3")
    3519                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_rsvd_3")
    3520                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3521                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3522              
    3523              $C$DW$366       .dwtag  DW_TAG_member
    3524                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    3525                      .dwattr $C$DW$366, DW_AT_name("SOCPRICTRL")
    3526                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3527                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3528                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3529              
    3530              $C$DW$367       .dwtag  DW_TAG_member
    3531                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    3532                      .dwattr $C$DW$367, DW_AT_name("rsvd_4")
    3533                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_rsvd_4")
    3534                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3535                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3536              
    3537              $C$DW$368       .dwtag  DW_TAG_member
    3538                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    3539                      .dwattr $C$DW$368, DW_AT_name("ADCSAMPLEMODE")
    3540                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3541                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3542                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3543              
    3544              $C$DW$369       .dwtag  DW_TAG_member
    3545                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    3546                      .dwattr $C$DW$369, DW_AT_name("rsvd_5")
    3547                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_rsvd_5")
    3548                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3549                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3550              
    3551              $C$DW$370       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B02C8BF6-0ACA-41A2-B915-35365B871E2A} PAGE   67

    3552                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    3553                      .dwattr $C$DW$370, DW_AT_name("ADCINTSOCSEL1")
    3554                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3555                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3556                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3557              
    3558              $C$DW$371       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    3560                      .dwattr $C$DW$371, DW_AT_name("ADCINTSOCSEL2")
    3561                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3562                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3563                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3564              
    3565              $C$DW$372       .dwtag  DW_TAG_member
    3566                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    3567                      .dwattr $C$DW$372, DW_AT_name("rsvd_6")
    3568                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rsvd_6")
    3569                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3570                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3571              
    3572              $C$DW$373       .dwtag  DW_TAG_member
    3573                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    3574                      .dwattr $C$DW$373, DW_AT_name("ADCSOCFLG1")
    3575                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3576                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3577                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3578              
    3579              $C$DW$374       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    3581                      .dwattr $C$DW$374, DW_AT_name("rsvd_7")
    3582                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_rsvd_7")
    3583                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3584                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3585              
    3586              $C$DW$375       .dwtag  DW_TAG_member
    3587                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    3588                      .dwattr $C$DW$375, DW_AT_name("ADCSOCFRC1")
    3589                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3590                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3591                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3592              
    3593              $C$DW$376       .dwtag  DW_TAG_member
    3594                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    3595                      .dwattr $C$DW$376, DW_AT_name("rsvd_8")
    3596                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_rsvd_8")
    3597                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3598                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3599              
    3600              $C$DW$377       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    3602                      .dwattr $C$DW$377, DW_AT_name("ADCSOCOVF1")
    3603                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3604                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3605                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3606              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B02C8BF6-0ACA-41A2-B915-35365B871E2A} PAGE   68

    3607              $C$DW$378       .dwtag  DW_TAG_member
    3608                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    3609                      .dwattr $C$DW$378, DW_AT_name("rsvd_9")
    3610                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_rsvd_9")
    3611                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3612                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3613              
    3614              $C$DW$379       .dwtag  DW_TAG_member
    3615                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    3616                      .dwattr $C$DW$379, DW_AT_name("ADCSOCOVFCLR1")
    3617                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3618                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3619                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3620              
    3621              $C$DW$380       .dwtag  DW_TAG_member
    3622                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    3623                      .dwattr $C$DW$380, DW_AT_name("rsvd_10")
    3624                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd_10")
    3625                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3626                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3627              
    3628              $C$DW$381       .dwtag  DW_TAG_member
    3629                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$21)
    3630                      .dwattr $C$DW$381, DW_AT_name("ADCSOCxCTL")
    3631                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3632                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3633                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3634              
    3635              $C$DW$382       .dwtag  DW_TAG_member
    3636                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$21)
    3637                      .dwattr $C$DW$382, DW_AT_name("rsvd_11")
    3638                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_rsvd_11")
    3639                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3640                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3641              
    3642              $C$DW$383       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    3644                      .dwattr $C$DW$383, DW_AT_name("ADCREFTRIM")
    3645                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3646                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3647                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3648              
    3649              $C$DW$384       .dwtag  DW_TAG_member
    3650                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
    3651                      .dwattr $C$DW$384, DW_AT_name("ADCOFFTRIM")
    3652                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3653                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3654                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3655              
    3656              $C$DW$385       .dwtag  DW_TAG_member
    3657                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$26)
    3658                      .dwattr $C$DW$385, DW_AT_name("resvd_12")
    3659                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_resvd_12")
    3660                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3661                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B02C8BF6-0ACA-41A2-B915-35365B871E2A} PAGE   69

    3662              
    3663              $C$DW$386       .dwtag  DW_TAG_member
    3664                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    3665                      .dwattr $C$DW$386, DW_AT_name("ADCREV")
    3666                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_ADCREV")
    3667                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3668                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3669              
    3670                      .dwendtag $C$DW$T$27
    3671              
    3672              $C$DW$T$77      .dwtag  DW_TAG_typedef
    3673                      .dwattr $C$DW$T$77, DW_AT_name("ADC_Obj")
    3674                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$27)
    3675                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    3676              
    3677              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    3678                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$27)
    3679                      .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    3680              
    3681              $C$DW$T$71      .dwtag  DW_TAG_typedef
    3682                      .dwattr $C$DW$T$71, DW_AT_name("ADC_Handle")
    3683                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    3684                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3685              
    3686              $C$DW$387       .dwtag  DW_TAG_TI_far_type
    3687                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$71)
    3688              
    3689              $C$DW$T$78      .dwtag  DW_TAG_const_type
    3690                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$387)
    3691              
    3692              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3693                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3694              
    3695              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3696                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3697                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3698              
    3699              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3700                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3701                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3702                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3703              
    3704              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3705                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3706                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3707                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3708              
    3709              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3710                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3711                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3712                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3713              
    3714              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3715                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3716                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B02C8BF6-0ACA-41A2-B915-35365B871E2A} PAGE   70

    3717                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3718              
    3719              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3720                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3721                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3722                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3723              
    3724              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3725                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3726                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3727                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3728              
    3729              $C$DW$T$10      .dwtag  DW_TAG_base_type
