TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{BCEFD5E9-93DB-4BAD-89F6-A1CDBFC83A3E} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sun Jan 28 18:07:56 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/modules/cpu_usage/src/32b/cpu_u
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("G:\code\c\ccs\remote_car\Flash")
      13              ;       D:\ti\ccsv7\tools\compiler\ti-cgt-c2000_16.9.6.LTS\bin\opt2000.exe C:\\Users\\Zulolo\\AppData\\Local\

     126                      .dwattr $C$DW$1, DW_AT_TI_end_line(0x37)
     127                      .dwattr $C$DW$1, DW_AT_TI_end_column(0x01)
     128                      .dwendentry
     129                      .dwendtag $C$DW$1
     130              
     131 00000016               .sect   ".text"
     132                      .clink
     133                      .global _CPU_USAGE_init
     134              
     135              $C$DW$9 .dwtag  DW_TAG_subprogram
     136                      .dwattr $C$DW$9, DW_AT_name("CPU_USAGE_init")
     137                      .dwattr $C$DW$9, DW_AT_low_pc(_CPU_USAGE_init)
     138                      .dwattr $C$DW$9, DW_AT_high_pc(0x00)
     139                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_CPU_USAGE_init")
     140                      .dwattr $C$DW$9, DW_AT_external
     141                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$24)
     142                      .dwattr $C$DW$9, DW_AT_TI_begin_file("D:/ti/motorware/motorware_1_01_00_18/sw/modules/cpu_usage/src/3
     143                      .dwattr $C$DW$9, DW_AT_TI_begin_line(0x15)
     144                      .dwattr $C$DW$9, DW_AT_TI_begin_column(0x12)
     145                      .dwattr $C$DW$9, DW_AT_TI_max_frame_size(-2)
     146                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/cpu_usage/src/32b/cpu_usage.c",line 22,
     147              
     148                      .dwfde $C$DW$CIE, _CPU_USAGE_init
     149              $C$DW$10        .dwtag  DW_TAG_formal_parameter
     150                      .dwattr $C$DW$10, DW_AT_name("pMemory")
     151                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_pMemory")
     152                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$3)
     153                      .dwattr $C$DW$10, DW_AT_location[DW_OP_reg12]
     154              
     155              $C$DW$11        .dwtag  DW_TAG_formal_parameter
     156                      .dwattr $C$DW$11, DW_AT_name("numBytes")
     157                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_numBytes")
     158                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$26)
     159                      .dwattr $C$DW$11, DW_AT_location[DW_OP_reg0]
     160              
     161              
     162              ;***************************************************************
     163              ;* FNAME: _CPU_USAGE_init               FR SIZE:   0           *
     164              ;*                                                             *
     165              ;* FUNCTION ENVIRONMENT                                        *
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{BCEFD5E9-93DB-4BAD-89F6-A1CDBFC83A3E} PAGE    4

     166              ;*                                                             *
     167              ;* FUNCTION PROPERTIES                                         *
     168              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     169              ;***************************************************************
     170              
     171              _CPU_USAGE_init:
     172              ;* AR6   assigned to _numBytes
     173              $C$DW$12        .dwtag  DW_TAG_variable
     174                      .dwattr $C$DW$12, DW_AT_name("numBytes")
     175                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_numBytes")
     176                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$27)
     177                      .dwattr $C$DW$12, DW_AT_location[DW_OP_reg16]
     178              
     179                      .dwcfi  cfa_offset, -2
     180                      .dwcfi  save_reg_to_mem, 26, 0
     181 00000016 1EA6          MOVL      XAR6,ACC              ; [CPU_] |22| 
     182                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/cpu_usage/src/32b/cpu_usage.c",line 26,
     183 00000017 0216          MOVB      ACC,#22               ; [CPU_] |26| 
     184 00000018 0FA6          CMPL      ACC,XAR6              ; [CPU_] |26| 
     185 00000019 6902          B         $C$L1,LOS             ; [CPU_] |26| 
     186                      ; branchcc occurs ; [] |26| 
     187 0000001a D400          MOVB      XAR4,#0               ; [CPU_] |26| 
     188              $C$L1:    
     189              $C$DW$13        .dwtag  DW_TAG_TI_branch
     190                      .dwattr $C$DW$13, DW_AT_low_pc(0x00)
     191                      .dwattr $C$DW$13, DW_AT_TI_return
     192              
     193 0000001b 0006          LRETR     ; [CPU_] 
     194                      ; return occurs ; [] 
     195                      .dwattr $C$DW$9, DW_AT_TI_end_file("D:/ti/motorware/motorware_1_01_00_18/sw/modules/cpu_usage/src/32b
     196                      .dwattr $C$DW$9, DW_AT_TI_end_line(0x20)
     197                      .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     198                      .dwendentry
     199                      .dwendtag $C$DW$9
     200              
     201              
     202              ;***************************************************************
     203              ;* TYPE INFORMATION                                            *
     204              ;***************************************************************
     205              
     206              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     207                      .dwattr $C$DW$T$21, DW_AT_name("_CPU_USAGE_Obj_")
     208                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x16)
     209              $C$DW$14        .dwtag  DW_TAG_member
     210                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     211                      .dwattr $C$DW$14, DW_AT_name("timerPeriod_cnts")
     212                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_timerPeriod_cnts")
     213                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     214                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     215              
     216              $C$DW$15        .dwtag  DW_TAG_member
     217                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     218                      .dwattr $C$DW$15, DW_AT_name("cnt_z0")
     219                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_cnt_z0")
     220                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{BCEFD5E9-93DB-4BAD-89F6-A1CDBFC83A3E} PAGE    5

     221                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     222              
     223              $C$DW$16        .dwtag  DW_TAG_member
     224                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     225                      .dwattr $C$DW$16, DW_AT_name("cnt_z1")
     226                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_cnt_z1")
     227                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     228                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     229              
     230              $C$DW$17        .dwtag  DW_TAG_member
     231                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     232                      .dwattr $C$DW$17, DW_AT_name("deltaCnt")
     233                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_deltaCnt")
     234                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     235                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     236              
     237              $C$DW$18        .dwtag  DW_TAG_member
     238                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     239                      .dwattr $C$DW$18, DW_AT_name("deltaCntAcc")
     240                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_deltaCntAcc")
     241                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     242                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     243              
     244              $C$DW$19        .dwtag  DW_TAG_member
     245                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     246                      .dwattr $C$DW$19, DW_AT_name("deltaCntAccNum")
     247                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_deltaCntAccNum")
     248                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     249                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     250              
     251              $C$DW$20        .dwtag  DW_TAG_member
     252                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     253                      .dwattr $C$DW$20, DW_AT_name("deltaCntAccNumMax")
     254                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
     255                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     256                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     257              
     258              $C$DW$21        .dwtag  DW_TAG_member
     259                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     260                      .dwattr $C$DW$21, DW_AT_name("minDeltaCntObserved")
     261                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_minDeltaCntObserved")
     262                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     263                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     264              
     265              $C$DW$22        .dwtag  DW_TAG_member
     266                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     267                      .dwattr $C$DW$22, DW_AT_name("avgDeltaCntObserved")
     268                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
     269                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     270                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     271              
     272              $C$DW$23        .dwtag  DW_TAG_member
     273                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     274                      .dwattr $C$DW$23, DW_AT_name("maxDeltaCntObserved")
     275                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{BCEFD5E9-93DB-4BAD-89F6-A1CDBFC83A3E} PAGE    6

     276                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     277                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     278              
     279              $C$DW$24        .dwtag  DW_TAG_member
     280                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     281                      .dwattr $C$DW$24, DW_AT_name("flag_resetStats")
     282                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_flag_resetStats")
     283                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     284                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     285              
     286                      .dwendtag $C$DW$T$21
     287              
     288              $C$DW$T$22      .dwtag  DW_TAG_typedef
     289                      .dwattr $C$DW$T$22, DW_AT_name("CPU_USAGE_Obj")
     290                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     291                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     292              
     293              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
     294                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
     295                      .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
     296              
     297              $C$DW$T$24      .dwtag  DW_TAG_typedef
     298                      .dwattr $C$DW$T$24, DW_AT_name("CPU_USAGE_Handle")
     299                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     300                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     301              
     302              $C$DW$25        .dwtag  DW_TAG_TI_far_type
     303                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$24)
     304              
     305              $C$DW$T$25      .dwtag  DW_TAG_const_type
     306                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$25)
     307              
     308              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     309                      .dwattr $C$DW$T$2, DW_AT_name("void")
     310              
     311              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     312                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     313                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     314              
     315              $C$DW$T$4       .dwtag  DW_TAG_base_type
     316                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     317                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     318                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     319              
     320              $C$DW$T$5       .dwtag  DW_TAG_base_type
     321                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     322                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     323                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     324              
     325              $C$DW$T$6       .dwtag  DW_TAG_base_type
     326                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     327                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     328                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     329              
     330              $C$DW$T$7       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{BCEFD5E9-93DB-4BAD-89F6-A1CDBFC83A3E} PAGE    7

     331                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     332                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     333                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     334              
     335              $C$DW$T$8       .dwtag  DW_TAG_base_type
     336                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     337                      .dwattr $C$DW$T$8, DW_AT_name("short")
     338                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     339              
     340              $C$DW$T$9       .dwtag  DW_TAG_base_type
     341                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     342                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     343                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     344              
     345              $C$DW$T$10      .dwtag  DW_TAG_base_type
