TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sun Jan 28 18:07:58 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("G:\code\c\ccs\remote_car\Flash")
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    7854                      .dwattr $C$DW$664, DW_AT_name("EST_State_Idle")
    7855                      .dwattr $C$DW$664, DW_AT_const_value(0x01)
    7856              
    7857              $C$DW$665       .dwtag  DW_TAG_enumerator
    7858                      .dwattr $C$DW$665, DW_AT_name("EST_State_RoverL")
    7859                      .dwattr $C$DW$665, DW_AT_const_value(0x02)
    7860              
    7861              $C$DW$666       .dwtag  DW_TAG_enumerator
    7862                      .dwattr $C$DW$666, DW_AT_name("EST_State_Rs")
    7863                      .dwattr $C$DW$666, DW_AT_const_value(0x03)
    7864              
    7865              $C$DW$667       .dwtag  DW_TAG_enumerator
    7866                      .dwattr $C$DW$667, DW_AT_name("EST_State_RampUp")
    7867                      .dwattr $C$DW$667, DW_AT_const_value(0x04)
    7868              
    7869              $C$DW$668       .dwtag  DW_TAG_enumerator
    7870                      .dwattr $C$DW$668, DW_AT_name("EST_State_IdRated")
    7871                      .dwattr $C$DW$668, DW_AT_const_value(0x05)
    7872              
    7873              $C$DW$669       .dwtag  DW_TAG_enumerator
    7874                      .dwattr $C$DW$669, DW_AT_name("EST_State_RatedFlux_OL")
    7875                      .dwattr $C$DW$669, DW_AT_const_value(0x06)
    7876              
    7877              $C$DW$670       .dwtag  DW_TAG_enumerator
    7878                      .dwattr $C$DW$670, DW_AT_name("EST_State_RatedFlux")
    7879                      .dwattr $C$DW$670, DW_AT_const_value(0x07)
    7880              
    7881              $C$DW$671       .dwtag  DW_TAG_enumerator
    7882                      .dwattr $C$DW$671, DW_AT_name("EST_State_RampDown")
    7883                      .dwattr $C$DW$671, DW_AT_const_value(0x08)
    7884              
    7885              $C$DW$672       .dwtag  DW_TAG_enumerator
    7886                      .dwattr $C$DW$672, DW_AT_name("EST_State_LockRotor")
    7887                      .dwattr $C$DW$672, DW_AT_const_value(0x09)
    7888              
    7889              $C$DW$673       .dwtag  DW_TAG_enumerator
    7890                      .dwattr $C$DW$673, DW_AT_name("EST_State_Ls")
    7891                      .dwattr $C$DW$673, DW_AT_const_value(0x0a)
    7892              
    7893              $C$DW$674       .dwtag  DW_TAG_enumerator
    7894                      .dwattr $C$DW$674, DW_AT_name("EST_State_Rr")
    7895                      .dwattr $C$DW$674, DW_AT_const_value(0x0b)
    7896              
    7897              $C$DW$675       .dwtag  DW_TAG_enumerator
    7898                      .dwattr $C$DW$675, DW_AT_name("EST_State_MotorIdentified")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  151

    7899                      .dwattr $C$DW$675, DW_AT_const_value(0x0c)
    7900              
    7901              $C$DW$676       .dwtag  DW_TAG_enumerator
    7902                      .dwattr $C$DW$676, DW_AT_name("EST_State_OnLine")
    7903                      .dwattr $C$DW$676, DW_AT_const_value(0x0d)
    7904              
    7905              $C$DW$677       .dwtag  DW_TAG_enumerator
    7906                      .dwattr $C$DW$677, DW_AT_name("EST_numStates")
    7907                      .dwattr $C$DW$677, DW_AT_const_value(0x0e)
    7908              
    7909                      .dwendtag $C$DW$T$172
    7910              
    7911              $C$DW$T$173     .dwtag  DW_TAG_typedef
    7912                      .dwattr $C$DW$T$173, DW_AT_name("EST_State_e")
    7913                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    7914                      .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    7915              
    7916              
    7917              $C$DW$T$177     .dwtag  DW_TAG_enumeration_type
    7918                      .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    7919              $C$DW$678       .dwtag  DW_TAG_enumerator
    7920                      .dwattr $C$DW$678, DW_AT_name("CTRL_Type_PID_spd")
    7921                      .dwattr $C$DW$678, DW_AT_const_value(0x00)
    7922              
    7923              $C$DW$679       .dwtag  DW_TAG_enumerator
    7924                      .dwattr $C$DW$679, DW_AT_name("CTRL_Type_PID_Id")
    7925                      .dwattr $C$DW$679, DW_AT_const_value(0x01)
    7926              
    7927              $C$DW$680       .dwtag  DW_TAG_enumerator
    7928                      .dwattr $C$DW$680, DW_AT_name("CTRL_Type_PID_Iq")
    7929                      .dwattr $C$DW$680, DW_AT_const_value(0x02)
    7930              
    7931                      .dwendtag $C$DW$T$177
    7932              
    7933              $C$DW$T$178     .dwtag  DW_TAG_typedef
    7934                      .dwattr $C$DW$T$178, DW_AT_name("CTRL_Type_e")
    7935                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    7936                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    7937              
    7938              $C$DW$681       .dwtag  DW_TAG_TI_far_type
    7939                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$178)
    7940              
    7941              $C$DW$T$179     .dwtag  DW_TAG_const_type
    7942                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$681)
    7943              
    7944              
    7945              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7946                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    7947                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    7948              $C$DW$682       .dwtag  DW_TAG_member
    7949                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$24)
    7950                      .dwattr $C$DW$682, DW_AT_name("ADCRESULT")
    7951                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCRESULT")
    7952                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7953                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  152

    7954              
    7955              $C$DW$683       .dwtag  DW_TAG_member
    7956                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$25)
    7957                      .dwattr $C$DW$683, DW_AT_name("resvd_1")
    7958                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_resvd_1")
    7959                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7960                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7961              
    7962              $C$DW$684       .dwtag  DW_TAG_member
    7963                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$23)
    7964                      .dwattr $C$DW$684, DW_AT_name("ADCCTL1")
    7965                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCCTL1")
    7966                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7967                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7968              
    7969              $C$DW$685       .dwtag  DW_TAG_member
    7970                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$23)
    7971                      .dwattr $C$DW$685, DW_AT_name("ADCCTL2")
    7972                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCCTL2")
    7973                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    7974                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7975              
    7976              $C$DW$686       .dwtag  DW_TAG_member
    7977                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$26)
    7978                      .dwattr $C$DW$686, DW_AT_name("rsvd_2")
    7979                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_rsvd_2")
    7980                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7981                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7982              
    7983              $C$DW$687       .dwtag  DW_TAG_member
    7984                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$23)
    7985                      .dwattr $C$DW$687, DW_AT_name("ADCINTFLG")
    7986                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCINTFLG")
    7987                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    7988                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7989              
    7990              $C$DW$688       .dwtag  DW_TAG_member
    7991                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$23)
    7992                      .dwattr $C$DW$688, DW_AT_name("ADCINTFLGCLR")
    7993                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    7994                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    7995                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7996              
    7997              $C$DW$689       .dwtag  DW_TAG_member
    7998                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$23)
    7999                      .dwattr $C$DW$689, DW_AT_name("ADCINTOVF")
    8000                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_ADCINTOVF")
    8001                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8002                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8003              
    8004              $C$DW$690       .dwtag  DW_TAG_member
    8005                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$23)
    8006                      .dwattr $C$DW$690, DW_AT_name("ADCINTOVFCLR")
    8007                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8008                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  153

    8009                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8010              
    8011              $C$DW$691       .dwtag  DW_TAG_member
    8012                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$27)
    8013                      .dwattr $C$DW$691, DW_AT_name("INTSELxNy")
    8014                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_INTSELxNy")
    8015                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8016                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8017              
    8018              $C$DW$692       .dwtag  DW_TAG_member
    8019                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$28)
    8020                      .dwattr $C$DW$692, DW_AT_name("rsvd_3")
    8021                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_rsvd_3")
    8022                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8023                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8024              
    8025              $C$DW$693       .dwtag  DW_TAG_member
    8026                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    8027                      .dwattr $C$DW$693, DW_AT_name("SOCPRICTRL")
    8028                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8029                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8030                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8031              
    8032              $C$DW$694       .dwtag  DW_TAG_member
    8033                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$23)
    8034                      .dwattr $C$DW$694, DW_AT_name("rsvd_4")
    8035                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_rsvd_4")
    8036                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8037                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8038              
    8039              $C$DW$695       .dwtag  DW_TAG_member
    8040                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$23)
    8041                      .dwattr $C$DW$695, DW_AT_name("ADCSAMPLEMODE")
    8042                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8043                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8044                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8045              
    8046              $C$DW$696       .dwtag  DW_TAG_member
    8047                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$23)
    8048                      .dwattr $C$DW$696, DW_AT_name("rsvd_5")
    8049                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_5")
    8050                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8051                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8052              
    8053              $C$DW$697       .dwtag  DW_TAG_member
    8054                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$23)
    8055                      .dwattr $C$DW$697, DW_AT_name("ADCINTSOCSEL1")
    8056                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8057                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8058                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8059              
    8060              $C$DW$698       .dwtag  DW_TAG_member
    8061                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$23)
    8062                      .dwattr $C$DW$698, DW_AT_name("ADCINTSOCSEL2")
    8063                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  154

    8064                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8065                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8066              
    8067              $C$DW$699       .dwtag  DW_TAG_member
    8068                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$26)
    8069                      .dwattr $C$DW$699, DW_AT_name("rsvd_6")
    8070                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_rsvd_6")
    8071                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8072                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8073              
    8074              $C$DW$700       .dwtag  DW_TAG_member
    8075                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    8076                      .dwattr $C$DW$700, DW_AT_name("ADCSOCFLG1")
    8077                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8078                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8079                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8080              
    8081              $C$DW$701       .dwtag  DW_TAG_member
    8082                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    8083                      .dwattr $C$DW$701, DW_AT_name("rsvd_7")
    8084                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_rsvd_7")
    8085                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8086                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8087              
    8088              $C$DW$702       .dwtag  DW_TAG_member
    8089                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$23)
    8090                      .dwattr $C$DW$702, DW_AT_name("ADCSOCFRC1")
    8091                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8092                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8093                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8094              
    8095              $C$DW$703       .dwtag  DW_TAG_member
    8096                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$23)
    8097                      .dwattr $C$DW$703, DW_AT_name("rsvd_8")
    8098                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_rsvd_8")
    8099                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8100                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8101              
    8102              $C$DW$704       .dwtag  DW_TAG_member
    8103                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$23)
    8104                      .dwattr $C$DW$704, DW_AT_name("ADCSOCOVF1")
    8105                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8106                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8107                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8108              
    8109              $C$DW$705       .dwtag  DW_TAG_member
    8110                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$23)
    8111                      .dwattr $C$DW$705, DW_AT_name("rsvd_9")
    8112                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd_9")
    8113                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8114                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8115              
    8116              $C$DW$706       .dwtag  DW_TAG_member
    8117                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$23)
    8118                      .dwattr $C$DW$706, DW_AT_name("ADCSOCOVFCLR1")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  155

    8119                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8120                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8121                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8122              
    8123              $C$DW$707       .dwtag  DW_TAG_member
    8124                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    8125                      .dwattr $C$DW$707, DW_AT_name("rsvd_10")
    8126                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_rsvd_10")
    8127                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8128                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8129              
    8130              $C$DW$708       .dwtag  DW_TAG_member
    8131                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$24)
    8132                      .dwattr $C$DW$708, DW_AT_name("ADCSOCxCTL")
    8133                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8134                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8135                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8136              
    8137              $C$DW$709       .dwtag  DW_TAG_member
    8138                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$24)
    8139                      .dwattr $C$DW$709, DW_AT_name("rsvd_11")
    8140                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_rsvd_11")
    8141                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8142                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8143              
    8144              $C$DW$710       .dwtag  DW_TAG_member
    8145                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$23)
    8146                      .dwattr $C$DW$710, DW_AT_name("ADCREFTRIM")
    8147                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8148                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8149                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8150              
    8151              $C$DW$711       .dwtag  DW_TAG_member
    8152                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$23)
    8153                      .dwattr $C$DW$711, DW_AT_name("ADCOFFTRIM")
    8154                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8155                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8156                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8157              
    8158              $C$DW$712       .dwtag  DW_TAG_member
    8159                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$29)
    8160                      .dwattr $C$DW$712, DW_AT_name("resvd_12")
    8161                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_resvd_12")
    8162                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8163                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8164              
    8165              $C$DW$713       .dwtag  DW_TAG_member
    8166                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$23)
    8167                      .dwattr $C$DW$713, DW_AT_name("ADCREV")
    8168                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_ADCREV")
    8169                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8170                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8171              
    8172                      .dwendtag $C$DW$T$30
    8173              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  156

    8174              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    8175                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$30)
    8176                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    8177              
    8178              $C$DW$T$90      .dwtag  DW_TAG_typedef
    8179                      .dwattr $C$DW$T$90, DW_AT_name("ADC_Handle")
    8180                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    8181                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    8182              
    8183              
    8184              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    8185                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    8186                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    8187              $C$DW$714       .dwtag  DW_TAG_member
    8188                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$31)
    8189                      .dwattr $C$DW$714, DW_AT_name("alpha_sf")
    8190                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_alpha_sf")
    8191                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8192                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8193              
    8194              $C$DW$715       .dwtag  DW_TAG_member
    8195                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$31)
    8196                      .dwattr $C$DW$715, DW_AT_name("beta_sf")
    8197                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_beta_sf")
    8198                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8199                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8200              
    8201              $C$DW$716       .dwtag  DW_TAG_member
    8202                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$32)
    8203                      .dwattr $C$DW$716, DW_AT_name("numSensors")
    8204                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_numSensors")
    8205                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8206                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8207              
    8208                      .dwendtag $C$DW$T$33
    8209              
    8210              $C$DW$T$44      .dwtag  DW_TAG_typedef
    8211                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Obj")
    8212                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    8213                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    8214              
    8215              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    8216                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    8217                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    8218              
    8219              $C$DW$T$43      .dwtag  DW_TAG_typedef
    8220                      .dwattr $C$DW$T$43, DW_AT_name("CLARKE_Handle")
    8221                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    8222                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    8223              
    8224              
    8225              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8226                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    8227                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    8228              $C$DW$717       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  157

    8229                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$23)
    8230                      .dwattr $C$DW$717, DW_AT_name("XCLK")
    8231                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_XCLK")
    8232                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8233                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8234              
    8235              $C$DW$718       .dwtag  DW_TAG_member
    8236                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$23)
    8237                      .dwattr $C$DW$718, DW_AT_name("rsvd_1")
    8238                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_rsvd_1")
    8239                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8240                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8241              
    8242              $C$DW$719       .dwtag  DW_TAG_member
    8243                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$23)
    8244                      .dwattr $C$DW$719, DW_AT_name("CLKCTL")
    8245                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_CLKCTL")
    8246                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8247                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8248              
    8249              $C$DW$720       .dwtag  DW_TAG_member
    8250                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$34)
    8251                      .dwattr $C$DW$720, DW_AT_name("rsvd_2")
    8252                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_rsvd_2")
    8253                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8254                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8255              
    8256              $C$DW$721       .dwtag  DW_TAG_member
    8257                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$23)
    8258                      .dwattr $C$DW$721, DW_AT_name("LOSPCP")
    8259                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_LOSPCP")
    8260                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8261                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8262              
    8263              $C$DW$722       .dwtag  DW_TAG_member
    8264                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$23)
    8265                      .dwattr $C$DW$722, DW_AT_name("PCLKCR0")
    8266                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_PCLKCR0")
    8267                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8268                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8269              
    8270              $C$DW$723       .dwtag  DW_TAG_member
    8271                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$23)
    8272                      .dwattr $C$DW$723, DW_AT_name("PCLKCR1")
    8273                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_PCLKCR1")
    8274                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8275                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8276              
    8277              $C$DW$724       .dwtag  DW_TAG_member
    8278                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$26)
    8279                      .dwattr $C$DW$724, DW_AT_name("rsvd_3")
    8280                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_rsvd_3")
    8281                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8282                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8283              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  158

    8284              $C$DW$725       .dwtag  DW_TAG_member
    8285                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$23)
    8286                      .dwattr $C$DW$725, DW_AT_name("PCLKCR3")
    8287                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_PCLKCR3")
    8288                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8289                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8290              
    8291                      .dwendtag $C$DW$T$35
    8292              
    8293              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    8294                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$35)
    8295                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    8296              
    8297              $C$DW$T$92      .dwtag  DW_TAG_typedef
    8298                      .dwattr $C$DW$T$92, DW_AT_name("CLK_Handle")
    8299                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    8300                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    8301              
    8302              
    8303              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8304                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    8305                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    8306              $C$DW$726       .dwtag  DW_TAG_member
    8307                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$32)
    8308                      .dwattr $C$DW$726, DW_AT_name("tmp")
    8309                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_tmp")
    8310                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8311                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8312              
    8313                      .dwendtag $C$DW$T$36
    8314              
    8315              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    8316                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
    8317                      .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    8318              
    8319              $C$DW$T$94      .dwtag  DW_TAG_typedef
    8320                      .dwattr $C$DW$T$94, DW_AT_name("CPU_Handle")
    8321                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    8322                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    8323              
    8324              
    8325              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    8326                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    8327                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    8328              $C$DW$727       .dwtag  DW_TAG_member
    8329                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$37)
    8330                      .dwattr $C$DW$727, DW_AT_name("version")
    8331                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_version")
    8332                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8333                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8334              
    8335              $C$DW$728       .dwtag  DW_TAG_member
    8336                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$39)
    8337                      .dwattr $C$DW$728, DW_AT_name("state")
    8338                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_state")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  159

    8339                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8340                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8341              
    8342              $C$DW$729       .dwtag  DW_TAG_member
    8343                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$39)
    8344                      .dwattr $C$DW$729, DW_AT_name("prevState")
    8345                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_prevState")
    8346                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8347                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8348              
    8349              $C$DW$730       .dwtag  DW_TAG_member
    8350                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$41)
    8351                      .dwattr $C$DW$730, DW_AT_name("errorCode")
    8352                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_errorCode")
    8353                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8354                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8355              
    8356              $C$DW$731       .dwtag  DW_TAG_member
    8357                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$43)
    8358                      .dwattr $C$DW$731, DW_AT_name("clarkeHandle_I")
    8359                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8360                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8361                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8362              
    8363              $C$DW$732       .dwtag  DW_TAG_member
    8364                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$44)
    8365                      .dwattr $C$DW$732, DW_AT_name("clarke_I")
    8366                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_clarke_I")
    8367                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8368                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8369              
    8370              $C$DW$733       .dwtag  DW_TAG_member
    8371                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$43)
    8372                      .dwattr $C$DW$733, DW_AT_name("clarkeHandle_V")
    8373                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8374                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8375                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8376              
    8377              $C$DW$734       .dwtag  DW_TAG_member
    8378                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$44)
    8379                      .dwattr $C$DW$734, DW_AT_name("clarke_V")
    8380                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_clarke_V")
    8381                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8382                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8383              
    8384              $C$DW$735       .dwtag  DW_TAG_member
    8385                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$46)
    8386                      .dwattr $C$DW$735, DW_AT_name("estHandle")
    8387                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_estHandle")
    8388                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8389                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8390              
    8391              $C$DW$736       .dwtag  DW_TAG_member
    8392                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$48)
    8393                      .dwattr $C$DW$736, DW_AT_name("parkHandle")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  160

    8394                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_parkHandle")
    8395                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8396                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8397              
    8398              $C$DW$737       .dwtag  DW_TAG_member
    8399                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$49)
    8400                      .dwattr $C$DW$737, DW_AT_name("park")
    8401                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_park")
    8402                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8403                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8404              
    8405              $C$DW$738       .dwtag  DW_TAG_member
    8406                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$51)
    8407                      .dwattr $C$DW$738, DW_AT_name("pidHandle_Id")
    8408                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_pidHandle_Id")
    8409                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8410                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8411              
    8412              $C$DW$739       .dwtag  DW_TAG_member
    8413                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$52)
    8414                      .dwattr $C$DW$739, DW_AT_name("pid_Id")
    8415                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_pid_Id")
    8416                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8417                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8418              
    8419              $C$DW$740       .dwtag  DW_TAG_member
    8420                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$51)
    8421                      .dwattr $C$DW$740, DW_AT_name("pidHandle_Iq")
    8422                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8423                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8424                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8425              
    8426              $C$DW$741       .dwtag  DW_TAG_member
    8427                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$52)
    8428                      .dwattr $C$DW$741, DW_AT_name("pid_Iq")
    8429                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_pid_Iq")
    8430                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8431                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8432              
    8433              $C$DW$742       .dwtag  DW_TAG_member
    8434                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$51)
    8435                      .dwattr $C$DW$742, DW_AT_name("pidHandle_spd")
    8436                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_pidHandle_spd")
    8437                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8438                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8439              
    8440              $C$DW$743       .dwtag  DW_TAG_member
    8441                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$52)
    8442                      .dwattr $C$DW$743, DW_AT_name("pid_spd")
    8443                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_pid_spd")
    8444                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8445                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8446              
    8447              $C$DW$744       .dwtag  DW_TAG_member
    8448                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  161

    8449                      .dwattr $C$DW$744, DW_AT_name("iparkHandle")
    8450                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_iparkHandle")
    8451                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8452                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8453              
    8454              $C$DW$745       .dwtag  DW_TAG_member
    8455                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$55)
    8456                      .dwattr $C$DW$745, DW_AT_name("ipark")
    8457                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_ipark")
    8458                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8459                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8460              
    8461              $C$DW$746       .dwtag  DW_TAG_member
    8462                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$57)
    8463                      .dwattr $C$DW$746, DW_AT_name("svgenHandle")
    8464                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_svgenHandle")
    8465                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8466                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8467              
    8468              $C$DW$747       .dwtag  DW_TAG_member
    8469                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$58)
    8470                      .dwattr $C$DW$747, DW_AT_name("svgen")
    8471                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_svgen")
    8472                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8473                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8474              
    8475              $C$DW$748       .dwtag  DW_TAG_member
    8476                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$60)
    8477                      .dwattr $C$DW$748, DW_AT_name("trajHandle_Id")
    8478                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_trajHandle_Id")
    8479                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8480                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8481              
    8482              $C$DW$749       .dwtag  DW_TAG_member
    8483                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$61)
    8484                      .dwattr $C$DW$749, DW_AT_name("traj_Id")
    8485                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_traj_Id")
    8486                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8487                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8488              
    8489              $C$DW$750       .dwtag  DW_TAG_member
    8490                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$60)
    8491                      .dwattr $C$DW$750, DW_AT_name("trajHandle_spd")
    8492                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_trajHandle_spd")
    8493                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8494                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8495              
    8496              $C$DW$751       .dwtag  DW_TAG_member
    8497                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$61)
    8498                      .dwattr $C$DW$751, DW_AT_name("traj_spd")
    8499                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_traj_spd")
    8500                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8501                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8502              
    8503              $C$DW$752       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  162

    8504                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$60)
    8505                      .dwattr $C$DW$752, DW_AT_name("trajHandle_spdMax")
    8506                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8507                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8508                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8509              
    8510              $C$DW$753       .dwtag  DW_TAG_member
    8511                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$61)
    8512                      .dwattr $C$DW$753, DW_AT_name("traj_spdMax")
    8513                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_traj_spdMax")
    8514                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8515                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8516              
    8517              $C$DW$754       .dwtag  DW_TAG_member
    8518                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$62)
    8519                      .dwattr $C$DW$754, DW_AT_name("motorParams")
    8520                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_motorParams")
    8521                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8522                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8523              
    8524              $C$DW$755       .dwtag  DW_TAG_member
    8525                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$65)
    8526                      .dwattr $C$DW$755, DW_AT_name("waitTimes")
    8527                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_waitTimes")
    8528                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8529                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8530              
    8531              $C$DW$756       .dwtag  DW_TAG_member
    8532                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$64)
    8533                      .dwattr $C$DW$756, DW_AT_name("counter_state")
    8534                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_counter_state")
    8535                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8536                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8537              
    8538              $C$DW$757       .dwtag  DW_TAG_member
    8539                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$66)
    8540                      .dwattr $C$DW$757, DW_AT_name("numIsrTicksPerCtrlTick")
    8541                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8542                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8543                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8544              
    8545              $C$DW$758       .dwtag  DW_TAG_member
    8546                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$66)
    8547                      .dwattr $C$DW$758, DW_AT_name("numCtrlTicksPerCurrentTick")
    8548                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8549                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    8550                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8551              
    8552              $C$DW$759       .dwtag  DW_TAG_member
    8553                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$66)
    8554                      .dwattr $C$DW$759, DW_AT_name("numCtrlTicksPerSpeedTick")
    8555                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8556                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8557                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8558              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  163

    8559              $C$DW$760       .dwtag  DW_TAG_member
    8560                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$66)
    8561                      .dwattr $C$DW$760, DW_AT_name("numCtrlTicksPerTrajTick")
    8562                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8563                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8564                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8565              
    8566              $C$DW$761       .dwtag  DW_TAG_member
    8567                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$64)
    8568                      .dwattr $C$DW$761, DW_AT_name("ctrlFreq_Hz")
    8569                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8570                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8571                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8572              
    8573              $C$DW$762       .dwtag  DW_TAG_member
    8574                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$64)
    8575                      .dwattr $C$DW$762, DW_AT_name("trajFreq_Hz")
    8576                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8577                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8578                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8579              
    8580              $C$DW$763       .dwtag  DW_TAG_member
    8581                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$31)
    8582                      .dwattr $C$DW$763, DW_AT_name("trajPeriod_sec")
    8583                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_trajPeriod_sec")
    8584                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8585                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8586              
    8587              $C$DW$764       .dwtag  DW_TAG_member
    8588                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$67)
    8589                      .dwattr $C$DW$764, DW_AT_name("ctrlPeriod_sec")
    8590                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8591                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8592                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8593              
    8594              $C$DW$765       .dwtag  DW_TAG_member
    8595                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$31)
    8596                      .dwattr $C$DW$765, DW_AT_name("maxVsMag_pu")
    8597                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8598                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8599                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8600              
    8601              $C$DW$766       .dwtag  DW_TAG_member
    8602                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$68)
    8603                      .dwattr $C$DW$766, DW_AT_name("Iab_in")
    8604                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Iab_in")
    8605                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8606                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8607              
    8608              $C$DW$767       .dwtag  DW_TAG_member
    8609                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$68)
    8610                      .dwattr $C$DW$767, DW_AT_name("Iab_filt")
    8611                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_Iab_filt")
    8612                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8613                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  164

    8614              
    8615              $C$DW$768       .dwtag  DW_TAG_member
    8616                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$68)
    8617                      .dwattr $C$DW$768, DW_AT_name("Idq_in")
    8618                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_Idq_in")
    8619                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    8620                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8621              
    8622              $C$DW$769       .dwtag  DW_TAG_member
    8623                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$68)
    8624                      .dwattr $C$DW$769, DW_AT_name("Vab_in")
    8625                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Vab_in")
    8626                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8627                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8628              
    8629              $C$DW$770       .dwtag  DW_TAG_member
    8630                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$31)
    8631                      .dwattr $C$DW$770, DW_AT_name("spd_out")
    8632                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_spd_out")
    8633                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8634                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8635              
    8636              $C$DW$771       .dwtag  DW_TAG_member
    8637                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$68)
    8638                      .dwattr $C$DW$771, DW_AT_name("Vab_out")
    8639                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Vab_out")
    8640                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8641                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8642              
    8643              $C$DW$772       .dwtag  DW_TAG_member
    8644                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$68)
    8645                      .dwattr $C$DW$772, DW_AT_name("Vdq_out")
    8646                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Vdq_out")
    8647                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8648                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8649              
    8650              $C$DW$773       .dwtag  DW_TAG_member
    8651                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$67)
    8652                      .dwattr $C$DW$773, DW_AT_name("Rhf")
    8653                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Rhf")
    8654                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8655                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8656              
    8657              $C$DW$774       .dwtag  DW_TAG_member
    8658                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$67)
    8659                      .dwattr $C$DW$774, DW_AT_name("Lhf")
    8660                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Lhf")
    8661                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8662                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8663              
    8664              $C$DW$775       .dwtag  DW_TAG_member
    8665                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$67)
    8666                      .dwattr $C$DW$775, DW_AT_name("RoverL")
    8667                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_RoverL")
    8668                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  165

    8669                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8670              
    8671              $C$DW$776       .dwtag  DW_TAG_member
    8672                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$31)
    8673                      .dwattr $C$DW$776, DW_AT_name("Kp_Id")
    8674                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Kp_Id")
    8675                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8676                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8677              
    8678              $C$DW$777       .dwtag  DW_TAG_member
    8679                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$31)
    8680                      .dwattr $C$DW$777, DW_AT_name("Kp_Iq")
    8681                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Kp_Iq")
    8682                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8683                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8684              
    8685              $C$DW$778       .dwtag  DW_TAG_member
    8686                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$31)
    8687                      .dwattr $C$DW$778, DW_AT_name("Kp_spd")
    8688                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Kp_spd")
    8689                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8690                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8691              
    8692              $C$DW$779       .dwtag  DW_TAG_member
    8693                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$31)
    8694                      .dwattr $C$DW$779, DW_AT_name("Ki_Id")
    8695                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Ki_Id")
    8696                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8697                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8698              
    8699              $C$DW$780       .dwtag  DW_TAG_member
    8700                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$31)
    8701                      .dwattr $C$DW$780, DW_AT_name("Ki_Iq")
    8702                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Ki_Iq")
    8703                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8704                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8705              
    8706              $C$DW$781       .dwtag  DW_TAG_member
    8707                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$31)
    8708                      .dwattr $C$DW$781, DW_AT_name("Ki_spd")
    8709                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Ki_spd")
    8710                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8711                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8712              
    8713              $C$DW$782       .dwtag  DW_TAG_member
    8714                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$31)
    8715                      .dwattr $C$DW$782, DW_AT_name("Kd_Id")
    8716                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Kd_Id")
    8717                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8718                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8719              
    8720              $C$DW$783       .dwtag  DW_TAG_member
    8721                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$31)
    8722                      .dwattr $C$DW$783, DW_AT_name("Kd_Iq")
    8723                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Kd_Iq")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  166

    8724                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8725                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8726              
    8727              $C$DW$784       .dwtag  DW_TAG_member
    8728                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$31)
    8729                      .dwattr $C$DW$784, DW_AT_name("Kd_spd")
    8730                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Kd_spd")
    8731                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8732                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8733              
    8734              $C$DW$785       .dwtag  DW_TAG_member
    8735                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$31)
    8736                      .dwattr $C$DW$785, DW_AT_name("Ui_Id")
    8737                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Ui_Id")
    8738                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8739                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8740              
    8741              $C$DW$786       .dwtag  DW_TAG_member
    8742                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$31)
    8743                      .dwattr $C$DW$786, DW_AT_name("Ui_Iq")
    8744                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Ui_Iq")
    8745                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8746                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8747              
    8748              $C$DW$787       .dwtag  DW_TAG_member
    8749                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$31)
    8750                      .dwattr $C$DW$787, DW_AT_name("Ui_spd")
    8751                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Ui_spd")
    8752                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8753                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8754              
    8755              $C$DW$788       .dwtag  DW_TAG_member
    8756                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$68)
    8757                      .dwattr $C$DW$788, DW_AT_name("Idq_ref")
    8758                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Idq_ref")
    8759                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8760                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8761              
    8762              $C$DW$789       .dwtag  DW_TAG_member
    8763                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$31)
    8764                      .dwattr $C$DW$789, DW_AT_name("IdRated")
    8765                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_IdRated")
    8766                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    8767                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8768              
    8769              $C$DW$790       .dwtag  DW_TAG_member
    8770                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$31)
    8771                      .dwattr $C$DW$790, DW_AT_name("spd_ref")
    8772                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_spd_ref")
    8773                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8774                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8775              
    8776              $C$DW$791       .dwtag  DW_TAG_member
    8777                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$31)
    8778                      .dwattr $C$DW$791, DW_AT_name("spd_max")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  167

    8779                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_spd_max")
    8780                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8781                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8782              
    8783              $C$DW$792       .dwtag  DW_TAG_member
    8784                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$66)
    8785                      .dwattr $C$DW$792, DW_AT_name("counter_current")
    8786                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_counter_current")
    8787                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8788                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8789              
    8790              $C$DW$793       .dwtag  DW_TAG_member
    8791                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$66)
    8792                      .dwattr $C$DW$793, DW_AT_name("counter_isr")
    8793                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_counter_isr")
    8794                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    8795                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8796              
    8797              $C$DW$794       .dwtag  DW_TAG_member
    8798                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$66)
    8799                      .dwattr $C$DW$794, DW_AT_name("counter_speed")
    8800                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_counter_speed")
    8801                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8802                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8803              
    8804              $C$DW$795       .dwtag  DW_TAG_member
    8805                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$66)
    8806                      .dwattr $C$DW$795, DW_AT_name("counter_traj")
    8807                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_counter_traj")
    8808                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8809                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    8810              
    8811              $C$DW$796       .dwtag  DW_TAG_member
    8812                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$69)
    8813                      .dwattr $C$DW$796, DW_AT_name("flag_enableCtrl")
    8814                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8815                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    8816                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8817              
    8818              $C$DW$797       .dwtag  DW_TAG_member
    8819                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$69)
    8820                      .dwattr $C$DW$797, DW_AT_name("flag_enableDcBusComp")
    8821                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    8822                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8823                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    8824              
    8825              $C$DW$798       .dwtag  DW_TAG_member
    8826                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$69)
    8827                      .dwattr $C$DW$798, DW_AT_name("flag_enablePowerWarp")
    8828                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8829                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8830                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    8831              
    8832              $C$DW$799       .dwtag  DW_TAG_member
    8833                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  168

    8834                      .dwattr $C$DW$799, DW_AT_name("flag_enableOffset")
    8835                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_flag_enableOffset")
    8836                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8837                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    8838              
    8839              $C$DW$800       .dwtag  DW_TAG_member
    8840                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$69)
    8841                      .dwattr $C$DW$800, DW_AT_name("flag_enableSpeedCtrl")
    8842                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8843                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8844                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    8845              
    8846              $C$DW$801       .dwtag  DW_TAG_member
    8847                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$69)
    8848                      .dwattr $C$DW$801, DW_AT_name("flag_enableUserMotorParams")
    8849                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    8850                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8851                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    8852              
    8853              $C$DW$802       .dwtag  DW_TAG_member
    8854                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$68)
    8855                      .dwattr $C$DW$802, DW_AT_name("Idq_offset_pu")
    8856                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_Idq_offset_pu")
    8857                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8858                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    8859              
    8860              $C$DW$803       .dwtag  DW_TAG_member
    8861                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$68)
    8862                      .dwattr $C$DW$803, DW_AT_name("Vdq_offset_pu")
    8863                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    8864                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8865                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    8866              
    8867              $C$DW$804       .dwtag  DW_TAG_member
    8868                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$31)
    8869                      .dwattr $C$DW$804, DW_AT_name("angle_pu")
    8870                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_angle_pu")
    8871                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8872                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    8873              
    8874              $C$DW$805       .dwtag  DW_TAG_member
    8875                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$31)
    8876                      .dwattr $C$DW$805, DW_AT_name("speed_ref_pu")
    8877                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_speed_ref_pu")
    8878                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8879                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    8880              
    8881              $C$DW$806       .dwtag  DW_TAG_member
    8882                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$31)
    8883                      .dwattr $C$DW$806, DW_AT_name("speed_fb_pu")
    8884                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_speed_fb_pu")
    8885                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    8886                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    8887              
    8888              $C$DW$807       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  169

    8889                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$31)
    8890                      .dwattr $C$DW$807, DW_AT_name("speed_outMax_pu")
    8891                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_speed_outMax_pu")
    8892                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    8893                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    8894              
    8895              $C$DW$808       .dwtag  DW_TAG_member
    8896                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$69)
    8897                      .dwattr $C$DW$808, DW_AT_name("flag_enableCurrentCtrl")
    8898                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8899                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    8900                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    8901              
    8902                      .dwendtag $C$DW$T$70
    8903              
    8904              $C$DW$T$180     .dwtag  DW_TAG_typedef
    8905                      .dwattr $C$DW$T$180, DW_AT_name("CTRL_Obj")
    8906                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$70)
    8907                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    8908              
    8909              $C$DW$T$167     .dwtag  DW_TAG_pointer_type
    8910                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$70)
    8911                      .dwattr $C$DW$T$167, DW_AT_address_class(0x20)
    8912              
    8913              $C$DW$T$168     .dwtag  DW_TAG_typedef
    8914                      .dwattr $C$DW$T$168, DW_AT_name("CTRL_Handle")
    8915                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$167)
    8916                      .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    8917              
    8918              $C$DW$809       .dwtag  DW_TAG_TI_far_type
    8919                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$168)
    8920              
    8921              $C$DW$T$181     .dwtag  DW_TAG_const_type
    8922                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$809)
    8923              
    8924              
    8925              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    8926                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    8927                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    8928              $C$DW$810       .dwtag  DW_TAG_member
    8929                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$22)
    8930                      .dwattr $C$DW$810, DW_AT_name("rsvd")
    8931                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_rsvd")
    8932                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8933                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    8934              
    8935              $C$DW$811       .dwtag  DW_TAG_member
    8936                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$72)
    8937                      .dwattr $C$DW$811, DW_AT_name("targetProc")
    8938                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_targetProc")
    8939                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8940                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    8941              
    8942              $C$DW$812       .dwtag  DW_TAG_member
    8943                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  170

    8944                      .dwattr $C$DW$812, DW_AT_name("major")
    8945                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_major")
    8946                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8947                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    8948              
    8949              $C$DW$813       .dwtag  DW_TAG_member
    8950                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$22)
    8951                      .dwattr $C$DW$813, DW_AT_name("minor")
    8952                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_minor")
    8953                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8954                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    8955              
    8956                      .dwendtag $C$DW$T$73
    8957              
    8958              $C$DW$T$37      .dwtag  DW_TAG_typedef
    8959                      .dwattr $C$DW$T$37, DW_AT_name("CTRL_Version")
    8960                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    8961                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    8962              
    8963              
    8964              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    8965                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8305_Obj_")
    8966                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    8967              $C$DW$814       .dwtag  DW_TAG_member
    8968                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$75)
    8969                      .dwattr $C$DW$814, DW_AT_name("spiHandle")
    8970                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_spiHandle")
    8971                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8972                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    8973              
    8974              $C$DW$815       .dwtag  DW_TAG_member
    8975                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$77)
    8976                      .dwattr $C$DW$815, DW_AT_name("gpioHandle")
    8977                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_gpioHandle")
    8978                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8979                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    8980              
    8981              $C$DW$816       .dwtag  DW_TAG_member
    8982                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$79)
    8983                      .dwattr $C$DW$816, DW_AT_name("gpioNumber")
    8984                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_gpioNumber")
    8985                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8986                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    8987              
    8988              $C$DW$817       .dwtag  DW_TAG_member
    8989                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$69)
    8990                      .dwattr $C$DW$817, DW_AT_name("RxTimeOut")
    8991                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_RxTimeOut")
    8992                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8993                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    8994              
    8995              $C$DW$818       .dwtag  DW_TAG_member
    8996                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$69)
    8997                      .dwattr $C$DW$818, DW_AT_name("enableTimeOut")
    8998                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_enableTimeOut")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  171

    8999                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9000                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9001              
    9002                      .dwendtag $C$DW$T$80
    9003              
    9004              $C$DW$T$122     .dwtag  DW_TAG_typedef
    9005                      .dwattr $C$DW$T$122, DW_AT_name("DRV8305_Obj")
    9006                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$80)
    9007                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    9008              
    9009              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    9010                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$80)
    9011                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    9012              
    9013              $C$DW$T$121     .dwtag  DW_TAG_typedef
    9014                      .dwattr $C$DW$T$121, DW_AT_name("DRV8305_Handle")
    9015                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    9016                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    9017              
    9018              
    9019              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9020                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    9021                      .dwattr $C$DW$T$19, DW_AT_declaration
    9022                      .dwendtag $C$DW$T$19
    9023              
    9024              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    9025                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$19)
    9026                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    9027              
    9028              $C$DW$T$46      .dwtag  DW_TAG_typedef
    9029                      .dwattr $C$DW$T$46, DW_AT_name("EST_Handle")
    9030                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    9031                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    9032              
    9033              
    9034              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    9035                      .dwattr $C$DW$T$81, DW_AT_name("_FILTER_FO_")
    9036                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0a)
    9037              $C$DW$819       .dwtag  DW_TAG_member
    9038                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$31)
    9039                      .dwattr $C$DW$819, DW_AT_name("a1")
    9040                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_a1")
    9041                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9042                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9043              
    9044              $C$DW$820       .dwtag  DW_TAG_member
    9045                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$31)
    9046                      .dwattr $C$DW$820, DW_AT_name("b0")
    9047                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_b0")
    9048                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9049                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9050              
    9051              $C$DW$821       .dwtag  DW_TAG_member
    9052                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$31)
    9053                      .dwattr $C$DW$821, DW_AT_name("b1")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  172

    9054                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_b1")
    9055                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9056                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    9057              
    9058              $C$DW$822       .dwtag  DW_TAG_member
    9059                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$31)
    9060                      .dwattr $C$DW$822, DW_AT_name("x1")
    9061                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_x1")
    9062                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9063                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    9064              
    9065              $C$DW$823       .dwtag  DW_TAG_member
    9066                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$31)
    9067                      .dwattr $C$DW$823, DW_AT_name("y1")
    9068                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_y1")
    9069                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9070                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    9071              
    9072                      .dwendtag $C$DW$T$81
    9073              
    9074              $C$DW$T$133     .dwtag  DW_TAG_typedef
    9075                      .dwattr $C$DW$T$133, DW_AT_name("FILTER_FO_Obj")
    9076                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$81)
    9077                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    9078              
    9079              $C$DW$T$183     .dwtag  DW_TAG_pointer_type
    9080                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$133)
    9081                      .dwattr $C$DW$T$183, DW_AT_address_class(0x20)
    9082              
    9083              
    9084              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9085                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9086                      .dwattr $C$DW$T$20, DW_AT_declaration
    9087                      .dwendtag $C$DW$T$20
    9088              
    9089              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    9090                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$20)
    9091                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
    9092              
    9093              $C$DW$T$135     .dwtag  DW_TAG_typedef
    9094                      .dwattr $C$DW$T$135, DW_AT_name("FILTER_FO_Handle")
    9095                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    9096                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    9097              
    9098              
    9099              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    9100                      .dwattr $C$DW$T$82, DW_AT_name("_FLASH_Obj_")
    9101                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    9102              $C$DW$824       .dwtag  DW_TAG_member
    9103                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$23)
    9104                      .dwattr $C$DW$824, DW_AT_name("FOPT")
    9105                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_FOPT")
    9106                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9107                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    9108              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  173

    9109              $C$DW$825       .dwtag  DW_TAG_member
    9110                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$23)
    9111                      .dwattr $C$DW$825, DW_AT_name("rsvd_1")
    9112                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_rsvd_1")
    9113                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9114                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    9115              
    9116              $C$DW$826       .dwtag  DW_TAG_member
    9117                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$23)
    9118                      .dwattr $C$DW$826, DW_AT_name("FPWR")
    9119                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_FPWR")
    9120                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9121                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    9122              
    9123              $C$DW$827       .dwtag  DW_TAG_member
    9124                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$23)
    9125                      .dwattr $C$DW$827, DW_AT_name("FSTATUS")
    9126                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_FSTATUS")
    9127                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9128                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    9129              
    9130              $C$DW$828       .dwtag  DW_TAG_member
    9131                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$23)
    9132                      .dwattr $C$DW$828, DW_AT_name("FSTDBYWAIT")
    9133                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9134                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9135                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    9136              
    9137              $C$DW$829       .dwtag  DW_TAG_member
    9138                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$23)
    9139                      .dwattr $C$DW$829, DW_AT_name("FACTIVEWAIT")
    9140                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9141                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9142                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    9143              
    9144              $C$DW$830       .dwtag  DW_TAG_member
    9145                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$23)
    9146                      .dwattr $C$DW$830, DW_AT_name("FBANKWAIT")
    9147                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_FBANKWAIT")
    9148                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9149                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    9150              
    9151              $C$DW$831       .dwtag  DW_TAG_member
    9152                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$23)
    9153                      .dwattr $C$DW$831, DW_AT_name("FOTPWAIT")
    9154                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_FOTPWAIT")
    9155                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9156                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    9157              
    9158                      .dwendtag $C$DW$T$82
    9159              
    9160              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    9161                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$82)
    9162                      .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
    9163              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:07:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{37AE2F74-6EBD-40C4-A51C-C84AFD974697} PAGE  174

    9164              $C$DW$T$96      .dwtag  DW_TAG_typedef
    9165                      .dwattr $C$DW$T$96, DW_AT_name("FLASH_Handle")
    9166                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    9167                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    9168              
    9169              
    9170              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9171                      .dwattr $C$DW$T$86, DW_AT_name("_GPIO_Obj_")
    9172                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x6a)
    9173              $C$DW$832       .dwtag  DW_TAG_member
    9174                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$83)
    9175                      .dwattr $C$DW$832, DW_AT_name("GPACTRL")
    9176                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_GPACTRL")
    9177                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9178                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    9179              
    9180              $C$DW$833       .dwtag  DW_TAG_member
    9181                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$83)
    9182                      .dwattr $C$DW$833, DW_AT_name("GPAQSEL1")
    9183                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_GPAQSEL1")
    9184                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9185                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    9186              
    9187              $C$DW$834       .dwtag  DW_TAG_member
    9188                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$83)
    9189                      .dwattr $C$DW$834, DW_AT_name("GPAQSEL2")
    9190                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_GPAQSEL2")
    9191                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9192                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    9193              
    9194              $C$DW$835       .dwtag  DW_TAG_member
    9195                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$83)
    9196                      .dwattr $C$DW$835, DW_AT_name("GPAMUX1")
    9197                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_GPAMUX1")
    9198                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9199                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    9200              
    9201              $C$DW$836       .dwtag  DW_TAG_member
    9202                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$83)
    9203                      .dwattr $C$DW$836, DW_AT_name("GPAMUX2")
    9204                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_GPAMUX2")
    9205                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9206                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    9207              
    9208              $C$DW$837       .dwtag  DW_TAG_member
    9209                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$83)
    9210                      .dwattr $C$DW$837, DW_AT_name("GPADIR")
    9211                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_GPADIR")
    9212                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9213                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    9214              
