TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{38B76BC7-DF9E-4DB6-BEBD-7AED90F21520} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sun Jan 28 18:08:03 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/modules/fem/src/32b/fem.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("G:\code\c\ccs\remote_car\Flash")
      13              ;       D:\ti\ccsv7\tools\compiler\ti-cgt-c2000_16.9.6.LTS\bin\opt2000.exe C:\\Users\\Zulolo\\AppData\\Local\

     222              $C$DW$19        .dwtag  DW_TAG_subprogram
     223                      .dwattr $C$DW$19, DW_AT_name("FEM_init")
     224                      .dwattr $C$DW$19, DW_AT_low_pc(_FEM_init)
     225                      .dwattr $C$DW$19, DW_AT_high_pc(0x00)
     226                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_FEM_init")
     227                      .dwattr $C$DW$19, DW_AT_external
     228                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$24)
     229                      .dwattr $C$DW$19, DW_AT_TI_begin_file("D:/ti/motorware/motorware_1_01_00_18/sw/modules/fem/src/32b/fe
     230                      .dwattr $C$DW$19, DW_AT_TI_begin_line(0x15)
     231                      .dwattr $C$DW$19, DW_AT_TI_begin_column(0x0c)
     232                      .dwattr $C$DW$19, DW_AT_TI_max_frame_size(-2)
     233                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/fem/src/32b/fem.c",line 22,column 1,is_
     234              
     235                      .dwfde $C$DW$CIE, _FEM_init
     236              $C$DW$20        .dwtag  DW_TAG_formal_parameter
     237                      .dwattr $C$DW$20, DW_AT_name("pMemory")
     238                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_pMemory")
     239                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$3)
     240                      .dwattr $C$DW$20, DW_AT_location[DW_OP_reg12]
     241              
     242              $C$DW$21        .dwtag  DW_TAG_formal_parameter
     243                      .dwattr $C$DW$21, DW_AT_name("numBytes")
     244                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_numBytes")
     245                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$26)
     246                      .dwattr $C$DW$21, DW_AT_location[DW_OP_reg0]
     247              
     248              
     249              ;***************************************************************
     250              ;* FNAME: _FEM_init                     FR SIZE:   0           *
     251              ;*                                                             *
     252              ;* FUNCTION ENVIRONMENT                                        *
     253              ;*                                                             *
     254              ;* FUNCTION PROPERTIES                                         *
     255              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     256              ;***************************************************************
     257              
     258              _FEM_init:
     259              ;* AR6   assigned to _numBytes
     260              $C$DW$22        .dwtag  DW_TAG_variable
     261                      .dwattr $C$DW$22, DW_AT_name("numBytes")
     262                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_numBytes")
     263                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$27)
     264                      .dwattr $C$DW$22, DW_AT_location[DW_OP_reg16]
     265              
     266                      .dwcfi  cfa_offset, -2
     267                      .dwcfi  save_reg_to_mem, 26, 0
     268 00000032 1EA6          MOVL      XAR6,ACC              ; [CPU_] |22| 
     269                      .dwpsn  file "D:/ti/motorware/motorware_1_01_00_18/sw/modules/fem/src/32b/fem.c",line 26,column 5,is_
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{38B76BC7-DF9E-4DB6-BEBD-7AED90F21520} PAGE    6

     270 00000033 0212          MOVB      ACC,#18               ; [CPU_] |26| 
     271 00000034 0FA6          CMPL      ACC,XAR6              ; [CPU_] |26| 
     272 00000035 6902          B         $C$L1,LOS             ; [CPU_] |26| 
     273                      ; branchcc occurs ; [] |26| 
     274 00000036 D400          MOVB      XAR4,#0               ; [CPU_] |26| 
     275              $C$L1:    
     276              $C$DW$23        .dwtag  DW_TAG_TI_branch
     277                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     278                      .dwattr $C$DW$23, DW_AT_TI_return
     279              
     280 00000037 0006          LRETR     ; [CPU_] 
     281                      ; return occurs ; [] 
     282                      .dwattr $C$DW$19, DW_AT_TI_end_file("D:/ti/motorware/motorware_1_01_00_18/sw/modules/fem/src/32b/fem.
     283                      .dwattr $C$DW$19, DW_AT_TI_end_line(0x20)
     284                      .dwattr $C$DW$19, DW_AT_TI_end_column(0x01)
     285                      .dwendentry
     286                      .dwendtag $C$DW$19
     287              
     288              ;**************************************************************
     289              ;* UNDEFINED EXTERNAL REFERENCES                              *
     290              ;**************************************************************
     291                      .global FS$$SUB
     292                      .global FS$$DIV
     293                      .global FS$$TOUL
     294                      .global FS$$ADD
     295              
     296              ;***************************************************************
     297              ;* TYPE INFORMATION                                            *
     298              ;***************************************************************
     299              
     300              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     301                      .dwattr $C$DW$T$21, DW_AT_name("_FEM_Obj_")
     302                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x12)
     303              $C$DW$24        .dwtag  DW_TAG_member
     304                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     305                      .dwattr $C$DW$24, DW_AT_name("timerPeriod_cnts")
     306                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_timerPeriod_cnts")
     307                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     308                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     309              
     310              $C$DW$25        .dwtag  DW_TAG_member
     311                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     312                      .dwattr $C$DW$25, DW_AT_name("cnt_z0")
     313                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_cnt_z0")
     314                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     315                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     316              
     317              $C$DW$26        .dwtag  DW_TAG_member
     318                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     319                      .dwattr $C$DW$26, DW_AT_name("cnt_z1")
     320                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_cnt_z1")
     321                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     322                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     323              
     324              $C$DW$27        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{38B76BC7-DF9E-4DB6-BEBD-7AED90F21520} PAGE    7

     325                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     326                      .dwattr $C$DW$27, DW_AT_name("deltaCnt")
     327                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_deltaCnt")
     328                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     329                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     330              
     331              $C$DW$28        .dwtag  DW_TAG_member
     332                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     333                      .dwattr $C$DW$28, DW_AT_name("maxDeltaCnt")
     334                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_maxDeltaCnt")
     335                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     336                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     337              
     338              $C$DW$29        .dwtag  DW_TAG_member
     339                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     340                      .dwattr $C$DW$29, DW_AT_name("minDeltaCnt")
     341                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_minDeltaCnt")
     342                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     343                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     344              
     345              $C$DW$30        .dwtag  DW_TAG_member
     346                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     347                      .dwattr $C$DW$30, DW_AT_name("maxDeltaCntObserved")
     348                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
     349                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     350                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     351              
     352              $C$DW$31        .dwtag  DW_TAG_member
     353                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     354                      .dwattr $C$DW$31, DW_AT_name("errorCnt")
     355                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_errorCnt")
     356                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     357                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     358              
     359              $C$DW$32        .dwtag  DW_TAG_member
     360                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$20)
     361                      .dwattr $C$DW$32, DW_AT_name("flag_freqError")
     362                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_flag_freqError")
     363                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     364                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     365              
     366                      .dwendtag $C$DW$T$21
     367              
     368              $C$DW$T$22      .dwtag  DW_TAG_typedef
     369                      .dwattr $C$DW$T$22, DW_AT_name("FEM_Obj")
     370                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     371                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     372              
     373              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
     374                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
     375                      .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
     376              
     377              $C$DW$T$24      .dwtag  DW_TAG_typedef
     378                      .dwattr $C$DW$T$24, DW_AT_name("FEM_Handle")
     379                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:03 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{38B76BC7-DF9E-4DB6-BEBD-7AED90F21520} PAGE    8

     380                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     381              
     382              $C$DW$33        .dwtag  DW_TAG_TI_far_type
     383                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$24)
     384              
     385              $C$DW$T$25      .dwtag  DW_TAG_const_type
     386                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$33)
     387              
     388              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     389                      .dwattr $C$DW$T$2, DW_AT_name("void")
     390              
     391              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     392                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     393                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     394              
     395              $C$DW$T$4       .dwtag  DW_TAG_base_type
     396                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     397                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     398                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     399              
     400              $C$DW$T$5       .dwtag  DW_TAG_base_type
     401                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     402                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     403                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     404              
     405              $C$DW$T$6       .dwtag  DW_TAG_base_type
     406                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     407                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     408                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     409              
     410              $C$DW$T$7       .dwtag  DW_TAG_base_type
     411                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     412                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     413                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     414              
     415              $C$DW$T$8       .dwtag  DW_TAG_base_type
     416                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     417                      .dwattr $C$DW$T$8, DW_AT_name("short")
     418                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     419              
     420              $C$DW$T$9       .dwtag  DW_TAG_base_type
     421                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     422                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     423                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     424              
     425              $C$DW$T$10      .dwtag  DW_TAG_base_type
