TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Jan 30 22:35:51 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/ti/motorware/motorware_1_01_00_18/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("G:\code\c\ccs\remote_car\Flash")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SPI_setBaudRate")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_setBaudRate")

   13136                      .dwendtag $C$DW$T$360
   13137              
   13138              $C$DW$T$361     .dwtag  DW_TAG_typedef
   13139                      .dwattr $C$DW$T$361, DW_AT_name("SPI_Mode_e")
   13140                      .dwattr $C$DW$T$361, DW_AT_type(*$C$DW$T$360)
   13141                      .dwattr $C$DW$T$361, DW_AT_language(DW_LANG_C)
   13142              
   13143              $C$DW$1762      .dwtag  DW_TAG_TI_far_type
   13144                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$361)
   13145              
   13146              $C$DW$T$362     .dwtag  DW_TAG_const_type
   13147                      .dwattr $C$DW$T$362, DW_AT_type(*$C$DW$1762)
   13148              
   13149              
   13150              $C$DW$T$363     .dwtag  DW_TAG_enumeration_type
   13151                      .dwattr $C$DW$T$363, DW_AT_byte_size(0x01)
   13152              $C$DW$1763      .dwtag  DW_TAG_enumerator
   13153                      .dwattr $C$DW$1763, DW_AT_name("SPI_TxSuspend_00")
   13154                      .dwattr $C$DW$1763, DW_AT_const_value(0x00)
   13155              
   13156              $C$DW$1764      .dwtag  DW_TAG_enumerator
   13157                      .dwattr $C$DW$1764, DW_AT_name("SPI_TxSuspend_10")
   13158                      .dwattr $C$DW$1764, DW_AT_const_value(0x20)
   13159              
   13160              $C$DW$1765      .dwtag  DW_TAG_enumerator
   13161                      .dwattr $C$DW$1765, DW_AT_name("SPI_TxSuspend_free")
   13162                      .dwattr $C$DW$1765, DW_AT_const_value(0x10)
   13163              
   13164                      .dwendtag $C$DW$T$363
   13165              
   13166              $C$DW$T$364     .dwtag  DW_TAG_typedef
   13167                      .dwattr $C$DW$T$364, DW_AT_name("SPI_EmulationSuspend_e")
   13168                      .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$363)
   13169                      .dwattr $C$DW$T$364, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  249

   13170              
   13171              $C$DW$1766      .dwtag  DW_TAG_TI_far_type
   13172                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$364)
   13173              
   13174              $C$DW$T$365     .dwtag  DW_TAG_const_type
   13175                      .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$1766)
   13176              
   13177              
   13178              $C$DW$T$366     .dwtag  DW_TAG_enumeration_type
   13179                      .dwattr $C$DW$T$366, DW_AT_byte_size(0x01)
   13180              $C$DW$1767      .dwtag  DW_TAG_enumerator
   13181                      .dwattr $C$DW$1767, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement")
   13182                      .dwattr $C$DW$1767, DW_AT_const_value(0x00)
   13183              
   13184              $C$DW$1768      .dwtag  DW_TAG_enumerator
   13185                      .dwattr $C$DW$1768, DW_AT_name("TIMER_EmulationMode_StopAtZero")
   13186                      .dwattr $C$DW$1768, DW_AT_const_value(0x400)
   13187              
   13188              $C$DW$1769      .dwtag  DW_TAG_enumerator
   13189                      .dwattr $C$DW$1769, DW_AT_name("TIMER_EmulationMode_RunFree")
   13190                      .dwattr $C$DW$1769, DW_AT_const_value(0x800)
   13191              
   13192                      .dwendtag $C$DW$T$366
   13193              
   13194              $C$DW$T$367     .dwtag  DW_TAG_typedef
   13195                      .dwattr $C$DW$T$367, DW_AT_name("TIMER_EmulationMode_e")
   13196                      .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$366)
   13197                      .dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
   13198              
   13199              $C$DW$1770      .dwtag  DW_TAG_TI_far_type
   13200                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$367)
   13201              
   13202              $C$DW$T$368     .dwtag  DW_TAG_const_type
   13203                      .dwattr $C$DW$T$368, DW_AT_type(*$C$DW$1770)
   13204              
   13205              
   13206              $C$DW$T$369     .dwtag  DW_TAG_enumeration_type
   13207                      .dwattr $C$DW$T$369, DW_AT_byte_size(0x01)
   13208              $C$DW$1771      .dwtag  DW_TAG_enumerator
   13209                      .dwattr $C$DW$1771, DW_AT_name("HAL_SensorType_Current")
   13210                      .dwattr $C$DW$1771, DW_AT_const_value(0x00)
   13211              
   13212              $C$DW$1772      .dwtag  DW_TAG_enumerator
   13213                      .dwattr $C$DW$1772, DW_AT_name("HAL_SensorType_Voltage")
   13214                      .dwattr $C$DW$1772, DW_AT_const_value(0x01)
   13215              
   13216                      .dwendtag $C$DW$T$369
   13217              
   13218              $C$DW$T$370     .dwtag  DW_TAG_typedef
   13219                      .dwattr $C$DW$T$370, DW_AT_name("HAL_SensorType_e")
   13220                      .dwattr $C$DW$T$370, DW_AT_type(*$C$DW$T$369)
   13221                      .dwattr $C$DW$T$370, DW_AT_language(DW_LANG_C)
   13222              
   13223              
   13224              $C$DW$T$29      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  250

   13225                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   13226                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   13227              $C$DW$1773      .dwtag  DW_TAG_member
   13228                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$23)
   13229                      .dwattr $C$DW$1773, DW_AT_name("ADCRESULT")
   13230                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_ADCRESULT")
   13231                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13232                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
   13233              
   13234              $C$DW$1774      .dwtag  DW_TAG_member
   13235                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$24)
   13236                      .dwattr $C$DW$1774, DW_AT_name("resvd_1")
   13237                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_resvd_1")
   13238                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13239                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
   13240              
   13241              $C$DW$1775      .dwtag  DW_TAG_member
   13242                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$22)
   13243                      .dwattr $C$DW$1775, DW_AT_name("ADCCTL1")
   13244                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_ADCCTL1")
   13245                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   13246                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
   13247              
   13248              $C$DW$1776      .dwtag  DW_TAG_member
   13249                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$22)
   13250                      .dwattr $C$DW$1776, DW_AT_name("ADCCTL2")
   13251                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_ADCCTL2")
   13252                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   13253                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
   13254              
   13255              $C$DW$1777      .dwtag  DW_TAG_member
   13256                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$25)
   13257                      .dwattr $C$DW$1777, DW_AT_name("rsvd_2")
   13258                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_rsvd_2")
   13259                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   13260                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
   13261              
   13262              $C$DW$1778      .dwtag  DW_TAG_member
   13263                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$22)
   13264                      .dwattr $C$DW$1778, DW_AT_name("ADCINTFLG")
   13265                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_ADCINTFLG")
   13266                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   13267                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
   13268              
   13269              $C$DW$1779      .dwtag  DW_TAG_member
   13270                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$22)
   13271                      .dwattr $C$DW$1779, DW_AT_name("ADCINTFLGCLR")
   13272                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   13273                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   13274                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
   13275              
   13276              $C$DW$1780      .dwtag  DW_TAG_member
   13277                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$22)
   13278                      .dwattr $C$DW$1780, DW_AT_name("ADCINTOVF")
   13279                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_ADCINTOVF")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  251

   13280                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   13281                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
   13282              
   13283              $C$DW$1781      .dwtag  DW_TAG_member
   13284                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$22)
   13285                      .dwattr $C$DW$1781, DW_AT_name("ADCINTOVFCLR")
   13286                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   13287                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   13288                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   13289              
   13290              $C$DW$1782      .dwtag  DW_TAG_member
   13291                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$26)
   13292                      .dwattr $C$DW$1782, DW_AT_name("INTSELxNy")
   13293                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_INTSELxNy")
   13294                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   13295                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
   13296              
   13297              $C$DW$1783      .dwtag  DW_TAG_member
   13298                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$27)
   13299                      .dwattr $C$DW$1783, DW_AT_name("rsvd_3")
   13300                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_rsvd_3")
   13301                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   13302                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   13303              
   13304              $C$DW$1784      .dwtag  DW_TAG_member
   13305                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$22)
   13306                      .dwattr $C$DW$1784, DW_AT_name("SOCPRICTRL")
   13307                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_SOCPRICTRL")
   13308                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   13309                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   13310              
   13311              $C$DW$1785      .dwtag  DW_TAG_member
   13312                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$22)
   13313                      .dwattr $C$DW$1785, DW_AT_name("rsvd_4")
   13314                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_rsvd_4")
   13315                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   13316                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   13317              
   13318              $C$DW$1786      .dwtag  DW_TAG_member
   13319                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$22)
   13320                      .dwattr $C$DW$1786, DW_AT_name("ADCSAMPLEMODE")
   13321                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   13322                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   13323                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   13324              
   13325              $C$DW$1787      .dwtag  DW_TAG_member
   13326                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$22)
   13327                      .dwattr $C$DW$1787, DW_AT_name("rsvd_5")
   13328                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_rsvd_5")
   13329                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   13330                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   13331              
   13332              $C$DW$1788      .dwtag  DW_TAG_member
   13333                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$22)
   13334                      .dwattr $C$DW$1788, DW_AT_name("ADCINTSOCSEL1")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  252

   13335                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   13336                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   13337                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   13338              
   13339              $C$DW$1789      .dwtag  DW_TAG_member
   13340                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$22)
   13341                      .dwattr $C$DW$1789, DW_AT_name("ADCINTSOCSEL2")
   13342                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   13343                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   13344                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   13345              
   13346              $C$DW$1790      .dwtag  DW_TAG_member
   13347                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$25)
   13348                      .dwattr $C$DW$1790, DW_AT_name("rsvd_6")
   13349                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_rsvd_6")
   13350                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   13351                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   13352              
   13353              $C$DW$1791      .dwtag  DW_TAG_member
   13354                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$22)
   13355                      .dwattr $C$DW$1791, DW_AT_name("ADCSOCFLG1")
   13356                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   13357                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   13358                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   13359              
   13360              $C$DW$1792      .dwtag  DW_TAG_member
   13361                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$22)
   13362                      .dwattr $C$DW$1792, DW_AT_name("rsvd_7")
   13363                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_rsvd_7")
   13364                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   13365                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   13366              
   13367              $C$DW$1793      .dwtag  DW_TAG_member
   13368                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$22)
   13369                      .dwattr $C$DW$1793, DW_AT_name("ADCSOCFRC1")
   13370                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   13371                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   13372                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   13373              
   13374              $C$DW$1794      .dwtag  DW_TAG_member
   13375                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$22)
   13376                      .dwattr $C$DW$1794, DW_AT_name("rsvd_8")
   13377                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_rsvd_8")
   13378                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   13379                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   13380              
   13381              $C$DW$1795      .dwtag  DW_TAG_member
   13382                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$22)
   13383                      .dwattr $C$DW$1795, DW_AT_name("ADCSOCOVF1")
   13384                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   13385                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   13386                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   13387              
   13388              $C$DW$1796      .dwtag  DW_TAG_member
   13389                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  253

   13390                      .dwattr $C$DW$1796, DW_AT_name("rsvd_9")
   13391                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_rsvd_9")
   13392                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   13393                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   13394              
   13395              $C$DW$1797      .dwtag  DW_TAG_member
   13396                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$22)
   13397                      .dwattr $C$DW$1797, DW_AT_name("ADCSOCOVFCLR1")
   13398                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   13399                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   13400                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   13401              
   13402              $C$DW$1798      .dwtag  DW_TAG_member
   13403                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$22)
   13404                      .dwattr $C$DW$1798, DW_AT_name("rsvd_10")
   13405                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_rsvd_10")
   13406                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   13407                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   13408              
   13409              $C$DW$1799      .dwtag  DW_TAG_member
   13410                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$23)
   13411                      .dwattr $C$DW$1799, DW_AT_name("ADCSOCxCTL")
   13412                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   13413                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   13414                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   13415              
   13416              $C$DW$1800      .dwtag  DW_TAG_member
   13417                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$23)
   13418                      .dwattr $C$DW$1800, DW_AT_name("rsvd_11")
   13419                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_rsvd_11")
   13420                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   13421                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   13422              
   13423              $C$DW$1801      .dwtag  DW_TAG_member
   13424                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$22)
   13425                      .dwattr $C$DW$1801, DW_AT_name("ADCREFTRIM")
   13426                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_ADCREFTRIM")
   13427                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   13428                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   13429              
   13430              $C$DW$1802      .dwtag  DW_TAG_member
   13431                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$22)
   13432                      .dwattr $C$DW$1802, DW_AT_name("ADCOFFTRIM")
   13433                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   13434                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   13435                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   13436              
   13437              $C$DW$1803      .dwtag  DW_TAG_member
   13438                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$28)
   13439                      .dwattr $C$DW$1803, DW_AT_name("resvd_12")
   13440                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_resvd_12")
   13441                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   13442                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   13443              
   13444              $C$DW$1804      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  254

   13445                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$22)
   13446                      .dwattr $C$DW$1804, DW_AT_name("ADCREV")
   13447                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_ADCREV")
   13448                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   13449                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   13450              
   13451                      .dwendtag $C$DW$T$29
   13452              
   13453              $C$DW$T$372     .dwtag  DW_TAG_typedef
   13454                      .dwattr $C$DW$T$372, DW_AT_name("ADC_Obj")
   13455                      .dwattr $C$DW$T$372, DW_AT_type(*$C$DW$T$29)
   13456                      .dwattr $C$DW$T$372, DW_AT_language(DW_LANG_C)
   13457              
   13458              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
   13459                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$29)
   13460                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
   13461              
   13462              $C$DW$T$125     .dwtag  DW_TAG_typedef
   13463                      .dwattr $C$DW$T$125, DW_AT_name("ADC_Handle")
   13464                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
   13465                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
   13466              
   13467              
   13468              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   13469                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   13470                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   13471              $C$DW$1805      .dwtag  DW_TAG_member
   13472                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$22)
   13473                      .dwattr $C$DW$1805, DW_AT_name("XCLK")
   13474                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_XCLK")
   13475                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13476                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   13477              
   13478              $C$DW$1806      .dwtag  DW_TAG_member
   13479                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$22)
   13480                      .dwattr $C$DW$1806, DW_AT_name("rsvd_1")
   13481                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_rsvd_1")
   13482                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13483                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   13484              
   13485              $C$DW$1807      .dwtag  DW_TAG_member
   13486                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$22)
   13487                      .dwattr $C$DW$1807, DW_AT_name("CLKCTL")
   13488                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_CLKCTL")
   13489                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13490                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   13491              
   13492              $C$DW$1808      .dwtag  DW_TAG_member
   13493                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$30)
   13494                      .dwattr $C$DW$1808, DW_AT_name("rsvd_2")
   13495                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_rsvd_2")
   13496                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13497                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   13498              
   13499              $C$DW$1809      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  255

   13500                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$22)
   13501                      .dwattr $C$DW$1809, DW_AT_name("LOSPCP")
   13502                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_LOSPCP")
   13503                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13504                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   13505              
   13506              $C$DW$1810      .dwtag  DW_TAG_member
   13507                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$22)
   13508                      .dwattr $C$DW$1810, DW_AT_name("PCLKCR0")
   13509                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_PCLKCR0")
   13510                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13511                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   13512              
   13513              $C$DW$1811      .dwtag  DW_TAG_member
   13514                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$22)
   13515                      .dwattr $C$DW$1811, DW_AT_name("PCLKCR1")
   13516                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_PCLKCR1")
   13517                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   13518                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   13519              
   13520              $C$DW$1812      .dwtag  DW_TAG_member
   13521                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$25)
   13522                      .dwattr $C$DW$1812, DW_AT_name("rsvd_3")
   13523                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_rsvd_3")
   13524                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13525                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   13526              
   13527              $C$DW$1813      .dwtag  DW_TAG_member
   13528                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$22)
   13529                      .dwattr $C$DW$1813, DW_AT_name("PCLKCR3")
   13530                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_PCLKCR3")
   13531                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13532                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   13533              
   13534                      .dwendtag $C$DW$T$31
   13535              
   13536              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
   13537                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$31)
   13538                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
   13539              
   13540              $C$DW$T$127     .dwtag  DW_TAG_typedef
   13541                      .dwattr $C$DW$T$127, DW_AT_name("CLK_Handle")
   13542                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
   13543                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
   13544              
   13545              
   13546              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   13547                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   13548                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   13549              $C$DW$1814      .dwtag  DW_TAG_member
   13550                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$32)
   13551                      .dwattr $C$DW$1814, DW_AT_name("tmp")
   13552                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_tmp")
   13553                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13554                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  256

   13555              
   13556                      .dwendtag $C$DW$T$33
   13557              
   13558              $C$DW$T$381     .dwtag  DW_TAG_typedef
   13559                      .dwattr $C$DW$T$381, DW_AT_name("CPU_Obj")
   13560                      .dwattr $C$DW$T$381, DW_AT_type(*$C$DW$T$33)
   13561                      .dwattr $C$DW$T$381, DW_AT_language(DW_LANG_C)
   13562              
   13563              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
   13564                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$33)
   13565                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
   13566              
   13567              $C$DW$T$129     .dwtag  DW_TAG_typedef
   13568                      .dwattr $C$DW$T$129, DW_AT_name("CPU_Handle")
   13569                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
   13570                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
   13571              
   13572              
   13573              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   13574                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8305_Obj_")
   13575                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   13576              $C$DW$1815      .dwtag  DW_TAG_member
   13577                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$35)
   13578                      .dwattr $C$DW$1815, DW_AT_name("spiHandle")
   13579                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_spiHandle")
   13580                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13581                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   13582              
   13583              $C$DW$1816      .dwtag  DW_TAG_member
   13584                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$37)
   13585                      .dwattr $C$DW$1816, DW_AT_name("gpioHandle")
   13586                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_gpioHandle")
   13587                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13588                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   13589              
   13590              $C$DW$1817      .dwtag  DW_TAG_member
   13591                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$39)
   13592                      .dwattr $C$DW$1817, DW_AT_name("gpioNumber")
   13593                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_gpioNumber")
   13594                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13595                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   13596              
   13597              $C$DW$1818      .dwtag  DW_TAG_member
   13598                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$40)
   13599                      .dwattr $C$DW$1818, DW_AT_name("RxTimeOut")
   13600                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_RxTimeOut")
   13601                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13602                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   13603              
   13604              $C$DW$1819      .dwtag  DW_TAG_member
   13605                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$40)
   13606                      .dwattr $C$DW$1819, DW_AT_name("enableTimeOut")
   13607                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_enableTimeOut")
   13608                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13609                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  257

   13610              
   13611                      .dwendtag $C$DW$T$41
   13612              
   13613              $C$DW$T$157     .dwtag  DW_TAG_typedef
   13614                      .dwattr $C$DW$T$157, DW_AT_name("DRV8305_Obj")
   13615                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$41)
   13616                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
   13617              
   13618              $C$DW$T$155     .dwtag  DW_TAG_pointer_type
   13619                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$41)
   13620                      .dwattr $C$DW$T$155, DW_AT_address_class(0x20)
   13621              
   13622              $C$DW$T$156     .dwtag  DW_TAG_typedef
   13623                      .dwattr $C$DW$T$156, DW_AT_name("DRV8305_Handle")
   13624                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$155)
   13625                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
   13626              
   13627              
   13628              $C$DW$T$48      .dwtag  DW_TAG_structure_type
   13629                      .dwattr $C$DW$T$48, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
   13630                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
   13631              $C$DW$1820      .dwtag  DW_TAG_member
   13632                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$43)
   13633                      .dwattr $C$DW$1820, DW_AT_name("IDRIVEP_HS")
   13634                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_IDRIVEP_HS")
   13635                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13636                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   13637              
   13638              $C$DW$1821      .dwtag  DW_TAG_member
   13639                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$45)
   13640                      .dwattr $C$DW$1821, DW_AT_name("IDRIVEN_HS")
   13641                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_IDRIVEN_HS")
   13642                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13643                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   13644              
   13645              $C$DW$1822      .dwtag  DW_TAG_member
   13646                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$47)
   13647                      .dwattr $C$DW$1822, DW_AT_name("TDRIVEN")
   13648                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_TDRIVEN")
   13649                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13650                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   13651              
   13652              $C$DW$1823      .dwtag  DW_TAG_member
   13653                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$40)
   13654                      .dwattr $C$DW$1823, DW_AT_name("CTRL05_RSV1")
   13655                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_CTRL05_RSV1")
   13656                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13657                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   13658              
   13659                      .dwendtag $C$DW$T$48
   13660              
   13661              $C$DW$T$100     .dwtag  DW_TAG_typedef
   13662                      .dwattr $C$DW$T$100, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
   13663                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$48)
   13664                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  258

   13665              
   13666              
   13667              $C$DW$T$55      .dwtag  DW_TAG_structure_type
   13668                      .dwattr $C$DW$T$55, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
   13669                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
   13670              $C$DW$1824      .dwtag  DW_TAG_member
   13671                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$50)
   13672                      .dwattr $C$DW$1824, DW_AT_name("IDRIVEP_LS")
   13673                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_IDRIVEP_LS")
   13674                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13675                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   13676              
   13677              $C$DW$1825      .dwtag  DW_TAG_member
   13678                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$52)
   13679                      .dwattr $C$DW$1825, DW_AT_name("IDRIVEN_LS")
   13680                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_IDRIVEN_LS")
   13681                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13682                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   13683              
   13684              $C$DW$1826      .dwtag  DW_TAG_member
   13685                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$54)
   13686                      .dwattr $C$DW$1826, DW_AT_name("TDRIVEP")
   13687                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_TDRIVEP")
   13688                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13689                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   13690              
   13691              $C$DW$1827      .dwtag  DW_TAG_member
   13692                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$40)
   13693                      .dwattr $C$DW$1827, DW_AT_name("CTRL06_RSV1")
   13694                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_CTRL06_RSV1")
   13695                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13696                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   13697              
   13698                      .dwendtag $C$DW$T$55
   13699              
   13700              $C$DW$T$101     .dwtag  DW_TAG_typedef
   13701                      .dwattr $C$DW$T$101, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
   13702                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$55)
   13703                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
   13704              
   13705              
   13706              $C$DW$T$66      .dwtag  DW_TAG_structure_type
   13707                      .dwattr $C$DW$T$66, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
   13708                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x06)
   13709              $C$DW$1828      .dwtag  DW_TAG_member
   13710                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$57)
   13711                      .dwattr $C$DW$1828, DW_AT_name("TVDS")
   13712                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_TVDS")
   13713                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13714                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   13715              
   13716              $C$DW$1829      .dwtag  DW_TAG_member
   13717                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$59)
   13718                      .dwattr $C$DW$1829, DW_AT_name("TBLANK")
   13719                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_TBLANK")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  259

   13720                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13721                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   13722              
   13723              $C$DW$1830      .dwtag  DW_TAG_member
   13724                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$61)
   13725                      .dwattr $C$DW$1830, DW_AT_name("DEAD_TIME")
   13726                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_DEAD_TIME")
   13727                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13728                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   13729              
   13730              $C$DW$1831      .dwtag  DW_TAG_member
   13731                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$63)
   13732                      .dwattr $C$DW$1831, DW_AT_name("PWM_MODE")
   13733                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_PWM_MODE")
   13734                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13735                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   13736              
   13737              $C$DW$1832      .dwtag  DW_TAG_member
   13738                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$65)
   13739                      .dwattr $C$DW$1832, DW_AT_name("COMM_OPT")
   13740                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_COMM_OPT")
   13741                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13742                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   13743              
   13744              $C$DW$1833      .dwtag  DW_TAG_member
   13745                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$40)
   13746                      .dwattr $C$DW$1833, DW_AT_name("CTRL07_RSV1")
   13747                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_CTRL07_RSV1")
   13748                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13749                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   13750              
   13751                      .dwendtag $C$DW$T$66
   13752              
   13753              $C$DW$T$102     .dwtag  DW_TAG_typedef
   13754                      .dwattr $C$DW$T$102, DW_AT_name("DRV_SPI_8305_Ctrl07_t_")
   13755                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$66)
   13756                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
   13757              
   13758              
   13759              $C$DW$T$67      .dwtag  DW_TAG_structure_type
   13760                      .dwattr $C$DW$T$67, DW_AT_name("_DRV_SPI_8305_Ctrl08_t_")
   13761                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
   13762              $C$DW$1834      .dwtag  DW_TAG_member
   13763                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$21)
   13764                      .dwattr $C$DW$1834, DW_AT_name("CTRL08_RSV1")
   13765                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_CTRL08_RSV1")
   13766                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13767                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   13768              
   13769                      .dwendtag $C$DW$T$67
   13770              
   13771              $C$DW$T$103     .dwtag  DW_TAG_typedef
   13772                      .dwattr $C$DW$T$103, DW_AT_name("DRV_SPI_8305_Ctrl08_t_")
   13773                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$67)
   13774                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  260

   13775              
   13776              
   13777              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   13778                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8305_Ctrl09_t_")
   13779                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
   13780              $C$DW$1835      .dwtag  DW_TAG_member
   13781                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$40)
   13782                      .dwattr $C$DW$1835, DW_AT_name("SET_VCPH_UV")
   13783                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_SET_VCPH_UV")
   13784                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13785                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   13786              
   13787              $C$DW$1836      .dwtag  DW_TAG_member
   13788                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$40)
   13789                      .dwattr $C$DW$1836, DW_AT_name("CLR_FLTS")
   13790                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_CLR_FLTS")
   13791                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13792                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   13793              
   13794              $C$DW$1837      .dwtag  DW_TAG_member
   13795                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$40)
   13796                      .dwattr $C$DW$1837, DW_AT_name("SLEEP")
   13797                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_SLEEP")
   13798                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13799                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   13800              
   13801              $C$DW$1838      .dwtag  DW_TAG_member
   13802                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$40)
   13803                      .dwattr $C$DW$1838, DW_AT_name("WD_EN")
   13804                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_WD_EN")
   13805                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13806                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   13807              
   13808              $C$DW$1839      .dwtag  DW_TAG_member
   13809                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$40)
   13810                      .dwattr $C$DW$1839, DW_AT_name("DIS_SNS_OCP")
   13811                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_DIS_SNS_OCP")
   13812                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13813                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   13814              
   13815              $C$DW$1840      .dwtag  DW_TAG_member
   13816                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$69)
   13817                      .dwattr $C$DW$1840, DW_AT_name("WD_DLY")
   13818                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_WD_DLY")
   13819                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13820                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   13821              
   13822              $C$DW$1841      .dwtag  DW_TAG_member
   13823                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$40)
   13824                      .dwattr $C$DW$1841, DW_AT_name("EN_SNS_CLAMP")
   13825                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_EN_SNS_CLAMP")
   13826                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13827                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   13828              
   13829              $C$DW$1842      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  261

   13830                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$40)
   13831                      .dwattr $C$DW$1842, DW_AT_name("DIS_GDRV_FAULT")
   13832                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_DIS_GDRV_FAULT")
   13833                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13834                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   13835              
   13836              $C$DW$1843      .dwtag  DW_TAG_member
   13837                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$40)
   13838                      .dwattr $C$DW$1843, DW_AT_name("DISABLE")
   13839                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_DISABLE")
   13840                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13841                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   13842              
   13843              $C$DW$1844      .dwtag  DW_TAG_member
   13844                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$40)
   13845                      .dwattr $C$DW$1844, DW_AT_name("FLIP_OTS")
   13846                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_FLIP_OTS")
   13847                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13848                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   13849              
   13850                      .dwendtag $C$DW$T$70
   13851              
   13852              $C$DW$T$104     .dwtag  DW_TAG_typedef
   13853                      .dwattr $C$DW$T$104, DW_AT_name("DRV_SPI_8305_Ctrl09_t_")
   13854                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$70)
   13855                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
   13856              
   13857              
   13858              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   13859                      .dwattr $C$DW$T$79, DW_AT_name("_DRV_SPI_8305_Ctrl0A_t_")
   13860                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x07)
   13861              $C$DW$1845      .dwtag  DW_TAG_member
   13862                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$72)
   13863                      .dwattr $C$DW$1845, DW_AT_name("GAIN_CS1")
   13864                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_GAIN_CS1")
   13865                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13866                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   13867              
   13868              $C$DW$1846      .dwtag  DW_TAG_member
   13869                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$74)
   13870                      .dwattr $C$DW$1846, DW_AT_name("GAIN_CS2")
   13871                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_GAIN_CS2")
   13872                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13873                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   13874              
   13875              $C$DW$1847      .dwtag  DW_TAG_member
   13876                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$76)
   13877                      .dwattr $C$DW$1847, DW_AT_name("GAIN_CS3")
   13878                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_GAIN_CS3")
   13879                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13880                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   13881              
   13882              $C$DW$1848      .dwtag  DW_TAG_member
   13883                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$78)
   13884                      .dwattr $C$DW$1848, DW_AT_name("CS_BLANK")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  262

   13885                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_CS_BLANK")
   13886                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13887                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   13888              
   13889              $C$DW$1849      .dwtag  DW_TAG_member
   13890                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$40)
   13891                      .dwattr $C$DW$1849, DW_AT_name("DC_CAL_CH1")
   13892                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_DC_CAL_CH1")
   13893                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13894                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   13895              
   13896              $C$DW$1850      .dwtag  DW_TAG_member
   13897                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$40)
   13898                      .dwattr $C$DW$1850, DW_AT_name("DC_CAL_CH2")
   13899                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_DC_CAL_CH2")
   13900                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13901                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   13902              
   13903              $C$DW$1851      .dwtag  DW_TAG_member
   13904                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$40)
   13905                      .dwattr $C$DW$1851, DW_AT_name("DC_CAL_CH3")
   13906                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_DC_CAL_CH3")
   13907                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13908                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   13909              
   13910                      .dwendtag $C$DW$T$79
   13911              
   13912              $C$DW$T$105     .dwtag  DW_TAG_typedef
   13913                      .dwattr $C$DW$T$105, DW_AT_name("DRV_SPI_8305_Ctrl0A_t_")
   13914                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$79)
   13915                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
   13916              
   13917              
   13918              $C$DW$T$86      .dwtag  DW_TAG_structure_type
   13919                      .dwattr $C$DW$T$86, DW_AT_name("_DRV_SPI_8305_Ctrl0B_t_")
   13920                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x08)
   13921              $C$DW$1852      .dwtag  DW_TAG_member
   13922                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$81)
   13923                      .dwattr $C$DW$1852, DW_AT_name("VREG_UV_LEVEL")
   13924                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_VREG_UV_LEVEL")
   13925                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13926                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   13927              
   13928              $C$DW$1853      .dwtag  DW_TAG_member
   13929                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$40)
   13930                      .dwattr $C$DW$1853, DW_AT_name("DIS_PWRGD")
   13931                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_DIS_PWRGD")
   13932                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13933                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   13934              
   13935              $C$DW$1854      .dwtag  DW_TAG_member
   13936                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$83)
   13937                      .dwattr $C$DW$1854, DW_AT_name("SLP_DLY")
   13938                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_SLP_DLY")
   13939                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  263

   13940                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   13941              
   13942              $C$DW$1855      .dwtag  DW_TAG_member
   13943                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$40)
   13944                      .dwattr $C$DW$1855, DW_AT_name("CTRL0B_RSV1")
   13945                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_CTRL0B_RSV1")
   13946                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13947                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   13948              
   13949              $C$DW$1856      .dwtag  DW_TAG_member
   13950                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$40)
   13951                      .dwattr $C$DW$1856, DW_AT_name("CTRL0B_RSV2")
   13952                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_CTRL0B_RSV2")
   13953                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13954                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   13955              
   13956              $C$DW$1857      .dwtag  DW_TAG_member
   13957                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$40)
   13958                      .dwattr $C$DW$1857, DW_AT_name("CTRL0B_RSV3")
   13959                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_CTRL0B_RSV3")
   13960                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13961                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   13962              
   13963              $C$DW$1858      .dwtag  DW_TAG_member
   13964                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$85)
   13965                      .dwattr $C$DW$1858, DW_AT_name("VREF_SCALING")
   13966                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_VREF_SCALING")
   13967                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13968                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   13969              
   13970              $C$DW$1859      .dwtag  DW_TAG_member
   13971                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$40)
   13972                      .dwattr $C$DW$1859, DW_AT_name("CTRL0B_RSV4")
   13973                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_CTRL0B_RSV4")
   13974                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13975                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   13976              
   13977                      .dwendtag $C$DW$T$86
   13978              
   13979              $C$DW$T$106     .dwtag  DW_TAG_typedef
   13980                      .dwattr $C$DW$T$106, DW_AT_name("DRV_SPI_8305_Ctrl0B_t_")
   13981                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$86)
   13982                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
   13983              
   13984              
   13985              $C$DW$T$91      .dwtag  DW_TAG_structure_type
   13986                      .dwattr $C$DW$T$91, DW_AT_name("_DRV_SPI_8305_Ctrl0C_t_")
   13987                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x05)
   13988              $C$DW$1860      .dwtag  DW_TAG_member
   13989                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$88)
   13990                      .dwattr $C$DW$1860, DW_AT_name("VDS_MODE")
   13991                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_VDS_MODE")
   13992                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13993                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   13994              
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  264

   13995              $C$DW$1861      .dwtag  DW_TAG_member
   13996                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$90)
   13997                      .dwattr $C$DW$1861, DW_AT_name("VDS_LEVEL")
   13998                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_VDS_LEVEL")
   13999                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14000                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   14001              
   14002              $C$DW$1862      .dwtag  DW_TAG_member
   14003                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$40)
   14004                      .dwattr $C$DW$1862, DW_AT_name("CTRL0C_RSV1")
   14005                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_CTRL0C_RSV1")
   14006                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14007                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   14008              
   14009              $C$DW$1863      .dwtag  DW_TAG_member
   14010                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$40)
   14011                      .dwattr $C$DW$1863, DW_AT_name("CTRL0C_RSV2")
   14012                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_CTRL0C_RSV2")
   14013                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14014                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   14015              
   14016              $C$DW$1864      .dwtag  DW_TAG_member
   14017                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$40)
   14018                      .dwattr $C$DW$1864, DW_AT_name("CTRL0C_RSV3")
   14019                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_CTRL0C_RSV3")
   14020                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14021                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   14022              
   14023                      .dwendtag $C$DW$T$91
   14024              
   14025              $C$DW$T$107     .dwtag  DW_TAG_typedef
   14026                      .dwattr $C$DW$T$107, DW_AT_name("DRV_SPI_8305_Ctrl0C_t_")
   14027                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$91)
   14028                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
   14029              
   14030              
   14031              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   14032                      .dwattr $C$DW$T$92, DW_AT_name("_DRV_SPI_8305_Stat01_t_")
   14033                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x0b)
   14034              $C$DW$1865      .dwtag  DW_TAG_member
   14035                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$40)
   14036                      .dwattr $C$DW$1865, DW_AT_name("OTW")
   14037                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_OTW")
   14038                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14039                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   14040              
   14041              $C$DW$1866      .dwtag  DW_TAG_member
   14042                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$40)
   14043                      .dwattr $C$DW$1866, DW_AT_name("TEMP_FLAG3")
   14044                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_TEMP_FLAG3")
   14045                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14046                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   14047              
   14048              $C$DW$1867      .dwtag  DW_TAG_member
   14049                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  265

   14050                      .dwattr $C$DW$1867, DW_AT_name("TEMP_FLAG2")
   14051                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_TEMP_FLAG2")
   14052                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14053                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   14054              
   14055              $C$DW$1868      .dwtag  DW_TAG_member
   14056                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$40)
   14057                      .dwattr $C$DW$1868, DW_AT_name("TEMP_FLAG1")
   14058                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_TEMP_FLAG1")
   14059                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14060                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   14061              
   14062              $C$DW$1869      .dwtag  DW_TAG_member
   14063                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$40)
   14064                      .dwattr $C$DW$1869, DW_AT_name("VCPH_UVFL")
   14065                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_VCPH_UVFL")
   14066                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14067                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   14068              
   14069              $C$DW$1870      .dwtag  DW_TAG_member
   14070                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$40)
   14071                      .dwattr $C$DW$1870, DW_AT_name("VDS_STATUS")
   14072                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_VDS_STATUS")
   14073                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14074                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   14075              
   14076              $C$DW$1871      .dwtag  DW_TAG_member
   14077                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$40)
   14078                      .dwattr $C$DW$1871, DW_AT_name("PVDD_OVFL")
   14079                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_PVDD_OVFL")
   14080                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14081                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   14082              
   14083              $C$DW$1872      .dwtag  DW_TAG_member
   14084                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$40)
   14085                      .dwattr $C$DW$1872, DW_AT_name("PVDD_UVFL")
   14086                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_PVDD_UVFL")
   14087                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14088                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   14089              
   14090              $C$DW$1873      .dwtag  DW_TAG_member
   14091                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$40)
   14092                      .dwattr $C$DW$1873, DW_AT_name("TEMP_FLAG4")
   14093                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_TEMP_FLAG4")
   14094                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14095                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   14096              
   14097              $C$DW$1874      .dwtag  DW_TAG_member
   14098                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$40)
   14099                      .dwattr $C$DW$1874, DW_AT_name("STAT01_RSV1")
   14100                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_STAT01_RSV1")
   14101                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14102                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   14103              
   14104              $C$DW$1875      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  266

   14105                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$40)
   14106                      .dwattr $C$DW$1875, DW_AT_name("FAULT")
   14107                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_FAULT")
   14108                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14109                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   14110              
   14111                      .dwendtag $C$DW$T$92
   14112              
   14113              $C$DW$T$96      .dwtag  DW_TAG_typedef
   14114                      .dwattr $C$DW$T$96, DW_AT_name("DRV_SPI_8305_Stat01_t_")
   14115                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$92)
   14116                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   14117              
   14118              
   14119              $C$DW$T$93      .dwtag  DW_TAG_structure_type
   14120                      .dwattr $C$DW$T$93, DW_AT_name("_DRV_SPI_8305_Stat02_t_")
   14121                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x0b)
   14122              $C$DW$1876      .dwtag  DW_TAG_member
   14123                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$40)
   14124                      .dwattr $C$DW$1876, DW_AT_name("SNS_A_OCP")
   14125                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_SNS_A_OCP")
   14126                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14127                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   14128              
   14129              $C$DW$1877      .dwtag  DW_TAG_member
   14130                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$40)
   14131                      .dwattr $C$DW$1877, DW_AT_name("SNS_B_OCP")
   14132                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_SNS_B_OCP")
   14133                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14134                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   14135              
   14136              $C$DW$1878      .dwtag  DW_TAG_member
   14137                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$40)
   14138                      .dwattr $C$DW$1878, DW_AT_name("SNS_C_OCP")
   14139                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_SNS_C_OCP")
   14140                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14141                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   14142              
   14143              $C$DW$1879      .dwtag  DW_TAG_member
   14144                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$40)
   14145                      .dwattr $C$DW$1879, DW_AT_name("STAT02_RSV2")
   14146                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_STAT02_RSV2")
   14147                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14148                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   14149              
   14150              $C$DW$1880      .dwtag  DW_TAG_member
   14151                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$40)
   14152                      .dwattr $C$DW$1880, DW_AT_name("STAT02_RSV1")
   14153                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_STAT02_RSV1")
   14154                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14155                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   14156              
   14157              $C$DW$1881      .dwtag  DW_TAG_member
   14158                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$40)
   14159                      .dwattr $C$DW$1881, DW_AT_name("FETLC_VDS")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  267

   14160                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_FETLC_VDS")
   14161                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14162                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   14163              
   14164              $C$DW$1882      .dwtag  DW_TAG_member
   14165                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$40)
   14166                      .dwattr $C$DW$1882, DW_AT_name("FETHC_VDS")
   14167                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_FETHC_VDS")
   14168                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14169                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   14170              
   14171              $C$DW$1883      .dwtag  DW_TAG_member
   14172                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$40)
   14173                      .dwattr $C$DW$1883, DW_AT_name("FETLB_VDS")
   14174                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_FETLB_VDS")
   14175                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14176                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   14177              
   14178              $C$DW$1884      .dwtag  DW_TAG_member
   14179                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$40)
   14180                      .dwattr $C$DW$1884, DW_AT_name("FETHB_VDS")
   14181                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_FETHB_VDS")
   14182                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14183                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   14184              
   14185              $C$DW$1885      .dwtag  DW_TAG_member
   14186                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$40)
   14187                      .dwattr $C$DW$1885, DW_AT_name("FETLA_VDS")
   14188                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_FETLA_VDS")
   14189                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14190                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   14191              
   14192              $C$DW$1886      .dwtag  DW_TAG_member
   14193                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$40)
   14194                      .dwattr $C$DW$1886, DW_AT_name("FETHA_VDS")
   14195                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_FETHA_VDS")
   14196                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14197                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   14198              
   14199                      .dwendtag $C$DW$T$93
   14200              
   14201              $C$DW$T$97      .dwtag  DW_TAG_typedef
   14202                      .dwattr $C$DW$T$97, DW_AT_name("DRV_SPI_8305_Stat02_t_")
   14203                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$93)
   14204                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   14205              
   14206              
   14207              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   14208                      .dwattr $C$DW$T$94, DW_AT_name("_DRV_SPI_8305_Stat03_t_")
   14209                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x0b)
   14210              $C$DW$1887      .dwtag  DW_TAG_member
   14211                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$40)
   14212                      .dwattr $C$DW$1887, DW_AT_name("VCPH_OVLO_ABS")
   14213                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_VCPH_OVLO_ABS")
   14214                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  268

   14215                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   14216              
   14217              $C$DW$1888      .dwtag  DW_TAG_member
   14218                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$40)
   14219                      .dwattr $C$DW$1888, DW_AT_name("VCPH_OVLO")
   14220                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_VCPH_OVLO")
   14221                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14222                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   14223              
   14224              $C$DW$1889      .dwtag  DW_TAG_member
   14225                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$40)
   14226                      .dwattr $C$DW$1889, DW_AT_name("VCPH_UVLO2")
   14227                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_VCPH_UVLO2")
   14228                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14229                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   14230              
   14231              $C$DW$1890      .dwtag  DW_TAG_member
   14232                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$40)
   14233                      .dwattr $C$DW$1890, DW_AT_name("STAT03_RSV2")
   14234                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_STAT03_RSV2")
   14235                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14236                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   14237              
   14238              $C$DW$1891      .dwtag  DW_TAG_member
   14239                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$40)
   14240                      .dwattr $C$DW$1891, DW_AT_name("VCP_LSD_UVLO2")
   14241                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_VCP_LSD_UVLO2")
   14242                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14243                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   14244              
   14245              $C$DW$1892      .dwtag  DW_TAG_member
   14246                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$40)
   14247                      .dwattr $C$DW$1892, DW_AT_name("AVDD_UVLO")
   14248                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_AVDD_UVLO")
   14249                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14250                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   14251              
   14252              $C$DW$1893      .dwtag  DW_TAG_member
   14253                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$40)
   14254                      .dwattr $C$DW$1893, DW_AT_name("VREG_UV")
   14255                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_VREG_UV")
   14256                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14257                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   14258              
   14259              $C$DW$1894      .dwtag  DW_TAG_member
   14260                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$40)
   14261                      .dwattr $C$DW$1894, DW_AT_name("STAT03_RSV1")
   14262                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_STAT03_RSV1")
   14263                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14264                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   14265              
   14266              $C$DW$1895      .dwtag  DW_TAG_member
   14267                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$40)
   14268                      .dwattr $C$DW$1895, DW_AT_name("OTS")
   14269                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_OTS")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  269

   14270                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14271                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   14272              
   14273              $C$DW$1896      .dwtag  DW_TAG_member
   14274                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$40)
   14275                      .dwattr $C$DW$1896, DW_AT_name("WD_FAULT")
   14276                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_WD_FAULT")
   14277                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14278                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   14279              
   14280              $C$DW$1897      .dwtag  DW_TAG_member
   14281                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$40)
   14282                      .dwattr $C$DW$1897, DW_AT_name("PVDD_UVLO2")
   14283                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_PVDD_UVLO2")
   14284                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14285                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   14286              
   14287                      .dwendtag $C$DW$T$94
   14288              
   14289              $C$DW$T$98      .dwtag  DW_TAG_typedef
   14290                      .dwattr $C$DW$T$98, DW_AT_name("DRV_SPI_8305_Stat03_t_")
   14291                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$94)
   14292                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
   14293              
   14294              
   14295              $C$DW$T$95      .dwtag  DW_TAG_structure_type
   14296                      .dwattr $C$DW$T$95, DW_AT_name("_DRV_SPI_8305_Stat04_t_")
   14297                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x0b)
   14298              $C$DW$1898      .dwtag  DW_TAG_member
   14299                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$40)
   14300                      .dwattr $C$DW$1898, DW_AT_name("STAT04_RSV5")
   14301                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_STAT04_RSV5")
   14302                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14303                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   14304              
   14305              $C$DW$1899      .dwtag  DW_TAG_member
   14306                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$40)
   14307                      .dwattr $C$DW$1899, DW_AT_name("STAT04_RSV4")
   14308                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_STAT04_RSV4")
   14309                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14310                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   14311              
   14312              $C$DW$1900      .dwtag  DW_TAG_member
   14313                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$40)
   14314                      .dwattr $C$DW$1900, DW_AT_name("STAT04_RSV3")
   14315                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_STAT04_RSV3")
   14316                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14317                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   14318              
   14319              $C$DW$1901      .dwtag  DW_TAG_member
   14320                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$40)
   14321                      .dwattr $C$DW$1901, DW_AT_name("STAT04_RSV2")
   14322                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_STAT04_RSV2")
   14323                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14324                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  270

   14325              
   14326              $C$DW$1902      .dwtag  DW_TAG_member
   14327                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$40)
   14328                      .dwattr $C$DW$1902, DW_AT_name("STAT04_RSV1")
   14329                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_STAT04_RSV1")
   14330                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14331                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   14332              
   14333              $C$DW$1903      .dwtag  DW_TAG_member
   14334                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$40)
   14335                      .dwattr $C$DW$1903, DW_AT_name("FETLC_VGS")
   14336                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_FETLC_VGS")
   14337                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14338                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   14339              
   14340              $C$DW$1904      .dwtag  DW_TAG_member
   14341                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$40)
   14342                      .dwattr $C$DW$1904, DW_AT_name("FETHC_VGS")
   14343                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_FETHC_VGS")
   14344                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14345                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   14346              
   14347              $C$DW$1905      .dwtag  DW_TAG_member
   14348                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$40)
   14349                      .dwattr $C$DW$1905, DW_AT_name("FETLB_VGS")
   14350                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_FETLB_VGS")
   14351                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14352                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   14353              
   14354              $C$DW$1906      .dwtag  DW_TAG_member
   14355                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$40)
   14356                      .dwattr $C$DW$1906, DW_AT_name("FETHB_VGS")
   14357                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_FETHB_VGS")
   14358                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14359                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   14360              
   14361              $C$DW$1907      .dwtag  DW_TAG_member
   14362                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$40)
   14363                      .dwattr $C$DW$1907, DW_AT_name("FETLA_VGS")
   14364                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_FETLA_VGS")
   14365                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14366                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   14367              
   14368              $C$DW$1908      .dwtag  DW_TAG_member
   14369                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$40)
   14370                      .dwattr $C$DW$1908, DW_AT_name("FETHA_VGS")
   14371                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_FETHA_VGS")
   14372                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14373                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   14374              
   14375                      .dwendtag $C$DW$T$95
   14376              
   14377              $C$DW$T$99      .dwtag  DW_TAG_typedef
   14378                      .dwattr $C$DW$T$99, DW_AT_name("DRV_SPI_8305_Stat04_t_")
   14379                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$95)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  271

   14380                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   14381              
   14382              
   14383              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   14384                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8305_Vars_t_")
   14385                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x61)
   14386              $C$DW$1909      .dwtag  DW_TAG_member
   14387                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$96)
   14388                      .dwattr $C$DW$1909, DW_AT_name("Stat_Reg_01")
   14389                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_Stat_Reg_01")
   14390                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14391                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   14392              
   14393              $C$DW$1910      .dwtag  DW_TAG_member
   14394                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$97)
   14395                      .dwattr $C$DW$1910, DW_AT_name("Stat_Reg_02")
   14396                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_Stat_Reg_02")
   14397                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   14398                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   14399              
   14400              $C$DW$1911      .dwtag  DW_TAG_member
   14401                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$98)
   14402                      .dwattr $C$DW$1911, DW_AT_name("Stat_Reg_03")
   14403                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_Stat_Reg_03")
   14404                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   14405                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   14406              
   14407              $C$DW$1912      .dwtag  DW_TAG_member
   14408                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$99)
   14409                      .dwattr $C$DW$1912, DW_AT_name("Stat_Reg_04")
   14410                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_Stat_Reg_04")
   14411                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   14412                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   14413              
   14414              $C$DW$1913      .dwtag  DW_TAG_member
   14415                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$100)
   14416                      .dwattr $C$DW$1913, DW_AT_name("Ctrl_Reg_05")
   14417                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
   14418                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   14419                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   14420              
   14421              $C$DW$1914      .dwtag  DW_TAG_member
   14422                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$101)
   14423                      .dwattr $C$DW$1914, DW_AT_name("Ctrl_Reg_06")
   14424                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
   14425                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   14426                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   14427              
   14428              $C$DW$1915      .dwtag  DW_TAG_member
   14429                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$102)
   14430                      .dwattr $C$DW$1915, DW_AT_name("Ctrl_Reg_07")
   14431                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_Ctrl_Reg_07")
   14432                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   14433                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   14434              
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:35:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{F1804BF3-6C06-495C-8D0B-661BA0C77A48} PAGE  272

   14435              $C$DW$1916      .dwtag  DW_TAG_member
   14436                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$103)
   14437                      .dwattr $C$DW$1916, DW_AT_name("Ctrl_Reg_08")
   14438                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_Ctrl_Reg_08")
   14439                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   14440                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   14441              
   14442              $C$DW$1917      .dwtag  DW_TAG_member
   14443                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$104)
   14444                      .dwattr $C$DW$1917, DW_AT_name("Ctrl_Reg_09")
   14445                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_Ctrl_Reg_09")
   14446                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
   14447                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   14448              
   14449              $C$DW$1918      .dwtag  DW_TAG_member
   14450                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$105)
   14451                      .dwattr $C$DW$1918, DW_AT_name("Ctrl_Reg_0A")
   14452                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_Ctrl_Reg_0A")
   14453                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   14454                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   14455              
   14456              $C$DW$1919      .dwtag  DW_TAG_member
   14457                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$106)
   14458                      .dwattr $C$DW$1919, DW_AT_name("Ctrl_Reg_0B")
   14459                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_Ctrl_Reg_0B")
   14460                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   14461                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   14462              
   14463              $C$DW$1920      .dwtag  DW_TAG_member
   14464                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$107)
   14465                      .dwattr $C$DW$1920, DW_AT_name("Ctrl_Reg_0C")
   14466                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_Ctrl_Reg_0C")
   14467                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
   14468                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   14469              
   14470              $C$DW$1921      .dwtag  DW_TAG_member
   14471                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$40)
   14472                      .dwattr $C$DW$1921, DW_AT_name("WriteCmd")
   14473                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_WriteCmd")
   14474                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
   14475                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   14476              
   14477              $C$DW$1922      .dwtag  DW_TAG_member
   14478                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$40)
   14479                      .dwattr $C$DW$1922, DW_AT_name("ReadCmd")
   14480                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_ReadCmd")
   14481                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   14482                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   14483              
   14484              $C$DW$1923      .dwtag  DW_TAG_member
   14485                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$21)
   14486                      .dwattr $C$DW$1923, DW_AT_name("ManWriteAddr")
   14487                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_ManWriteAddr")
