TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CE6BD6A4-E660-4614-8B32-345FD8B02AC5} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Jan 30 22:39:23 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../driver/i2c.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("G:\code\c\ccs\remote_car\Flash")
      13              ;       D:\ti\ccsv7\tools\compiler\ti-cgt-c2000_16.9.6.LTS\bin\opt2000.exe C:\\Users\\Zulolo\\AppData\\Local\
      14              ;       D:\ti\ccsv7\tools\compiler\ti-cgt-c2000_16.9.6.LTS\bin\ac2000.exe -@C:\\Users\\Zulolo\\AppData\\Local

    1407                      .dwattr $C$DW$115, DW_AT_const_value(0x10)
    1408              
    1409              $C$DW$116       .dwtag  DW_TAG_enumerator
    1410                      .dwattr $C$DW$116, DW_AT_name("I2C_Status_Stop")
    1411                      .dwattr $C$DW$116, DW_AT_const_value(0x20)
    1412              
    1413              $C$DW$117       .dwtag  DW_TAG_enumerator
    1414                      .dwattr $C$DW$117, DW_AT_name("I2C_Status_AD0")
    1415                      .dwattr $C$DW$117, DW_AT_const_value(0x100)
    1416              
    1417              $C$DW$118       .dwtag  DW_TAG_enumerator
    1418                      .dwattr $C$DW$118, DW_AT_name("I2C_Status_Slave_Addr")
    1419                      .dwattr $C$DW$118, DW_AT_const_value(0x200)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CE6BD6A4-E660-4614-8B32-345FD8B02AC5} PAGE   27

    1420              
    1421              $C$DW$119       .dwtag  DW_TAG_enumerator
    1422                      .dwattr $C$DW$119, DW_AT_name("I2C_Status_Tx_Empty")
    1423                      .dwattr $C$DW$119, DW_AT_const_value(0x400)
    1424              
    1425              $C$DW$120       .dwtag  DW_TAG_enumerator
    1426                      .dwattr $C$DW$120, DW_AT_name("I2C_Status_Rx_Full")
    1427                      .dwattr $C$DW$120, DW_AT_const_value(0x800)
    1428              
    1429              $C$DW$121       .dwtag  DW_TAG_enumerator
    1430                      .dwattr $C$DW$121, DW_AT_name("I2C_Status_Busy")
    1431                      .dwattr $C$DW$121, DW_AT_const_value(0x1000)
    1432              
    1433              $C$DW$122       .dwtag  DW_TAG_enumerator
    1434                      .dwattr $C$DW$122, DW_AT_name("I2C_Status_NACK_Sent")
    1435                      .dwattr $C$DW$122, DW_AT_const_value(0x2000)
    1436              
    1437              $C$DW$123       .dwtag  DW_TAG_enumerator
    1438                      .dwattr $C$DW$123, DW_AT_name("I2C_Status_Slave_Dir")
    1439                      .dwattr $C$DW$123, DW_AT_const_value(0x4000)
    1440              
    1441                      .dwendtag $C$DW$T$32
    1442              
    1443              $C$DW$T$33      .dwtag  DW_TAG_typedef
    1444                      .dwattr $C$DW$T$33, DW_AT_name("I2C_Status_e")
    1445                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1446                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1447              
    1448              
    1449              $C$DW$T$36      .dwtag  DW_TAG_enumeration_type
    1450                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1451              $C$DW$124       .dwtag  DW_TAG_enumerator
    1452                      .dwattr $C$DW$124, DW_AT_name("I2C_Control_Stop")
    1453                      .dwattr $C$DW$124, DW_AT_const_value(0xc00)
    1454              
    1455              $C$DW$125       .dwtag  DW_TAG_enumerator
    1456                      .dwattr $C$DW$125, DW_AT_name("I2C_Control_Single_TX")
    1457                      .dwattr $C$DW$125, DW_AT_const_value(0x2e00)
    1458              
    1459              $C$DW$126       .dwtag  DW_TAG_enumerator
    1460                      .dwattr $C$DW$126, DW_AT_name("I2C_Control_Single_RX")
    1461                      .dwattr $C$DW$126, DW_AT_const_value(0x2c00)
    1462              
    1463              $C$DW$127       .dwtag  DW_TAG_enumerator
    1464                      .dwattr $C$DW$127, DW_AT_name("I2C_Control_Burst_TX_Start")
    1465                      .dwattr $C$DW$127, DW_AT_const_value(0x2600)
    1466              
    1467              $C$DW$128       .dwtag  DW_TAG_enumerator
    1468                      .dwattr $C$DW$128, DW_AT_name("I2C_Control_Burst_TX_Stop")
    1469                      .dwattr $C$DW$128, DW_AT_const_value(0xe00)
    1470              
    1471              $C$DW$129       .dwtag  DW_TAG_enumerator
    1472                      .dwattr $C$DW$129, DW_AT_name("I2C_Control_Burst_RX_Start")
    1473                      .dwattr $C$DW$129, DW_AT_const_value(0x2400)
    1474              
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CE6BD6A4-E660-4614-8B32-345FD8B02AC5} PAGE   28

    1475              $C$DW$130       .dwtag  DW_TAG_enumerator
    1476                      .dwattr $C$DW$130, DW_AT_name("I2C_Control_Burst_RX_Stop")
    1477                      .dwattr $C$DW$130, DW_AT_const_value(0xc00)
    1478              
    1479                      .dwendtag $C$DW$T$36
    1480              
    1481              $C$DW$T$37      .dwtag  DW_TAG_typedef
    1482                      .dwattr $C$DW$T$37, DW_AT_name("I2C_Control_e")
    1483                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1484                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1485              
    1486              $C$DW$131       .dwtag  DW_TAG_TI_far_type
    1487                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$37)
    1488              
    1489              $C$DW$T$38      .dwtag  DW_TAG_const_type
    1490                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$131)
    1491              
    1492              
    1493              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1494                      .dwattr $C$DW$T$22, DW_AT_name("_I2C_Obj_")
    1495                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x22)
    1496              $C$DW$132       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1498                      .dwattr $C$DW$132, DW_AT_name("I2COAR")
    1499                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_I2COAR")
    1500                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1501                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1502              
    1503              $C$DW$133       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1505                      .dwattr $C$DW$133, DW_AT_name("I2CIER")
    1506                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_I2CIER")
    1507                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1508                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$134       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1512                      .dwattr $C$DW$134, DW_AT_name("I2CSTR")
    1513                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_I2CSTR")
    1514                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1515                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517              $C$DW$135       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1519                      .dwattr $C$DW$135, DW_AT_name("I2CCLKL")
    1520                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_I2CCLKL")
    1521                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1522                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$136       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    1526                      .dwattr $C$DW$136, DW_AT_name("I2CCLKH")
    1527                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_I2CCLKH")
    1528                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1529                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CE6BD6A4-E660-4614-8B32-345FD8B02AC5} PAGE   29

    1530              
    1531              $C$DW$137       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1533                      .dwattr $C$DW$137, DW_AT_name("I2CCNT")
    1534                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_I2CCNT")
    1535                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1536                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$138       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1540                      .dwattr $C$DW$138, DW_AT_name("I2CDRR")
    1541                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_I2CDRR")
    1542                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1543                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1544              
    1545              $C$DW$139       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1547                      .dwattr $C$DW$139, DW_AT_name("I2CSAR")
    1548                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_I2CSAR")
    1549                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1550                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552              $C$DW$140       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1554                      .dwattr $C$DW$140, DW_AT_name("I2CDXR")
    1555                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_I2CDXR")
    1556                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1557                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1558              
    1559              $C$DW$141       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1561                      .dwattr $C$DW$141, DW_AT_name("I2CMDR")
    1562                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_I2CMDR")
    1563                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1564                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1565              
    1566              $C$DW$142       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1568                      .dwattr $C$DW$142, DW_AT_name("I2CISRC")
    1569                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_I2CISRC")
    1570                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1571                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$143       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1575                      .dwattr $C$DW$143, DW_AT_name("I2CEMDR")
    1576                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_I2CEMDR")
    1577                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1578                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1579              
    1580              $C$DW$144       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1582                      .dwattr $C$DW$144, DW_AT_name("I2CPSC")
    1583                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_I2CPSC")
    1584                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CE6BD6A4-E660-4614-8B32-345FD8B02AC5} PAGE   30

    1585                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1586              
    1587              $C$DW$145       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$21)
    1589                      .dwattr $C$DW$145, DW_AT_name("rsvd_1")
    1590                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd_1")
    1591                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1592                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1593              
    1594              $C$DW$146       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1596                      .dwattr $C$DW$146, DW_AT_name("I2CFFTX")
    1597                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_I2CFFTX")
    1598                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1599                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1600              
    1601              $C$DW$147       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    1603                      .dwattr $C$DW$147, DW_AT_name("I2CFFRX")
    1604                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_I2CFFRX")
    1605                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1606                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1607              
    1608                      .dwendtag $C$DW$T$22
    1609              
    1610              $C$DW$T$39      .dwtag  DW_TAG_typedef
    1611                      .dwattr $C$DW$T$39, DW_AT_name("I2C_Obj")
    1612                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$22)
    1613                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1614              
    1615              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1616                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    1617                      .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    1618              
    1619              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1620                      .dwattr $C$DW$T$29, DW_AT_name("I2C_Handle")
    1621                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1622                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1623              
    1624              $C$DW$148       .dwtag  DW_TAG_TI_far_type
    1625                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
    1626              
    1627              $C$DW$T$40      .dwtag  DW_TAG_const_type
    1628                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$148)
    1629              
    1630              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1631                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1632              
    1633              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1634                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1635                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1636              
    1637              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1638                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1639                      .dwattr $C$DW$T$4, DW_AT_name("bool")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:23 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CE6BD6A4-E660-4614-8B32-345FD8B02AC5} PAGE   31

    1640                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1641              
    1642              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1643                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1644                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1645                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1646              
    1647              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1648                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1649                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1650                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1651              
    1652              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1653                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1654                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1655                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1656              
    1657              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1658                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1659                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1660                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1661              
    1662              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1663                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1664                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1665                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1666              
    1667              $C$DW$T$10      .dwtag  DW_TAG_base_type
