TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Tue Jan 30 22:39:49 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../src/remote_car.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("G:\code\c\ccs\remote_car\Flash")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    5418              $C$DW$662       .dwtag  DW_TAG_enumerator
    5419                      .dwattr $C$DW$662, DW_AT_name("PWM_Number_1")
    5420                      .dwattr $C$DW$662, DW_AT_const_value(0x00)
    5421              
    5422              $C$DW$663       .dwtag  DW_TAG_enumerator
    5423                      .dwattr $C$DW$663, DW_AT_name("PWM_Number_2")
    5424                      .dwattr $C$DW$663, DW_AT_const_value(0x01)
    5425              
    5426              $C$DW$664       .dwtag  DW_TAG_enumerator
    5427                      .dwattr $C$DW$664, DW_AT_name("PWM_Number_3")
    5428                      .dwattr $C$DW$664, DW_AT_const_value(0x02)
    5429              
    5430              $C$DW$665       .dwtag  DW_TAG_enumerator
    5431                      .dwattr $C$DW$665, DW_AT_name("PWM_Number_4")
    5432                      .dwattr $C$DW$665, DW_AT_const_value(0x03)
    5433              
    5434                      .dwendtag $C$DW$T$263
    5435              
    5436              $C$DW$T$264     .dwtag  DW_TAG_typedef
    5437                      .dwattr $C$DW$T$264, DW_AT_name("PWM_Number_e")
    5438                      .dwattr $C$DW$T$264, DW_AT_type(*$C$DW$T$263)
    5439                      .dwattr $C$DW$T$264, DW_AT_language(DW_LANG_C)
    5440              
    5441              
    5442              $C$DW$T$266     .dwtag  DW_TAG_enumeration_type
    5443                      .dwattr $C$DW$T$266, DW_AT_byte_size(0x01)
    5444              $C$DW$666       .dwtag  DW_TAG_enumerator
    5445                      .dwattr $C$DW$666, DW_AT_name("I2C_Status_None")
    5446                      .dwattr $C$DW$666, DW_AT_const_value(0x00)
    5447              
    5448              $C$DW$667       .dwtag  DW_TAG_enumerator
    5449                      .dwattr $C$DW$667, DW_AT_name("I2C_Status_Arb_Lost")
    5450                      .dwattr $C$DW$667, DW_AT_const_value(0x01)
    5451              
    5452              $C$DW$668       .dwtag  DW_TAG_enumerator
    5453                      .dwattr $C$DW$668, DW_AT_name("I2C_Status_NACK")
    5454                      .dwattr $C$DW$668, DW_AT_const_value(0x02)
    5455              
    5456              $C$DW$669       .dwtag  DW_TAG_enumerator
    5457                      .dwattr $C$DW$669, DW_AT_name("I2C_Status_Reg_Rdy")
    5458                      .dwattr $C$DW$669, DW_AT_const_value(0x04)
    5459              
    5460              $C$DW$670       .dwtag  DW_TAG_enumerator
    5461                      .dwattr $C$DW$670, DW_AT_name("I2C_Status_Rx_Rdy")
    5462                      .dwattr $C$DW$670, DW_AT_const_value(0x08)
    5463              
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  106

    5464              $C$DW$671       .dwtag  DW_TAG_enumerator
    5465                      .dwattr $C$DW$671, DW_AT_name("I2C_Status_Tx_Rdy")
    5466                      .dwattr $C$DW$671, DW_AT_const_value(0x10)
    5467              
    5468              $C$DW$672       .dwtag  DW_TAG_enumerator
    5469                      .dwattr $C$DW$672, DW_AT_name("I2C_Status_Stop")
    5470                      .dwattr $C$DW$672, DW_AT_const_value(0x20)
    5471              
    5472              $C$DW$673       .dwtag  DW_TAG_enumerator
    5473                      .dwattr $C$DW$673, DW_AT_name("I2C_Status_AD0")
    5474                      .dwattr $C$DW$673, DW_AT_const_value(0x100)
    5475              
    5476              $C$DW$674       .dwtag  DW_TAG_enumerator
    5477                      .dwattr $C$DW$674, DW_AT_name("I2C_Status_Slave_Addr")
    5478                      .dwattr $C$DW$674, DW_AT_const_value(0x200)
    5479              
    5480              $C$DW$675       .dwtag  DW_TAG_enumerator
    5481                      .dwattr $C$DW$675, DW_AT_name("I2C_Status_Tx_Empty")
    5482                      .dwattr $C$DW$675, DW_AT_const_value(0x400)
    5483              
    5484              $C$DW$676       .dwtag  DW_TAG_enumerator
    5485                      .dwattr $C$DW$676, DW_AT_name("I2C_Status_Rx_Full")
    5486                      .dwattr $C$DW$676, DW_AT_const_value(0x800)
    5487              
    5488              $C$DW$677       .dwtag  DW_TAG_enumerator
    5489                      .dwattr $C$DW$677, DW_AT_name("I2C_Status_Busy")
    5490                      .dwattr $C$DW$677, DW_AT_const_value(0x1000)
    5491              
    5492              $C$DW$678       .dwtag  DW_TAG_enumerator
    5493                      .dwattr $C$DW$678, DW_AT_name("I2C_Status_NACK_Sent")
    5494                      .dwattr $C$DW$678, DW_AT_const_value(0x2000)
    5495              
    5496              $C$DW$679       .dwtag  DW_TAG_enumerator
    5497                      .dwattr $C$DW$679, DW_AT_name("I2C_Status_Slave_Dir")
    5498                      .dwattr $C$DW$679, DW_AT_const_value(0x4000)
    5499              
    5500                      .dwendtag $C$DW$T$266
    5501              
    5502              $C$DW$T$267     .dwtag  DW_TAG_typedef
    5503                      .dwattr $C$DW$T$267, DW_AT_name("I2C_Status_e")
    5504                      .dwattr $C$DW$T$267, DW_AT_type(*$C$DW$T$266)
    5505                      .dwattr $C$DW$T$267, DW_AT_language(DW_LANG_C)
    5506              
    5507              
    5508              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5509                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    5510                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    5511              $C$DW$680       .dwtag  DW_TAG_member
    5512                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$24)
    5513                      .dwattr $C$DW$680, DW_AT_name("ADCRESULT")
    5514                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_ADCRESULT")
    5515                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5516                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5517              
    5518              $C$DW$681       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  107

    5519                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$25)
    5520                      .dwattr $C$DW$681, DW_AT_name("resvd_1")
    5521                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_resvd_1")
    5522                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5523                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5524              
    5525              $C$DW$682       .dwtag  DW_TAG_member
    5526                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$23)
    5527                      .dwattr $C$DW$682, DW_AT_name("ADCCTL1")
    5528                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCCTL1")
    5529                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    5530                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5531              
    5532              $C$DW$683       .dwtag  DW_TAG_member
    5533                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$23)
    5534                      .dwattr $C$DW$683, DW_AT_name("ADCCTL2")
    5535                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_ADCCTL2")
    5536                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5537                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5538              
    5539              $C$DW$684       .dwtag  DW_TAG_member
    5540                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$26)
    5541                      .dwattr $C$DW$684, DW_AT_name("rsvd_2")
    5542                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_rsvd_2")
    5543                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5544                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5545              
    5546              $C$DW$685       .dwtag  DW_TAG_member
    5547                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$23)
    5548                      .dwattr $C$DW$685, DW_AT_name("ADCINTFLG")
    5549                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCINTFLG")
    5550                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5551                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5552              
    5553              $C$DW$686       .dwtag  DW_TAG_member
    5554                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$23)
    5555                      .dwattr $C$DW$686, DW_AT_name("ADCINTFLGCLR")
    5556                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5557                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5558                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5559              
    5560              $C$DW$687       .dwtag  DW_TAG_member
    5561                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$23)
    5562                      .dwattr $C$DW$687, DW_AT_name("ADCINTOVF")
    5563                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCINTOVF")
    5564                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5565                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5566              
    5567              $C$DW$688       .dwtag  DW_TAG_member
    5568                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$23)
    5569                      .dwattr $C$DW$688, DW_AT_name("ADCINTOVFCLR")
    5570                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5571                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5572                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5573              
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  108

    5574              $C$DW$689       .dwtag  DW_TAG_member
    5575                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$27)
    5576                      .dwattr $C$DW$689, DW_AT_name("INTSELxNy")
    5577                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_INTSELxNy")
    5578                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5579                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5580              
    5581              $C$DW$690       .dwtag  DW_TAG_member
    5582                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$28)
    5583                      .dwattr $C$DW$690, DW_AT_name("rsvd_3")
    5584                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_rsvd_3")
    5585                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5586                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5587              
    5588              $C$DW$691       .dwtag  DW_TAG_member
    5589                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$23)
    5590                      .dwattr $C$DW$691, DW_AT_name("SOCPRICTRL")
    5591                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5592                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5593                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5594              
    5595              $C$DW$692       .dwtag  DW_TAG_member
    5596                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    5597                      .dwattr $C$DW$692, DW_AT_name("rsvd_4")
    5598                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_rsvd_4")
    5599                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5600                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    5601              
    5602              $C$DW$693       .dwtag  DW_TAG_member
    5603                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    5604                      .dwattr $C$DW$693, DW_AT_name("ADCSAMPLEMODE")
    5605                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5606                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5607                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    5608              
    5609              $C$DW$694       .dwtag  DW_TAG_member
    5610                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$23)
    5611                      .dwattr $C$DW$694, DW_AT_name("rsvd_5")
    5612                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_rsvd_5")
    5613                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5614                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    5615              
    5616              $C$DW$695       .dwtag  DW_TAG_member
    5617                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$23)
    5618                      .dwattr $C$DW$695, DW_AT_name("ADCINTSOCSEL1")
    5619                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5620                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5621                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    5622              
    5623              $C$DW$696       .dwtag  DW_TAG_member
    5624                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$23)
    5625                      .dwattr $C$DW$696, DW_AT_name("ADCINTSOCSEL2")
    5626                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5627                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5628                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  109

    5629              
    5630              $C$DW$697       .dwtag  DW_TAG_member
    5631                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$26)
    5632                      .dwattr $C$DW$697, DW_AT_name("rsvd_6")
    5633                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_rsvd_6")
    5634                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5635                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    5636              
    5637              $C$DW$698       .dwtag  DW_TAG_member
    5638                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$23)
    5639                      .dwattr $C$DW$698, DW_AT_name("ADCSOCFLG1")
    5640                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5641                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5642                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    5643              
    5644              $C$DW$699       .dwtag  DW_TAG_member
    5645                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$23)
    5646                      .dwattr $C$DW$699, DW_AT_name("rsvd_7")
    5647                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_rsvd_7")
    5648                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5649                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    5650              
    5651              $C$DW$700       .dwtag  DW_TAG_member
    5652                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    5653                      .dwattr $C$DW$700, DW_AT_name("ADCSOCFRC1")
    5654                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5655                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5656                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    5657              
    5658              $C$DW$701       .dwtag  DW_TAG_member
    5659                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    5660                      .dwattr $C$DW$701, DW_AT_name("rsvd_8")
    5661                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_rsvd_8")
    5662                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5663                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    5664              
    5665              $C$DW$702       .dwtag  DW_TAG_member
    5666                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$23)
    5667                      .dwattr $C$DW$702, DW_AT_name("ADCSOCOVF1")
    5668                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5669                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5670                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    5671              
    5672              $C$DW$703       .dwtag  DW_TAG_member
    5673                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$23)
    5674                      .dwattr $C$DW$703, DW_AT_name("rsvd_9")
    5675                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_rsvd_9")
    5676                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5677                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    5678              
    5679              $C$DW$704       .dwtag  DW_TAG_member
    5680                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$23)
    5681                      .dwattr $C$DW$704, DW_AT_name("ADCSOCOVFCLR1")
    5682                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5683                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  110

    5684                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    5685              
    5686              $C$DW$705       .dwtag  DW_TAG_member
    5687                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$23)
    5688                      .dwattr $C$DW$705, DW_AT_name("rsvd_10")
    5689                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd_10")
    5690                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5691                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    5692              
    5693              $C$DW$706       .dwtag  DW_TAG_member
    5694                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    5695                      .dwattr $C$DW$706, DW_AT_name("ADCSOCxCTL")
    5696                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5697                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5698                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    5699              
    5700              $C$DW$707       .dwtag  DW_TAG_member
    5701                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$24)
    5702                      .dwattr $C$DW$707, DW_AT_name("rsvd_11")
    5703                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_rsvd_11")
    5704                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5705                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    5706              
    5707              $C$DW$708       .dwtag  DW_TAG_member
    5708                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$23)
    5709                      .dwattr $C$DW$708, DW_AT_name("ADCREFTRIM")
    5710                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5711                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5712                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    5713              
    5714              $C$DW$709       .dwtag  DW_TAG_member
    5715                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$23)
    5716                      .dwattr $C$DW$709, DW_AT_name("ADCOFFTRIM")
    5717                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5718                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5719                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    5720              
    5721              $C$DW$710       .dwtag  DW_TAG_member
    5722                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$29)
    5723                      .dwattr $C$DW$710, DW_AT_name("resvd_12")
    5724                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_resvd_12")
    5725                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5726                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    5727              
    5728              $C$DW$711       .dwtag  DW_TAG_member
    5729                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$23)
    5730                      .dwattr $C$DW$711, DW_AT_name("ADCREV")
    5731                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_ADCREV")
    5732                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5733                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    5734              
    5735                      .dwendtag $C$DW$T$30
    5736              
    5737              $C$DW$T$273     .dwtag  DW_TAG_typedef
    5738                      .dwattr $C$DW$T$273, DW_AT_name("ADC_Obj")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  111

    5739                      .dwattr $C$DW$T$273, DW_AT_type(*$C$DW$T$30)
    5740                      .dwattr $C$DW$T$273, DW_AT_language(DW_LANG_C)
    5741              
    5742              $C$DW$T$158     .dwtag  DW_TAG_pointer_type
    5743                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$30)
    5744                      .dwattr $C$DW$T$158, DW_AT_address_class(0x20)
    5745              
    5746              $C$DW$T$159     .dwtag  DW_TAG_typedef
    5747                      .dwattr $C$DW$T$159, DW_AT_name("ADC_Handle")
    5748                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$158)
    5749                      .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    5750              
    5751              
    5752              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5753                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    5754                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    5755              $C$DW$712       .dwtag  DW_TAG_member
    5756                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$31)
    5757                      .dwattr $C$DW$712, DW_AT_name("alpha_sf")
    5758                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_alpha_sf")
    5759                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5760                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    5761              
    5762              $C$DW$713       .dwtag  DW_TAG_member
    5763                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$31)
    5764                      .dwattr $C$DW$713, DW_AT_name("beta_sf")
    5765                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_beta_sf")
    5766                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5767                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    5768              
    5769              $C$DW$714       .dwtag  DW_TAG_member
    5770                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$32)
    5771                      .dwattr $C$DW$714, DW_AT_name("numSensors")
    5772                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_numSensors")
    5773                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5774                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    5775              
    5776                      .dwendtag $C$DW$T$33
    5777              
    5778              $C$DW$T$47      .dwtag  DW_TAG_typedef
    5779                      .dwattr $C$DW$T$47, DW_AT_name("CLARKE_Obj")
    5780                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$33)
    5781                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    5782              
    5783              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    5784                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$33)
    5785                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    5786              
    5787              $C$DW$T$46      .dwtag  DW_TAG_typedef
    5788                      .dwattr $C$DW$T$46, DW_AT_name("CLARKE_Handle")
    5789                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    5790                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5791              
    5792              
    5793              $C$DW$T$35      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  112

    5794                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    5795                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    5796              $C$DW$715       .dwtag  DW_TAG_member
    5797                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$23)
    5798                      .dwattr $C$DW$715, DW_AT_name("XCLK")
    5799                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_XCLK")
    5800                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5801                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    5802              
    5803              $C$DW$716       .dwtag  DW_TAG_member
    5804                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$23)
    5805                      .dwattr $C$DW$716, DW_AT_name("rsvd_1")
    5806                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_rsvd_1")
    5807                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5808                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    5809              
    5810              $C$DW$717       .dwtag  DW_TAG_member
    5811                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$23)
    5812                      .dwattr $C$DW$717, DW_AT_name("CLKCTL")
    5813                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_CLKCTL")
    5814                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5815                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    5816              
    5817              $C$DW$718       .dwtag  DW_TAG_member
    5818                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$34)
    5819                      .dwattr $C$DW$718, DW_AT_name("rsvd_2")
    5820                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_rsvd_2")
    5821                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5822                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    5823              
    5824              $C$DW$719       .dwtag  DW_TAG_member
    5825                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$23)
    5826                      .dwattr $C$DW$719, DW_AT_name("LOSPCP")
    5827                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_LOSPCP")
    5828                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5829                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    5830              
    5831              $C$DW$720       .dwtag  DW_TAG_member
    5832                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$23)
    5833                      .dwattr $C$DW$720, DW_AT_name("PCLKCR0")
    5834                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_PCLKCR0")
    5835                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5836                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5837              
    5838              $C$DW$721       .dwtag  DW_TAG_member
    5839                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$23)
    5840                      .dwattr $C$DW$721, DW_AT_name("PCLKCR1")
    5841                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_PCLKCR1")
    5842                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5843                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5844              
    5845              $C$DW$722       .dwtag  DW_TAG_member
    5846                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$26)
    5847                      .dwattr $C$DW$722, DW_AT_name("rsvd_3")
    5848                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_rsvd_3")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  113

    5849                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5850                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    5851              
    5852              $C$DW$723       .dwtag  DW_TAG_member
    5853                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$23)
    5854                      .dwattr $C$DW$723, DW_AT_name("PCLKCR3")
    5855                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_PCLKCR3")
    5856                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5857                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    5858              
    5859                      .dwendtag $C$DW$T$35
    5860              
    5861              $C$DW$T$160     .dwtag  DW_TAG_pointer_type
    5862                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$35)
    5863                      .dwattr $C$DW$T$160, DW_AT_address_class(0x20)
    5864              
    5865              $C$DW$T$161     .dwtag  DW_TAG_typedef
    5866                      .dwattr $C$DW$T$161, DW_AT_name("CLK_Handle")
    5867                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$160)
    5868                      .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    5869              
    5870              
    5871              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5872                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    5873                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    5874              $C$DW$724       .dwtag  DW_TAG_member
    5875                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$32)
    5876                      .dwattr $C$DW$724, DW_AT_name("tmp")
    5877                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_tmp")
    5878                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5879                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    5880              
    5881                      .dwendtag $C$DW$T$36
    5882              
    5883              $C$DW$T$162     .dwtag  DW_TAG_pointer_type
    5884                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$36)
    5885                      .dwattr $C$DW$T$162, DW_AT_address_class(0x20)
    5886              
    5887              $C$DW$T$163     .dwtag  DW_TAG_typedef
    5888                      .dwattr $C$DW$T$163, DW_AT_name("CPU_Handle")
    5889                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
    5890                      .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    5891              
    5892              
    5893              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5894                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_USAGE_Obj_")
    5895                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x16)
    5896              $C$DW$725       .dwtag  DW_TAG_member
    5897                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$37)
    5898                      .dwattr $C$DW$725, DW_AT_name("timerPeriod_cnts")
    5899                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    5900                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5901                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5902              
    5903              $C$DW$726       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  114

    5904                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$37)
    5905                      .dwattr $C$DW$726, DW_AT_name("cnt_z0")
    5906                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_cnt_z0")
    5907                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5908                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    5909              
    5910              $C$DW$727       .dwtag  DW_TAG_member
    5911                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$37)
    5912                      .dwattr $C$DW$727, DW_AT_name("cnt_z1")
    5913                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_cnt_z1")
    5914                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5915                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    5916              
    5917              $C$DW$728       .dwtag  DW_TAG_member
    5918                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$37)
    5919                      .dwattr $C$DW$728, DW_AT_name("deltaCnt")
    5920                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_deltaCnt")
    5921                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5922                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5923              
    5924              $C$DW$729       .dwtag  DW_TAG_member
    5925                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$37)
    5926                      .dwattr $C$DW$729, DW_AT_name("deltaCntAcc")
    5927                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_deltaCntAcc")
    5928                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5929                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5930              
    5931              $C$DW$730       .dwtag  DW_TAG_member
    5932                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$37)
    5933                      .dwattr $C$DW$730, DW_AT_name("deltaCntAccNum")
    5934                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_deltaCntAccNum")
    5935                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5936                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5937              
    5938              $C$DW$731       .dwtag  DW_TAG_member
    5939                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$37)
    5940                      .dwattr $C$DW$731, DW_AT_name("deltaCntAccNumMax")
    5941                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
    5942                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5943                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5944              
    5945              $C$DW$732       .dwtag  DW_TAG_member
    5946                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$37)
    5947                      .dwattr $C$DW$732, DW_AT_name("minDeltaCntObserved")
    5948                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_minDeltaCntObserved")
    5949                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5950                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5951              
    5952              $C$DW$733       .dwtag  DW_TAG_member
    5953                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$37)
    5954                      .dwattr $C$DW$733, DW_AT_name("avgDeltaCntObserved")
    5955                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
    5956                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5957                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5958              
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  115

    5959              $C$DW$734       .dwtag  DW_TAG_member
    5960                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$37)
    5961                      .dwattr $C$DW$734, DW_AT_name("maxDeltaCntObserved")
    5962                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    5963                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5964                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5965              
    5966              $C$DW$735       .dwtag  DW_TAG_member
    5967                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$38)
    5968                      .dwattr $C$DW$735, DW_AT_name("flag_resetStats")
    5969                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_flag_resetStats")
    5970                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5971                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    5972              
    5973                      .dwendtag $C$DW$T$39
    5974              
    5975              $C$DW$T$274     .dwtag  DW_TAG_typedef
    5976                      .dwattr $C$DW$T$274, DW_AT_name("CPU_USAGE_Obj")
    5977                      .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$39)
    5978                      .dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
    5979              
    5980              $C$DW$T$275     .dwtag  DW_TAG_pointer_type
    5981                      .dwattr $C$DW$T$275, DW_AT_type(*$C$DW$T$39)
    5982                      .dwattr $C$DW$T$275, DW_AT_address_class(0x20)
    5983              
    5984              $C$DW$T$276     .dwtag  DW_TAG_typedef
    5985                      .dwattr $C$DW$T$276, DW_AT_name("CPU_USAGE_Handle")
    5986                      .dwattr $C$DW$T$276, DW_AT_type(*$C$DW$T$275)
    5987                      .dwattr $C$DW$T$276, DW_AT_language(DW_LANG_C)
    5988              
    5989              
    5990              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    5991                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    5992                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    5993              $C$DW$736       .dwtag  DW_TAG_member
    5994                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$40)
    5995                      .dwattr $C$DW$736, DW_AT_name("version")
    5996                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_version")
    5997                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5998                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    5999              
    6000              $C$DW$737       .dwtag  DW_TAG_member
    6001                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$42)
    6002                      .dwattr $C$DW$737, DW_AT_name("state")
    6003                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_state")
    6004                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6005                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6006              
    6007              $C$DW$738       .dwtag  DW_TAG_member
    6008                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$42)
    6009                      .dwattr $C$DW$738, DW_AT_name("prevState")
    6010                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_prevState")
    6011                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6012                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6013              
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  116

    6014              $C$DW$739       .dwtag  DW_TAG_member
    6015                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$44)
    6016                      .dwattr $C$DW$739, DW_AT_name("errorCode")
    6017                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_errorCode")
    6018                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6019                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6020              
    6021              $C$DW$740       .dwtag  DW_TAG_member
    6022                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$46)
    6023                      .dwattr $C$DW$740, DW_AT_name("clarkeHandle_I")
    6024                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6025                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6026                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6027              
    6028              $C$DW$741       .dwtag  DW_TAG_member
    6029                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$47)
    6030                      .dwattr $C$DW$741, DW_AT_name("clarke_I")
    6031                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_clarke_I")
    6032                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6033                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6034              
    6035              $C$DW$742       .dwtag  DW_TAG_member
    6036                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$46)
    6037                      .dwattr $C$DW$742, DW_AT_name("clarkeHandle_V")
    6038                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6039                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6040                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6041              
    6042              $C$DW$743       .dwtag  DW_TAG_member
    6043                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$47)
    6044                      .dwattr $C$DW$743, DW_AT_name("clarke_V")
    6045                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_clarke_V")
    6046                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6047                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6048              
    6049              $C$DW$744       .dwtag  DW_TAG_member
    6050                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$49)
    6051                      .dwattr $C$DW$744, DW_AT_name("estHandle")
    6052                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_estHandle")
    6053                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6054                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6055              
    6056              $C$DW$745       .dwtag  DW_TAG_member
    6057                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$51)
    6058                      .dwattr $C$DW$745, DW_AT_name("parkHandle")
    6059                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_parkHandle")
    6060                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6061                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6062              
    6063              $C$DW$746       .dwtag  DW_TAG_member
    6064                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$52)
    6065                      .dwattr $C$DW$746, DW_AT_name("park")
    6066                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_park")
    6067                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6068                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  117

    6069              
    6070              $C$DW$747       .dwtag  DW_TAG_member
    6071                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$54)
    6072                      .dwattr $C$DW$747, DW_AT_name("pidHandle_Id")
    6073                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_pidHandle_Id")
    6074                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6075                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6076              
    6077              $C$DW$748       .dwtag  DW_TAG_member
    6078                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$55)
    6079                      .dwattr $C$DW$748, DW_AT_name("pid_Id")
    6080                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_pid_Id")
    6081                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6082                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6083              
    6084              $C$DW$749       .dwtag  DW_TAG_member
    6085                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$54)
    6086                      .dwattr $C$DW$749, DW_AT_name("pidHandle_Iq")
    6087                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6088                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6089                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    6090              
    6091              $C$DW$750       .dwtag  DW_TAG_member
    6092                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$55)
    6093                      .dwattr $C$DW$750, DW_AT_name("pid_Iq")
    6094                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_pid_Iq")
    6095                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6096                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    6097              
    6098              $C$DW$751       .dwtag  DW_TAG_member
    6099                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$54)
    6100                      .dwattr $C$DW$751, DW_AT_name("pidHandle_spd")
    6101                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_pidHandle_spd")
    6102                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6103                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    6104              
    6105              $C$DW$752       .dwtag  DW_TAG_member
    6106                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$55)
    6107                      .dwattr $C$DW$752, DW_AT_name("pid_spd")
    6108                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_pid_spd")
    6109                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6110                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    6111              
    6112              $C$DW$753       .dwtag  DW_TAG_member
    6113                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$57)
    6114                      .dwattr $C$DW$753, DW_AT_name("iparkHandle")
    6115                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_iparkHandle")
    6116                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6117                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    6118              
    6119              $C$DW$754       .dwtag  DW_TAG_member
    6120                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$58)
    6121                      .dwattr $C$DW$754, DW_AT_name("ipark")
    6122                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_ipark")
    6123                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  118

    6124                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    6125              
    6126              $C$DW$755       .dwtag  DW_TAG_member
    6127                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$60)
    6128                      .dwattr $C$DW$755, DW_AT_name("svgenHandle")
    6129                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_svgenHandle")
    6130                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6131                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    6132              
    6133              $C$DW$756       .dwtag  DW_TAG_member
    6134                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$61)
    6135                      .dwattr $C$DW$756, DW_AT_name("svgen")
    6136                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_svgen")
    6137                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6138                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    6139              
    6140              $C$DW$757       .dwtag  DW_TAG_member
    6141                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$63)
    6142                      .dwattr $C$DW$757, DW_AT_name("trajHandle_Id")
    6143                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_trajHandle_Id")
    6144                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6145                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    6146              
    6147              $C$DW$758       .dwtag  DW_TAG_member
    6148                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$64)
    6149                      .dwattr $C$DW$758, DW_AT_name("traj_Id")
    6150                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_traj_Id")
    6151                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6152                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    6153              
    6154              $C$DW$759       .dwtag  DW_TAG_member
    6155                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$63)
    6156                      .dwattr $C$DW$759, DW_AT_name("trajHandle_spd")
    6157                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_trajHandle_spd")
    6158                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6159                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    6160              
    6161              $C$DW$760       .dwtag  DW_TAG_member
    6162                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$64)
    6163                      .dwattr $C$DW$760, DW_AT_name("traj_spd")
    6164                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_traj_spd")
    6165                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6166                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    6167              
    6168              $C$DW$761       .dwtag  DW_TAG_member
    6169                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$63)
    6170                      .dwattr $C$DW$761, DW_AT_name("trajHandle_spdMax")
    6171                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6172                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6173                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    6174              
    6175              $C$DW$762       .dwtag  DW_TAG_member
    6176                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$64)
    6177                      .dwattr $C$DW$762, DW_AT_name("traj_spdMax")
    6178                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_traj_spdMax")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  119

    6179                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6180                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    6181              
    6182              $C$DW$763       .dwtag  DW_TAG_member
    6183                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$65)
    6184                      .dwattr $C$DW$763, DW_AT_name("motorParams")
    6185                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_motorParams")
    6186                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6187                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    6188              
    6189              $C$DW$764       .dwtag  DW_TAG_member
    6190                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$67)
    6191                      .dwattr $C$DW$764, DW_AT_name("waitTimes")
    6192                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_waitTimes")
    6193                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6194                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    6195              
    6196              $C$DW$765       .dwtag  DW_TAG_member
    6197                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$66)
    6198                      .dwattr $C$DW$765, DW_AT_name("counter_state")
    6199                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_counter_state")
    6200                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6201                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    6202              
    6203              $C$DW$766       .dwtag  DW_TAG_member
    6204                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$68)
    6205                      .dwattr $C$DW$766, DW_AT_name("numIsrTicksPerCtrlTick")
    6206                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6207                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6208                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    6209              
    6210              $C$DW$767       .dwtag  DW_TAG_member
    6211                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$68)
    6212                      .dwattr $C$DW$767, DW_AT_name("numCtrlTicksPerCurrentTick")
    6213                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6214                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6215                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    6216              
    6217              $C$DW$768       .dwtag  DW_TAG_member
    6218                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$68)
    6219                      .dwattr $C$DW$768, DW_AT_name("numCtrlTicksPerSpeedTick")
    6220                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6221                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6222                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    6223              
    6224              $C$DW$769       .dwtag  DW_TAG_member
    6225                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$68)
    6226                      .dwattr $C$DW$769, DW_AT_name("numCtrlTicksPerTrajTick")
    6227                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6228                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6229                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    6230              
    6231              $C$DW$770       .dwtag  DW_TAG_member
    6232                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$66)
    6233                      .dwattr $C$DW$770, DW_AT_name("ctrlFreq_Hz")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  120

    6234                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6235                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6236                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    6237              
    6238              $C$DW$771       .dwtag  DW_TAG_member
    6239                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$66)
    6240                      .dwattr $C$DW$771, DW_AT_name("trajFreq_Hz")
    6241                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6242                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6243                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    6244              
    6245              $C$DW$772       .dwtag  DW_TAG_member
    6246                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$31)
    6247                      .dwattr $C$DW$772, DW_AT_name("trajPeriod_sec")
    6248                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6249                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6250                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    6251              
    6252              $C$DW$773       .dwtag  DW_TAG_member
    6253                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$69)
    6254                      .dwattr $C$DW$773, DW_AT_name("ctrlPeriod_sec")
    6255                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6256                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6257                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    6258              
    6259              $C$DW$774       .dwtag  DW_TAG_member
    6260                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$31)
    6261                      .dwattr $C$DW$774, DW_AT_name("maxVsMag_pu")
    6262                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6263                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6264                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    6265              
    6266              $C$DW$775       .dwtag  DW_TAG_member
    6267                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$70)
    6268                      .dwattr $C$DW$775, DW_AT_name("Iab_in")
    6269                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Iab_in")
    6270                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6271                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    6272              
    6273              $C$DW$776       .dwtag  DW_TAG_member
    6274                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$70)
    6275                      .dwattr $C$DW$776, DW_AT_name("Iab_filt")
    6276                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Iab_filt")
    6277                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6278                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    6279              
    6280              $C$DW$777       .dwtag  DW_TAG_member
    6281                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$70)
    6282                      .dwattr $C$DW$777, DW_AT_name("Idq_in")
    6283                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Idq_in")
    6284                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6285                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    6286              
    6287              $C$DW$778       .dwtag  DW_TAG_member
    6288                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  121

    6289                      .dwattr $C$DW$778, DW_AT_name("Vab_in")
    6290                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Vab_in")
    6291                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6292                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    6293              
    6294              $C$DW$779       .dwtag  DW_TAG_member
    6295                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$31)
    6296                      .dwattr $C$DW$779, DW_AT_name("spd_out")
    6297                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_spd_out")
    6298                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6299                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    6300              
    6301              $C$DW$780       .dwtag  DW_TAG_member
    6302                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$70)
    6303                      .dwattr $C$DW$780, DW_AT_name("Vab_out")
    6304                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Vab_out")
    6305                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6306                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    6307              
    6308              $C$DW$781       .dwtag  DW_TAG_member
    6309                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$70)
    6310                      .dwattr $C$DW$781, DW_AT_name("Vdq_out")
    6311                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Vdq_out")
    6312                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6313                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    6314              
    6315              $C$DW$782       .dwtag  DW_TAG_member
    6316                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$69)
    6317                      .dwattr $C$DW$782, DW_AT_name("Rhf")
    6318                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Rhf")
    6319                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6320                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    6321              
    6322              $C$DW$783       .dwtag  DW_TAG_member
    6323                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$69)
    6324                      .dwattr $C$DW$783, DW_AT_name("Lhf")
    6325                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Lhf")
    6326                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6327                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    6328              
    6329              $C$DW$784       .dwtag  DW_TAG_member
    6330                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$69)
    6331                      .dwattr $C$DW$784, DW_AT_name("RoverL")
    6332                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_RoverL")
    6333                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6334                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    6335              
    6336              $C$DW$785       .dwtag  DW_TAG_member
    6337                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$31)
    6338                      .dwattr $C$DW$785, DW_AT_name("Kp_Id")
    6339                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Kp_Id")
    6340                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6341                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    6342              
    6343              $C$DW$786       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  122

    6344                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$31)
    6345                      .dwattr $C$DW$786, DW_AT_name("Kp_Iq")
    6346                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Kp_Iq")
    6347                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6348                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    6349              
    6350              $C$DW$787       .dwtag  DW_TAG_member
    6351                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$31)
    6352                      .dwattr $C$DW$787, DW_AT_name("Kp_spd")
    6353                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Kp_spd")
    6354                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6355                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    6356              
    6357              $C$DW$788       .dwtag  DW_TAG_member
    6358                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$31)
    6359                      .dwattr $C$DW$788, DW_AT_name("Ki_Id")
    6360                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Ki_Id")
    6361                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6362                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    6363              
    6364              $C$DW$789       .dwtag  DW_TAG_member
    6365                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$31)
    6366                      .dwattr $C$DW$789, DW_AT_name("Ki_Iq")
    6367                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_Ki_Iq")
    6368                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6369                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    6370              
    6371              $C$DW$790       .dwtag  DW_TAG_member
    6372                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$31)
    6373                      .dwattr $C$DW$790, DW_AT_name("Ki_spd")
    6374                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_Ki_spd")
    6375                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6376                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    6377              
    6378              $C$DW$791       .dwtag  DW_TAG_member
    6379                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$31)
    6380                      .dwattr $C$DW$791, DW_AT_name("Kd_Id")
    6381                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_Kd_Id")
    6382                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6383                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    6384              
    6385              $C$DW$792       .dwtag  DW_TAG_member
    6386                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$31)
    6387                      .dwattr $C$DW$792, DW_AT_name("Kd_Iq")
    6388                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_Kd_Iq")
    6389                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6390                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    6391              
    6392              $C$DW$793       .dwtag  DW_TAG_member
    6393                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$31)
    6394                      .dwattr $C$DW$793, DW_AT_name("Kd_spd")
    6395                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_Kd_spd")
    6396                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6397                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    6398              
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  123

    6399              $C$DW$794       .dwtag  DW_TAG_member
    6400                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$31)
    6401                      .dwattr $C$DW$794, DW_AT_name("Ui_Id")
    6402                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_Ui_Id")
    6403                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6404                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    6405              
    6406              $C$DW$795       .dwtag  DW_TAG_member
    6407                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$31)
    6408                      .dwattr $C$DW$795, DW_AT_name("Ui_Iq")
    6409                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_Ui_Iq")
    6410                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6411                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    6412              
    6413              $C$DW$796       .dwtag  DW_TAG_member
    6414                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$31)
    6415                      .dwattr $C$DW$796, DW_AT_name("Ui_spd")
    6416                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_Ui_spd")
    6417                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6418                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    6419              
    6420              $C$DW$797       .dwtag  DW_TAG_member
    6421                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$70)
    6422                      .dwattr $C$DW$797, DW_AT_name("Idq_ref")
    6423                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_Idq_ref")
    6424                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6425                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    6426              
    6427              $C$DW$798       .dwtag  DW_TAG_member
    6428                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$31)
    6429                      .dwattr $C$DW$798, DW_AT_name("IdRated")
    6430                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_IdRated")
    6431                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6432                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    6433              
    6434              $C$DW$799       .dwtag  DW_TAG_member
    6435                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$31)
    6436                      .dwattr $C$DW$799, DW_AT_name("spd_ref")
    6437                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_spd_ref")
    6438                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6439                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    6440              
    6441              $C$DW$800       .dwtag  DW_TAG_member
    6442                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$31)
    6443                      .dwattr $C$DW$800, DW_AT_name("spd_max")
    6444                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_spd_max")
    6445                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6446                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    6447              
    6448              $C$DW$801       .dwtag  DW_TAG_member
    6449                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$68)
    6450                      .dwattr $C$DW$801, DW_AT_name("counter_current")
    6451                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_counter_current")
    6452                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6453                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  124

    6454              
    6455              $C$DW$802       .dwtag  DW_TAG_member
    6456                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$68)
    6457                      .dwattr $C$DW$802, DW_AT_name("counter_isr")
    6458                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_counter_isr")
    6459                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6460                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    6461              
    6462              $C$DW$803       .dwtag  DW_TAG_member
    6463                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$68)
    6464                      .dwattr $C$DW$803, DW_AT_name("counter_speed")
    6465                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_counter_speed")
    6466                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6467                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    6468              
    6469              $C$DW$804       .dwtag  DW_TAG_member
    6470                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$68)
    6471                      .dwattr $C$DW$804, DW_AT_name("counter_traj")
    6472                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_counter_traj")
    6473                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6474                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    6475              
    6476              $C$DW$805       .dwtag  DW_TAG_member
    6477                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$38)
    6478                      .dwattr $C$DW$805, DW_AT_name("flag_enableCtrl")
    6479                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6480                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6481                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    6482              
    6483              $C$DW$806       .dwtag  DW_TAG_member
    6484                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$38)
    6485                      .dwattr $C$DW$806, DW_AT_name("flag_enableDcBusComp")
    6486                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6487                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6488                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    6489              
    6490              $C$DW$807       .dwtag  DW_TAG_member
    6491                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$38)
    6492                      .dwattr $C$DW$807, DW_AT_name("flag_enablePowerWarp")
    6493                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6494                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6495                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    6496              
    6497              $C$DW$808       .dwtag  DW_TAG_member
    6498                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$38)
    6499                      .dwattr $C$DW$808, DW_AT_name("flag_enableOffset")
    6500                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_flag_enableOffset")
    6501                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6502                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    6503              
    6504              $C$DW$809       .dwtag  DW_TAG_member
    6505                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$38)
    6506                      .dwattr $C$DW$809, DW_AT_name("flag_enableSpeedCtrl")
    6507                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6508                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  125

    6509                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    6510              
    6511              $C$DW$810       .dwtag  DW_TAG_member
    6512                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$38)
    6513                      .dwattr $C$DW$810, DW_AT_name("flag_enableUserMotorParams")
    6514                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6515                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6516                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    6517              
    6518              $C$DW$811       .dwtag  DW_TAG_member
    6519                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$70)
    6520                      .dwattr $C$DW$811, DW_AT_name("Idq_offset_pu")
    6521                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6522                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6523                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    6524              
    6525              $C$DW$812       .dwtag  DW_TAG_member
    6526                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$70)
    6527                      .dwattr $C$DW$812, DW_AT_name("Vdq_offset_pu")
    6528                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6529                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6530                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    6531              
    6532              $C$DW$813       .dwtag  DW_TAG_member
    6533                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$31)
    6534                      .dwattr $C$DW$813, DW_AT_name("angle_pu")
    6535                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_angle_pu")
    6536                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6537                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    6538              
    6539              $C$DW$814       .dwtag  DW_TAG_member
    6540                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$31)
    6541                      .dwattr $C$DW$814, DW_AT_name("speed_ref_pu")
    6542                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_speed_ref_pu")
    6543                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6544                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    6545              
    6546              $C$DW$815       .dwtag  DW_TAG_member
    6547                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$31)
    6548                      .dwattr $C$DW$815, DW_AT_name("speed_fb_pu")
    6549                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_speed_fb_pu")
    6550                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6551                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    6552              
    6553              $C$DW$816       .dwtag  DW_TAG_member
    6554                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$31)
    6555                      .dwattr $C$DW$816, DW_AT_name("speed_outMax_pu")
    6556                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6557                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6558                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    6559              
    6560              $C$DW$817       .dwtag  DW_TAG_member
    6561                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$38)
    6562                      .dwattr $C$DW$817, DW_AT_name("flag_enableCurrentCtrl")
    6563                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  126

    6564                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6565                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    6566              
    6567                      .dwendtag $C$DW$T$71
    6568              
    6569              $C$DW$T$282     .dwtag  DW_TAG_typedef
    6570                      .dwattr $C$DW$T$282, DW_AT_name("CTRL_Obj")
    6571                      .dwattr $C$DW$T$282, DW_AT_type(*$C$DW$T$71)
    6572                      .dwattr $C$DW$T$282, DW_AT_language(DW_LANG_C)
    6573              
    6574              $C$DW$T$283     .dwtag  DW_TAG_pointer_type
    6575                      .dwattr $C$DW$T$283, DW_AT_type(*$C$DW$T$282)
    6576                      .dwattr $C$DW$T$283, DW_AT_address_class(0x20)
    6577              
    6578              $C$DW$T$240     .dwtag  DW_TAG_pointer_type
    6579                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$71)
    6580                      .dwattr $C$DW$T$240, DW_AT_address_class(0x20)
    6581              
    6582              $C$DW$T$241     .dwtag  DW_TAG_typedef
    6583                      .dwattr $C$DW$T$241, DW_AT_name("CTRL_Handle")
    6584                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$240)
    6585                      .dwattr $C$DW$T$241, DW_AT_language(DW_LANG_C)
    6586              
    6587              $C$DW$818       .dwtag  DW_TAG_TI_far_type
    6588                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$241)
    6589              
    6590              $C$DW$T$284     .dwtag  DW_TAG_const_type
    6591                      .dwattr $C$DW$T$284, DW_AT_type(*$C$DW$818)
    6592              
    6593              
    6594              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    6595                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    6596                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    6597              $C$DW$819       .dwtag  DW_TAG_member
    6598                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$22)
    6599                      .dwattr $C$DW$819, DW_AT_name("rsvd")
    6600                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_rsvd")
    6601                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6602                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    6603              
    6604              $C$DW$820       .dwtag  DW_TAG_member
    6605                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$73)
    6606                      .dwattr $C$DW$820, DW_AT_name("targetProc")
    6607                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_targetProc")
    6608                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6609                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    6610              
    6611              $C$DW$821       .dwtag  DW_TAG_member
    6612                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$22)
    6613                      .dwattr $C$DW$821, DW_AT_name("major")
    6614                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_major")
    6615                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6616                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    6617              
    6618              $C$DW$822       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  127

    6619                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$22)
    6620                      .dwattr $C$DW$822, DW_AT_name("minor")
    6621                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_minor")
    6622                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6623                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    6624              
    6625                      .dwendtag $C$DW$T$74
    6626              
    6627              $C$DW$T$40      .dwtag  DW_TAG_typedef
    6628                      .dwattr $C$DW$T$40, DW_AT_name("CTRL_Version")
    6629                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$74)
    6630                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    6631              
    6632              $C$DW$T$290     .dwtag  DW_TAG_pointer_type
    6633                      .dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$40)
    6634                      .dwattr $C$DW$T$290, DW_AT_address_class(0x20)
    6635              
    6636              
    6637              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    6638                      .dwattr $C$DW$T$81, DW_AT_name("_DRV8305_Obj_")
    6639                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x08)
    6640              $C$DW$823       .dwtag  DW_TAG_member
    6641                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$76)
    6642                      .dwattr $C$DW$823, DW_AT_name("spiHandle")
    6643                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_spiHandle")
    6644                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6645                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    6646              
    6647              $C$DW$824       .dwtag  DW_TAG_member
    6648                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$78)
    6649                      .dwattr $C$DW$824, DW_AT_name("gpioHandle")
    6650                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_gpioHandle")
    6651                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6652                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    6653              
    6654              $C$DW$825       .dwtag  DW_TAG_member
    6655                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$80)
    6656                      .dwattr $C$DW$825, DW_AT_name("gpioNumber")
    6657                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_gpioNumber")
    6658                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6659                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    6660              
    6661              $C$DW$826       .dwtag  DW_TAG_member
    6662                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$38)
    6663                      .dwattr $C$DW$826, DW_AT_name("RxTimeOut")
    6664                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_RxTimeOut")
    6665                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6666                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    6667              
    6668              $C$DW$827       .dwtag  DW_TAG_member
    6669                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$38)
    6670                      .dwattr $C$DW$827, DW_AT_name("enableTimeOut")
    6671                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_enableTimeOut")
    6672                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6673                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  128

    6674              
    6675                      .dwendtag $C$DW$T$81
    6676              
    6677              $C$DW$T$191     .dwtag  DW_TAG_typedef
    6678                      .dwattr $C$DW$T$191, DW_AT_name("DRV8305_Obj")
    6679                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$81)
    6680                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    6681              
    6682              $C$DW$T$189     .dwtag  DW_TAG_pointer_type
    6683                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$81)
    6684                      .dwattr $C$DW$T$189, DW_AT_address_class(0x20)
    6685              
    6686              $C$DW$T$190     .dwtag  DW_TAG_typedef
    6687                      .dwattr $C$DW$T$190, DW_AT_name("DRV8305_Handle")
    6688                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
    6689                      .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    6690              
    6691              
    6692              $C$DW$T$88      .dwtag  DW_TAG_structure_type
    6693                      .dwattr $C$DW$T$88, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
    6694                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x04)
    6695              $C$DW$828       .dwtag  DW_TAG_member
    6696                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$83)
    6697                      .dwattr $C$DW$828, DW_AT_name("IDRIVEP_HS")
    6698                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    6699                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6700                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    6701              
    6702              $C$DW$829       .dwtag  DW_TAG_member
    6703                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$85)
    6704                      .dwattr $C$DW$829, DW_AT_name("IDRIVEN_HS")
    6705                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    6706                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6707                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    6708              
    6709              $C$DW$830       .dwtag  DW_TAG_member
    6710                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$87)
    6711                      .dwattr $C$DW$830, DW_AT_name("TDRIVEN")
    6712                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_TDRIVEN")
    6713                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6714                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    6715              
    6716              $C$DW$831       .dwtag  DW_TAG_member
    6717                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$38)
    6718                      .dwattr $C$DW$831, DW_AT_name("CTRL05_RSV1")
    6719                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_CTRL05_RSV1")
    6720                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6721                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    6722              
    6723                      .dwendtag $C$DW$T$88
    6724              
    6725              $C$DW$T$140     .dwtag  DW_TAG_typedef
    6726                      .dwattr $C$DW$T$140, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
    6727                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$88)
    6728                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v16.9.6 Tue Jan 30 22:39:49 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{CB9992C4-D717-45BF-B5BC-B86F66994D06} PAGE  129

    6729              
    6730              
    6731              $C$DW$T$95      .dwtag  DW_TAG_structure_type
    6732                      .dwattr $C$DW$T$95, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
    6733                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x04)
    6734              $C$DW$832       .dwtag  DW_TAG_member
    6735                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$90)
    6736                      .dwattr $C$DW$832, DW_AT_name("IDRIVEP_LS")
    6737                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    6738                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6739                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    6740              
    6741              $C$DW$833       .dwtag  DW_TAG_member
    6742                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$92)
    6743                      .dwattr $C$DW$833, DW_AT_name("IDRIVEN_LS")
    6744                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    6745                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6746                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    6747              
    6748              $C$DW$834       .dwtag  DW_TAG_member
    6749                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$94)
    6750                      .dwattr $C$DW$834, DW_AT_name("TDRIVEP")
    6751                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_TDRIVEP")
    6752                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6753                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    6754              
    6755              $C$DW$835       .dwtag  DW_TAG_member
    6756                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$38)
    6757                      .dwattr $C$DW$835, DW_AT_name("CTRL06_RSV1")
    6758                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_CTRL06_RSV1")
    6759                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6760                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    6761              
    6762                      .dwendtag $C$DW$T$95
    6763              
    6764              $C$DW$T$141     .dwtag  DW_TAG_typedef
    6765                      .dwattr $C$DW$T$141, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
    6766                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$95)
    6767                      .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    6768              
    6769              
    6770              $C$DW$T$106     .dwtag  DW_TAG_structure_type
