TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.6.LTS *
       3              ;* Date/Time created: Sun Jan 28 18:08:26 2018                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../src/remote_car.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-2017
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("G:\code\c\ccs\remote_car\Flash")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    5345                      .dwattr $C$DW$649, DW_AT_name("PIE_GroupNumber_4")
    5346                      .dwattr $C$DW$649, DW_AT_const_value(0x03)
    5347              
    5348              $C$DW$650       .dwtag  DW_TAG_enumerator
    5349                      .dwattr $C$DW$650, DW_AT_name("PIE_GroupNumber_5")
    5350                      .dwattr $C$DW$650, DW_AT_const_value(0x04)
    5351              
    5352              $C$DW$651       .dwtag  DW_TAG_enumerator
    5353                      .dwattr $C$DW$651, DW_AT_name("PIE_GroupNumber_6")
    5354                      .dwattr $C$DW$651, DW_AT_const_value(0x05)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  104

    5355              
    5356              $C$DW$652       .dwtag  DW_TAG_enumerator
    5357                      .dwattr $C$DW$652, DW_AT_name("PIE_GroupNumber_7")
    5358                      .dwattr $C$DW$652, DW_AT_const_value(0x06)
    5359              
    5360              $C$DW$653       .dwtag  DW_TAG_enumerator
    5361                      .dwattr $C$DW$653, DW_AT_name("PIE_GroupNumber_8")
    5362                      .dwattr $C$DW$653, DW_AT_const_value(0x07)
    5363              
    5364              $C$DW$654       .dwtag  DW_TAG_enumerator
    5365                      .dwattr $C$DW$654, DW_AT_name("PIE_GroupNumber_9")
    5366                      .dwattr $C$DW$654, DW_AT_const_value(0x08)
    5367              
    5368              $C$DW$655       .dwtag  DW_TAG_enumerator
    5369                      .dwattr $C$DW$655, DW_AT_name("PIE_GroupNumber_10")
    5370                      .dwattr $C$DW$655, DW_AT_const_value(0x09)
    5371              
    5372              $C$DW$656       .dwtag  DW_TAG_enumerator
    5373                      .dwattr $C$DW$656, DW_AT_name("PIE_GroupNumber_11")
    5374                      .dwattr $C$DW$656, DW_AT_const_value(0x0a)
    5375              
    5376              $C$DW$657       .dwtag  DW_TAG_enumerator
    5377                      .dwattr $C$DW$657, DW_AT_name("PIE_GroupNumber_12")
    5378                      .dwattr $C$DW$657, DW_AT_const_value(0x0b)
    5379              
    5380                      .dwendtag $C$DW$T$256
    5381              
    5382              $C$DW$T$257     .dwtag  DW_TAG_typedef
    5383                      .dwattr $C$DW$T$257, DW_AT_name("PIE_GroupNumber_e")
    5384                      .dwattr $C$DW$T$257, DW_AT_type(*$C$DW$T$256)
    5385                      .dwattr $C$DW$T$257, DW_AT_language(DW_LANG_C)
    5386              
    5387              
    5388              $C$DW$T$259     .dwtag  DW_TAG_enumeration_type
    5389                      .dwattr $C$DW$T$259, DW_AT_byte_size(0x01)
    5390              $C$DW$658       .dwtag  DW_TAG_enumerator
    5391                      .dwattr $C$DW$658, DW_AT_name("HAL_SensorType_Current")
    5392                      .dwattr $C$DW$658, DW_AT_const_value(0x00)
    5393              
    5394              $C$DW$659       .dwtag  DW_TAG_enumerator
    5395                      .dwattr $C$DW$659, DW_AT_name("HAL_SensorType_Voltage")
    5396                      .dwattr $C$DW$659, DW_AT_const_value(0x01)
    5397              
    5398                      .dwendtag $C$DW$T$259
    5399              
    5400              $C$DW$T$260     .dwtag  DW_TAG_typedef
    5401                      .dwattr $C$DW$T$260, DW_AT_name("HAL_SensorType_e")
    5402                      .dwattr $C$DW$T$260, DW_AT_type(*$C$DW$T$259)
    5403                      .dwattr $C$DW$T$260, DW_AT_language(DW_LANG_C)
    5404              
    5405              
    5406              $C$DW$T$262     .dwtag  DW_TAG_enumeration_type
    5407                      .dwattr $C$DW$T$262, DW_AT_byte_size(0x01)
    5408              $C$DW$660       .dwtag  DW_TAG_enumerator
    5409                      .dwattr $C$DW$660, DW_AT_name("PWM_Number_1")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  105

    5410                      .dwattr $C$DW$660, DW_AT_const_value(0x00)
    5411              
    5412              $C$DW$661       .dwtag  DW_TAG_enumerator
    5413                      .dwattr $C$DW$661, DW_AT_name("PWM_Number_2")
    5414                      .dwattr $C$DW$661, DW_AT_const_value(0x01)
    5415              
    5416              $C$DW$662       .dwtag  DW_TAG_enumerator
    5417                      .dwattr $C$DW$662, DW_AT_name("PWM_Number_3")
    5418                      .dwattr $C$DW$662, DW_AT_const_value(0x02)
    5419              
    5420              $C$DW$663       .dwtag  DW_TAG_enumerator
    5421                      .dwattr $C$DW$663, DW_AT_name("PWM_Number_4")
    5422                      .dwattr $C$DW$663, DW_AT_const_value(0x03)
    5423              
    5424                      .dwendtag $C$DW$T$262
    5425              
    5426              $C$DW$T$263     .dwtag  DW_TAG_typedef
    5427                      .dwattr $C$DW$T$263, DW_AT_name("PWM_Number_e")
    5428                      .dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$262)
    5429                      .dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
    5430              
    5431              
    5432              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5433                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    5434                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    5435              $C$DW$664       .dwtag  DW_TAG_member
    5436                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$24)
    5437                      .dwattr $C$DW$664, DW_AT_name("ADCRESULT")
    5438                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ADCRESULT")
    5439                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5440                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5441              
    5442              $C$DW$665       .dwtag  DW_TAG_member
    5443                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$25)
    5444                      .dwattr $C$DW$665, DW_AT_name("resvd_1")
    5445                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_resvd_1")
    5446                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5447                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5448              
    5449              $C$DW$666       .dwtag  DW_TAG_member
    5450                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$23)
    5451                      .dwattr $C$DW$666, DW_AT_name("ADCCTL1")
    5452                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_ADCCTL1")
    5453                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    5454                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5455              
    5456              $C$DW$667       .dwtag  DW_TAG_member
    5457                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$23)
    5458                      .dwattr $C$DW$667, DW_AT_name("ADCCTL2")
    5459                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_ADCCTL2")
    5460                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5461                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5462              
    5463              $C$DW$668       .dwtag  DW_TAG_member
    5464                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  106

    5465                      .dwattr $C$DW$668, DW_AT_name("rsvd_2")
    5466                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_rsvd_2")
    5467                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5468                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5469              
    5470              $C$DW$669       .dwtag  DW_TAG_member
    5471                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$23)
    5472                      .dwattr $C$DW$669, DW_AT_name("ADCINTFLG")
    5473                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_ADCINTFLG")
    5474                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5475                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5476              
    5477              $C$DW$670       .dwtag  DW_TAG_member
    5478                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$23)
    5479                      .dwattr $C$DW$670, DW_AT_name("ADCINTFLGCLR")
    5480                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5481                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5482                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5483              
    5484              $C$DW$671       .dwtag  DW_TAG_member
    5485                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$23)
    5486                      .dwattr $C$DW$671, DW_AT_name("ADCINTOVF")
    5487                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_ADCINTOVF")
    5488                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5489                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5490              
    5491              $C$DW$672       .dwtag  DW_TAG_member
    5492                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$23)
    5493                      .dwattr $C$DW$672, DW_AT_name("ADCINTOVFCLR")
    5494                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5495                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5496                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5497              
    5498              $C$DW$673       .dwtag  DW_TAG_member
    5499                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$27)
    5500                      .dwattr $C$DW$673, DW_AT_name("INTSELxNy")
    5501                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_INTSELxNy")
    5502                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5503                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5504              
    5505              $C$DW$674       .dwtag  DW_TAG_member
    5506                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$28)
    5507                      .dwattr $C$DW$674, DW_AT_name("rsvd_3")
    5508                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_rsvd_3")
    5509                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5510                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5511              
    5512              $C$DW$675       .dwtag  DW_TAG_member
    5513                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$23)
    5514                      .dwattr $C$DW$675, DW_AT_name("SOCPRICTRL")
    5515                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5516                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5517                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5518              
    5519              $C$DW$676       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  107

    5520                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$23)
    5521                      .dwattr $C$DW$676, DW_AT_name("rsvd_4")
    5522                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_rsvd_4")
    5523                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5524                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5525              
    5526              $C$DW$677       .dwtag  DW_TAG_member
    5527                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$23)
    5528                      .dwattr $C$DW$677, DW_AT_name("ADCSAMPLEMODE")
    5529                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5530                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5531                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5532              
    5533              $C$DW$678       .dwtag  DW_TAG_member
    5534                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$23)
    5535                      .dwattr $C$DW$678, DW_AT_name("rsvd_5")
    5536                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_rsvd_5")
    5537                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5538                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5539              
    5540              $C$DW$679       .dwtag  DW_TAG_member
    5541                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$23)
    5542                      .dwattr $C$DW$679, DW_AT_name("ADCINTSOCSEL1")
    5543                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5544                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5545                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5546              
    5547              $C$DW$680       .dwtag  DW_TAG_member
    5548                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$23)
    5549                      .dwattr $C$DW$680, DW_AT_name("ADCINTSOCSEL2")
    5550                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5551                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5552                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5553              
    5554              $C$DW$681       .dwtag  DW_TAG_member
    5555                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$26)
    5556                      .dwattr $C$DW$681, DW_AT_name("rsvd_6")
    5557                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_rsvd_6")
    5558                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5559                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5560              
    5561              $C$DW$682       .dwtag  DW_TAG_member
    5562                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$23)
    5563                      .dwattr $C$DW$682, DW_AT_name("ADCSOCFLG1")
    5564                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5565                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5566                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5567              
    5568              $C$DW$683       .dwtag  DW_TAG_member
    5569                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$23)
    5570                      .dwattr $C$DW$683, DW_AT_name("rsvd_7")
    5571                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_7")
    5572                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5573                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5574              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  108

    5575              $C$DW$684       .dwtag  DW_TAG_member
    5576                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$23)
    5577                      .dwattr $C$DW$684, DW_AT_name("ADCSOCFRC1")
    5578                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5579                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5580                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5581              
    5582              $C$DW$685       .dwtag  DW_TAG_member
    5583                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$23)
    5584                      .dwattr $C$DW$685, DW_AT_name("rsvd_8")
    5585                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_rsvd_8")
    5586                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5587                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5588              
    5589              $C$DW$686       .dwtag  DW_TAG_member
    5590                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$23)
    5591                      .dwattr $C$DW$686, DW_AT_name("ADCSOCOVF1")
    5592                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5593                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5594                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5595              
    5596              $C$DW$687       .dwtag  DW_TAG_member
    5597                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$23)
    5598                      .dwattr $C$DW$687, DW_AT_name("rsvd_9")
    5599                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_rsvd_9")
    5600                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5601                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5602              
    5603              $C$DW$688       .dwtag  DW_TAG_member
    5604                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$23)
    5605                      .dwattr $C$DW$688, DW_AT_name("ADCSOCOVFCLR1")
    5606                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5607                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5608                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5609              
    5610              $C$DW$689       .dwtag  DW_TAG_member
    5611                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$23)
    5612                      .dwattr $C$DW$689, DW_AT_name("rsvd_10")
    5613                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_10")
    5614                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5615                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5616              
    5617              $C$DW$690       .dwtag  DW_TAG_member
    5618                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$24)
    5619                      .dwattr $C$DW$690, DW_AT_name("ADCSOCxCTL")
    5620                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5621                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5622                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5623              
    5624              $C$DW$691       .dwtag  DW_TAG_member
    5625                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$24)
    5626                      .dwattr $C$DW$691, DW_AT_name("rsvd_11")
    5627                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_11")
    5628                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5629                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  109

    5630              
    5631              $C$DW$692       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    5633                      .dwattr $C$DW$692, DW_AT_name("ADCREFTRIM")
    5634                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5635                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5636                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    5637              
    5638              $C$DW$693       .dwtag  DW_TAG_member
    5639                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    5640                      .dwattr $C$DW$693, DW_AT_name("ADCOFFTRIM")
    5641                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5642                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5643                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    5644              
    5645              $C$DW$694       .dwtag  DW_TAG_member
    5646                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$29)
    5647                      .dwattr $C$DW$694, DW_AT_name("resvd_12")
    5648                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_resvd_12")
    5649                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5650                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    5651              
    5652              $C$DW$695       .dwtag  DW_TAG_member
    5653                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$23)
    5654                      .dwattr $C$DW$695, DW_AT_name("ADCREV")
    5655                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCREV")
    5656                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5657                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    5658              
    5659                      .dwendtag $C$DW$T$30
    5660              
    5661              $C$DW$T$265     .dwtag  DW_TAG_typedef
    5662                      .dwattr $C$DW$T$265, DW_AT_name("ADC_Obj")
    5663                      .dwattr $C$DW$T$265, DW_AT_type(*$C$DW$T$30)
    5664                      .dwattr $C$DW$T$265, DW_AT_language(DW_LANG_C)
    5665              
    5666              $C$DW$T$158     .dwtag  DW_TAG_pointer_type
    5667                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$30)
    5668                      .dwattr $C$DW$T$158, DW_AT_address_class(0x20)
    5669              
    5670              $C$DW$T$159     .dwtag  DW_TAG_typedef
    5671                      .dwattr $C$DW$T$159, DW_AT_name("ADC_Handle")
    5672                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$158)
    5673                      .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    5674              
    5675              
    5676              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5677                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    5678                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    5679              $C$DW$696       .dwtag  DW_TAG_member
    5680                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$31)
    5681                      .dwattr $C$DW$696, DW_AT_name("alpha_sf")
    5682                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_alpha_sf")
    5683                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5684                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  110

    5685              
    5686              $C$DW$697       .dwtag  DW_TAG_member
    5687                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$31)
    5688                      .dwattr $C$DW$697, DW_AT_name("beta_sf")
    5689                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_beta_sf")
    5690                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5691                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    5692              
    5693              $C$DW$698       .dwtag  DW_TAG_member
    5694                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$32)
    5695                      .dwattr $C$DW$698, DW_AT_name("numSensors")
    5696                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_numSensors")
    5697                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5698                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    5699              
    5700                      .dwendtag $C$DW$T$33
    5701              
    5702              $C$DW$T$47      .dwtag  DW_TAG_typedef
    5703                      .dwattr $C$DW$T$47, DW_AT_name("CLARKE_Obj")
    5704                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$33)
    5705                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    5706              
    5707              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    5708                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$33)
    5709                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    5710              
    5711              $C$DW$T$46      .dwtag  DW_TAG_typedef
    5712                      .dwattr $C$DW$T$46, DW_AT_name("CLARKE_Handle")
    5713                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    5714                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5715              
    5716              
    5717              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5718                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    5719                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    5720              $C$DW$699       .dwtag  DW_TAG_member
    5721                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$23)
    5722                      .dwattr $C$DW$699, DW_AT_name("XCLK")
    5723                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_XCLK")
    5724                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5725                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    5726              
    5727              $C$DW$700       .dwtag  DW_TAG_member
    5728                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    5729                      .dwattr $C$DW$700, DW_AT_name("rsvd_1")
    5730                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_1")
    5731                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5732                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    5733              
    5734              $C$DW$701       .dwtag  DW_TAG_member
    5735                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    5736                      .dwattr $C$DW$701, DW_AT_name("CLKCTL")
    5737                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_CLKCTL")
    5738                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5739                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  111

    5740              
    5741              $C$DW$702       .dwtag  DW_TAG_member
    5742                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$34)
    5743                      .dwattr $C$DW$702, DW_AT_name("rsvd_2")
    5744                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_rsvd_2")
    5745                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5746                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    5747              
    5748              $C$DW$703       .dwtag  DW_TAG_member
    5749                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$23)
    5750                      .dwattr $C$DW$703, DW_AT_name("LOSPCP")
    5751                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_LOSPCP")
    5752                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5753                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    5754              
    5755              $C$DW$704       .dwtag  DW_TAG_member
    5756                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$23)
    5757                      .dwattr $C$DW$704, DW_AT_name("PCLKCR0")
    5758                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_PCLKCR0")
    5759                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5760                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    5761              
    5762              $C$DW$705       .dwtag  DW_TAG_member
    5763                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$23)
    5764                      .dwattr $C$DW$705, DW_AT_name("PCLKCR1")
    5765                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_PCLKCR1")
    5766                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5767                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    5768              
    5769              $C$DW$706       .dwtag  DW_TAG_member
    5770                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$26)
    5771                      .dwattr $C$DW$706, DW_AT_name("rsvd_3")
    5772                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_3")
    5773                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5774                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    5775              
    5776              $C$DW$707       .dwtag  DW_TAG_member
    5777                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    5778                      .dwattr $C$DW$707, DW_AT_name("PCLKCR3")
    5779                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_PCLKCR3")
    5780                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5781                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    5782              
    5783                      .dwendtag $C$DW$T$35
    5784              
    5785              $C$DW$T$160     .dwtag  DW_TAG_pointer_type
    5786                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$35)
    5787                      .dwattr $C$DW$T$160, DW_AT_address_class(0x20)
    5788              
    5789              $C$DW$T$161     .dwtag  DW_TAG_typedef
    5790                      .dwattr $C$DW$T$161, DW_AT_name("CLK_Handle")
    5791                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$160)
    5792                      .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    5793              
    5794              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  112

    5795              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5796                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    5797                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    5798              $C$DW$708       .dwtag  DW_TAG_member
    5799                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$32)
    5800                      .dwattr $C$DW$708, DW_AT_name("tmp")
    5801                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_tmp")
    5802                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5803                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    5804              
    5805                      .dwendtag $C$DW$T$36
    5806              
    5807              $C$DW$T$162     .dwtag  DW_TAG_pointer_type
    5808                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$36)
    5809                      .dwattr $C$DW$T$162, DW_AT_address_class(0x20)
    5810              
    5811              $C$DW$T$163     .dwtag  DW_TAG_typedef
    5812                      .dwattr $C$DW$T$163, DW_AT_name("CPU_Handle")
    5813                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
    5814                      .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    5815              
    5816              
    5817              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5818                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_USAGE_Obj_")
    5819                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x16)
    5820              $C$DW$709       .dwtag  DW_TAG_member
    5821                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$37)
    5822                      .dwattr $C$DW$709, DW_AT_name("timerPeriod_cnts")
    5823                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    5824                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5825                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    5826              
    5827              $C$DW$710       .dwtag  DW_TAG_member
    5828                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$37)
    5829                      .dwattr $C$DW$710, DW_AT_name("cnt_z0")
    5830                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_cnt_z0")
    5831                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5832                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    5833              
    5834              $C$DW$711       .dwtag  DW_TAG_member
    5835                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$37)
    5836                      .dwattr $C$DW$711, DW_AT_name("cnt_z1")
    5837                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_cnt_z1")
    5838                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5839                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    5840              
    5841              $C$DW$712       .dwtag  DW_TAG_member
    5842                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$37)
    5843                      .dwattr $C$DW$712, DW_AT_name("deltaCnt")
    5844                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_deltaCnt")
    5845                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5846                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    5847              
    5848              $C$DW$713       .dwtag  DW_TAG_member
    5849                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  113

    5850                      .dwattr $C$DW$713, DW_AT_name("deltaCntAcc")
    5851                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_deltaCntAcc")
    5852                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5853                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    5854              
    5855              $C$DW$714       .dwtag  DW_TAG_member
    5856                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$37)
    5857                      .dwattr $C$DW$714, DW_AT_name("deltaCntAccNum")
    5858                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_deltaCntAccNum")
    5859                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5860                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    5861              
    5862              $C$DW$715       .dwtag  DW_TAG_member
    5863                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$37)
    5864                      .dwattr $C$DW$715, DW_AT_name("deltaCntAccNumMax")
    5865                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
    5866                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5867                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    5868              
    5869              $C$DW$716       .dwtag  DW_TAG_member
    5870                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$37)
    5871                      .dwattr $C$DW$716, DW_AT_name("minDeltaCntObserved")
    5872                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_minDeltaCntObserved")
    5873                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5874                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    5875              
    5876              $C$DW$717       .dwtag  DW_TAG_member
    5877                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$37)
    5878                      .dwattr $C$DW$717, DW_AT_name("avgDeltaCntObserved")
    5879                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
    5880                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5881                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    5882              
    5883              $C$DW$718       .dwtag  DW_TAG_member
    5884                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$37)
    5885                      .dwattr $C$DW$718, DW_AT_name("maxDeltaCntObserved")
    5886                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    5887                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5888                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    5889              
    5890              $C$DW$719       .dwtag  DW_TAG_member
    5891                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$38)
    5892                      .dwattr $C$DW$719, DW_AT_name("flag_resetStats")
    5893                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_flag_resetStats")
    5894                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5895                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    5896              
    5897                      .dwendtag $C$DW$T$39
    5898              
    5899              $C$DW$T$266     .dwtag  DW_TAG_typedef
    5900                      .dwattr $C$DW$T$266, DW_AT_name("CPU_USAGE_Obj")
    5901                      .dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$39)
    5902                      .dwattr $C$DW$T$266, DW_AT_language(DW_LANG_C)
    5903              
    5904              $C$DW$T$267     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  114

    5905                      .dwattr $C$DW$T$267, DW_AT_type(*$C$DW$T$39)
    5906                      .dwattr $C$DW$T$267, DW_AT_address_class(0x20)
    5907              
    5908              $C$DW$T$268     .dwtag  DW_TAG_typedef
    5909                      .dwattr $C$DW$T$268, DW_AT_name("CPU_USAGE_Handle")
    5910                      .dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$267)
    5911                      .dwattr $C$DW$T$268, DW_AT_language(DW_LANG_C)
    5912              
    5913              
    5914              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    5915                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    5916                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    5917              $C$DW$720       .dwtag  DW_TAG_member
    5918                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$40)
    5919                      .dwattr $C$DW$720, DW_AT_name("version")
    5920                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_version")
    5921                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5922                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5923              
    5924              $C$DW$721       .dwtag  DW_TAG_member
    5925                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$42)
    5926                      .dwattr $C$DW$721, DW_AT_name("state")
    5927                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_state")
    5928                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5929                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5930              
    5931              $C$DW$722       .dwtag  DW_TAG_member
    5932                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$42)
    5933                      .dwattr $C$DW$722, DW_AT_name("prevState")
    5934                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_prevState")
    5935                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5936                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    5937              
    5938              $C$DW$723       .dwtag  DW_TAG_member
    5939                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$44)
    5940                      .dwattr $C$DW$723, DW_AT_name("errorCode")
    5941                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_errorCode")
    5942                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5943                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    5944              
    5945              $C$DW$724       .dwtag  DW_TAG_member
    5946                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$46)
    5947                      .dwattr $C$DW$724, DW_AT_name("clarkeHandle_I")
    5948                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_clarkeHandle_I")
    5949                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5950                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    5951              
    5952              $C$DW$725       .dwtag  DW_TAG_member
    5953                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$47)
    5954                      .dwattr $C$DW$725, DW_AT_name("clarke_I")
    5955                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_clarke_I")
    5956                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5957                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5958              
    5959              $C$DW$726       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  115

    5960                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$46)
    5961                      .dwattr $C$DW$726, DW_AT_name("clarkeHandle_V")
    5962                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_clarkeHandle_V")
    5963                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5964                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    5965              
    5966              $C$DW$727       .dwtag  DW_TAG_member
    5967                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$47)
    5968                      .dwattr $C$DW$727, DW_AT_name("clarke_V")
    5969                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_clarke_V")
    5970                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5971                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    5972              
    5973              $C$DW$728       .dwtag  DW_TAG_member
    5974                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$49)
    5975                      .dwattr $C$DW$728, DW_AT_name("estHandle")
    5976                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_estHandle")
    5977                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5978                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5979              
    5980              $C$DW$729       .dwtag  DW_TAG_member
    5981                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$51)
    5982                      .dwattr $C$DW$729, DW_AT_name("parkHandle")
    5983                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_parkHandle")
    5984                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5985                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5986              
    5987              $C$DW$730       .dwtag  DW_TAG_member
    5988                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$52)
    5989                      .dwattr $C$DW$730, DW_AT_name("park")
    5990                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_park")
    5991                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5992                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5993              
    5994              $C$DW$731       .dwtag  DW_TAG_member
    5995                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$54)
    5996                      .dwattr $C$DW$731, DW_AT_name("pidHandle_Id")
    5997                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_pidHandle_Id")
    5998                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5999                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6000              
    6001              $C$DW$732       .dwtag  DW_TAG_member
    6002                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$55)
    6003                      .dwattr $C$DW$732, DW_AT_name("pid_Id")
    6004                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_pid_Id")
    6005                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6006                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6007              
    6008              $C$DW$733       .dwtag  DW_TAG_member
    6009                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$54)
    6010                      .dwattr $C$DW$733, DW_AT_name("pidHandle_Iq")
    6011                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6012                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6013                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6014              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  116

    6015              $C$DW$734       .dwtag  DW_TAG_member
    6016                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$55)
    6017                      .dwattr $C$DW$734, DW_AT_name("pid_Iq")
    6018                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_pid_Iq")
    6019                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6020                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6021              
    6022              $C$DW$735       .dwtag  DW_TAG_member
    6023                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$54)
    6024                      .dwattr $C$DW$735, DW_AT_name("pidHandle_spd")
    6025                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_pidHandle_spd")
    6026                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6027                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6028              
    6029              $C$DW$736       .dwtag  DW_TAG_member
    6030                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$55)
    6031                      .dwattr $C$DW$736, DW_AT_name("pid_spd")
    6032                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_pid_spd")
    6033                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6034                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6035              
    6036              $C$DW$737       .dwtag  DW_TAG_member
    6037                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$57)
    6038                      .dwattr $C$DW$737, DW_AT_name("iparkHandle")
    6039                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_iparkHandle")
    6040                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6041                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6042              
    6043              $C$DW$738       .dwtag  DW_TAG_member
    6044                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$58)
    6045                      .dwattr $C$DW$738, DW_AT_name("ipark")
    6046                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_ipark")
    6047                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6048                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6049              
    6050              $C$DW$739       .dwtag  DW_TAG_member
    6051                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$60)
    6052                      .dwattr $C$DW$739, DW_AT_name("svgenHandle")
    6053                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_svgenHandle")
    6054                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6055                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6056              
    6057              $C$DW$740       .dwtag  DW_TAG_member
    6058                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$61)
    6059                      .dwattr $C$DW$740, DW_AT_name("svgen")
    6060                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_svgen")
    6061                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6062                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6063              
    6064              $C$DW$741       .dwtag  DW_TAG_member
    6065                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$63)
    6066                      .dwattr $C$DW$741, DW_AT_name("trajHandle_Id")
    6067                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_trajHandle_Id")
    6068                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6069                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  117

    6070              
    6071              $C$DW$742       .dwtag  DW_TAG_member
    6072                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$64)
    6073                      .dwattr $C$DW$742, DW_AT_name("traj_Id")
    6074                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_traj_Id")
    6075                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6076                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6077              
    6078              $C$DW$743       .dwtag  DW_TAG_member
    6079                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$63)
    6080                      .dwattr $C$DW$743, DW_AT_name("trajHandle_spd")
    6081                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_trajHandle_spd")
    6082                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6083                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6084              
    6085              $C$DW$744       .dwtag  DW_TAG_member
    6086                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$64)
    6087                      .dwattr $C$DW$744, DW_AT_name("traj_spd")
    6088                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_traj_spd")
    6089                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6090                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6091              
    6092              $C$DW$745       .dwtag  DW_TAG_member
    6093                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$63)
    6094                      .dwattr $C$DW$745, DW_AT_name("trajHandle_spdMax")
    6095                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6096                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6097                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6098              
    6099              $C$DW$746       .dwtag  DW_TAG_member
    6100                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$64)
    6101                      .dwattr $C$DW$746, DW_AT_name("traj_spdMax")
    6102                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_traj_spdMax")
    6103                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6104                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6105              
    6106              $C$DW$747       .dwtag  DW_TAG_member
    6107                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$65)
    6108                      .dwattr $C$DW$747, DW_AT_name("motorParams")
    6109                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_motorParams")
    6110                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6111                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6112              
    6113              $C$DW$748       .dwtag  DW_TAG_member
    6114                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$67)
    6115                      .dwattr $C$DW$748, DW_AT_name("waitTimes")
    6116                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_waitTimes")
    6117                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6118                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6119              
    6120              $C$DW$749       .dwtag  DW_TAG_member
    6121                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$66)
    6122                      .dwattr $C$DW$749, DW_AT_name("counter_state")
    6123                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_counter_state")
    6124                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  118

    6125                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    6126              
    6127              $C$DW$750       .dwtag  DW_TAG_member
    6128                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$68)
    6129                      .dwattr $C$DW$750, DW_AT_name("numIsrTicksPerCtrlTick")
    6130                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6131                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6132                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    6133              
    6134              $C$DW$751       .dwtag  DW_TAG_member
    6135                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$68)
    6136                      .dwattr $C$DW$751, DW_AT_name("numCtrlTicksPerCurrentTick")
    6137                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6138                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6139                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    6140              
    6141              $C$DW$752       .dwtag  DW_TAG_member
    6142                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$68)
    6143                      .dwattr $C$DW$752, DW_AT_name("numCtrlTicksPerSpeedTick")
    6144                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6145                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6146                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    6147              
    6148              $C$DW$753       .dwtag  DW_TAG_member
    6149                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$68)
    6150                      .dwattr $C$DW$753, DW_AT_name("numCtrlTicksPerTrajTick")
    6151                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6152                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6153                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    6154              
    6155              $C$DW$754       .dwtag  DW_TAG_member
    6156                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$66)
    6157                      .dwattr $C$DW$754, DW_AT_name("ctrlFreq_Hz")
    6158                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6159                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6160                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    6161              
    6162              $C$DW$755       .dwtag  DW_TAG_member
    6163                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$66)
    6164                      .dwattr $C$DW$755, DW_AT_name("trajFreq_Hz")
    6165                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6166                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6167                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    6168              
    6169              $C$DW$756       .dwtag  DW_TAG_member
    6170                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$31)
    6171                      .dwattr $C$DW$756, DW_AT_name("trajPeriod_sec")
    6172                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6173                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6174                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    6175              
    6176              $C$DW$757       .dwtag  DW_TAG_member
    6177                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$69)
    6178                      .dwattr $C$DW$757, DW_AT_name("ctrlPeriod_sec")
    6179                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  119

    6180                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6181                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    6182              
    6183              $C$DW$758       .dwtag  DW_TAG_member
    6184                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$31)
    6185                      .dwattr $C$DW$758, DW_AT_name("maxVsMag_pu")
    6186                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6187                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6188                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    6189              
    6190              $C$DW$759       .dwtag  DW_TAG_member
    6191                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$70)
    6192                      .dwattr $C$DW$759, DW_AT_name("Iab_in")
    6193                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_Iab_in")
    6194                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6195                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    6196              
    6197              $C$DW$760       .dwtag  DW_TAG_member
    6198                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$70)
    6199                      .dwattr $C$DW$760, DW_AT_name("Iab_filt")
    6200                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_Iab_filt")
    6201                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6202                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    6203              
    6204              $C$DW$761       .dwtag  DW_TAG_member
    6205                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$70)
    6206                      .dwattr $C$DW$761, DW_AT_name("Idq_in")
    6207                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_Idq_in")
    6208                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6209                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    6210              
    6211              $C$DW$762       .dwtag  DW_TAG_member
    6212                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$70)
    6213                      .dwattr $C$DW$762, DW_AT_name("Vab_in")
    6214                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_Vab_in")
    6215                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6216                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    6217              
    6218              $C$DW$763       .dwtag  DW_TAG_member
    6219                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$31)
    6220                      .dwattr $C$DW$763, DW_AT_name("spd_out")
    6221                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_spd_out")
    6222                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6223                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    6224              
    6225              $C$DW$764       .dwtag  DW_TAG_member
    6226                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$70)
    6227                      .dwattr $C$DW$764, DW_AT_name("Vab_out")
    6228                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Vab_out")
    6229                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6230                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    6231              
    6232              $C$DW$765       .dwtag  DW_TAG_member
    6233                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$70)
    6234                      .dwattr $C$DW$765, DW_AT_name("Vdq_out")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  120

    6235                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Vdq_out")
    6236                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6237                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    6238              
    6239              $C$DW$766       .dwtag  DW_TAG_member
    6240                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$69)
    6241                      .dwattr $C$DW$766, DW_AT_name("Rhf")
    6242                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Rhf")
    6243                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6244                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    6245              
    6246              $C$DW$767       .dwtag  DW_TAG_member
    6247                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$69)
    6248                      .dwattr $C$DW$767, DW_AT_name("Lhf")
    6249                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_Lhf")
    6250                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6251                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    6252              
    6253              $C$DW$768       .dwtag  DW_TAG_member
    6254                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$69)
    6255                      .dwattr $C$DW$768, DW_AT_name("RoverL")
    6256                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_RoverL")
    6257                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6258                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    6259              
    6260              $C$DW$769       .dwtag  DW_TAG_member
    6261                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$31)
    6262                      .dwattr $C$DW$769, DW_AT_name("Kp_Id")
    6263                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Kp_Id")
    6264                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6265                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    6266              
    6267              $C$DW$770       .dwtag  DW_TAG_member
    6268                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$31)
    6269                      .dwattr $C$DW$770, DW_AT_name("Kp_Iq")
    6270                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Kp_Iq")
    6271                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6272                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    6273              
    6274              $C$DW$771       .dwtag  DW_TAG_member
    6275                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$31)
    6276                      .dwattr $C$DW$771, DW_AT_name("Kp_spd")
    6277                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Kp_spd")
    6278                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    6279                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    6280              
    6281              $C$DW$772       .dwtag  DW_TAG_member
    6282                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$31)
    6283                      .dwattr $C$DW$772, DW_AT_name("Ki_Id")
    6284                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Ki_Id")
    6285                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6286                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    6287              
    6288              $C$DW$773       .dwtag  DW_TAG_member
    6289                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  121

    6290                      .dwattr $C$DW$773, DW_AT_name("Ki_Iq")
    6291                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Ki_Iq")
    6292                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6293                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    6294              
    6295              $C$DW$774       .dwtag  DW_TAG_member
    6296                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$31)
    6297                      .dwattr $C$DW$774, DW_AT_name("Ki_spd")
    6298                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Ki_spd")
    6299                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6300                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    6301              
    6302              $C$DW$775       .dwtag  DW_TAG_member
    6303                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$31)
    6304                      .dwattr $C$DW$775, DW_AT_name("Kd_Id")
    6305                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Kd_Id")
    6306                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6307                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    6308              
    6309              $C$DW$776       .dwtag  DW_TAG_member
    6310                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$31)
    6311                      .dwattr $C$DW$776, DW_AT_name("Kd_Iq")
    6312                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Kd_Iq")
    6313                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6314                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    6315              
    6316              $C$DW$777       .dwtag  DW_TAG_member
    6317                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$31)
    6318                      .dwattr $C$DW$777, DW_AT_name("Kd_spd")
    6319                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Kd_spd")
    6320                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6321                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    6322              
    6323              $C$DW$778       .dwtag  DW_TAG_member
    6324                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$31)
    6325                      .dwattr $C$DW$778, DW_AT_name("Ui_Id")
    6326                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Ui_Id")
    6327                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6328                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    6329              
    6330              $C$DW$779       .dwtag  DW_TAG_member
    6331                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$31)
    6332                      .dwattr $C$DW$779, DW_AT_name("Ui_Iq")
    6333                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Ui_Iq")
    6334                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6335                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    6336              
    6337              $C$DW$780       .dwtag  DW_TAG_member
    6338                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$31)
    6339                      .dwattr $C$DW$780, DW_AT_name("Ui_spd")
    6340                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Ui_spd")
    6341                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6342                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    6343              
    6344              $C$DW$781       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  122

    6345                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$70)
    6346                      .dwattr $C$DW$781, DW_AT_name("Idq_ref")
    6347                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Idq_ref")
    6348                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6349                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    6350              
    6351              $C$DW$782       .dwtag  DW_TAG_member
    6352                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$31)
    6353                      .dwattr $C$DW$782, DW_AT_name("IdRated")
    6354                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_IdRated")
    6355                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6356                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    6357              
    6358              $C$DW$783       .dwtag  DW_TAG_member
    6359                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$31)
    6360                      .dwattr $C$DW$783, DW_AT_name("spd_ref")
    6361                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_spd_ref")
    6362                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6363                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    6364              
    6365              $C$DW$784       .dwtag  DW_TAG_member
    6366                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$31)
    6367                      .dwattr $C$DW$784, DW_AT_name("spd_max")
    6368                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_spd_max")
    6369                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6370                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    6371              
    6372              $C$DW$785       .dwtag  DW_TAG_member
    6373                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$68)
    6374                      .dwattr $C$DW$785, DW_AT_name("counter_current")
    6375                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_counter_current")
    6376                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6377                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    6378              
    6379              $C$DW$786       .dwtag  DW_TAG_member
    6380                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$68)
    6381                      .dwattr $C$DW$786, DW_AT_name("counter_isr")
    6382                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_counter_isr")
    6383                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6384                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    6385              
    6386              $C$DW$787       .dwtag  DW_TAG_member
    6387                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$68)
    6388                      .dwattr $C$DW$787, DW_AT_name("counter_speed")
    6389                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_counter_speed")
    6390                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6391                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    6392              
    6393              $C$DW$788       .dwtag  DW_TAG_member
    6394                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$68)
    6395                      .dwattr $C$DW$788, DW_AT_name("counter_traj")
    6396                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_counter_traj")
    6397                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6398                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    6399              
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  123

    6400              $C$DW$789       .dwtag  DW_TAG_member
    6401                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$38)
    6402                      .dwattr $C$DW$789, DW_AT_name("flag_enableCtrl")
    6403                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6404                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6405                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    6406              
    6407              $C$DW$790       .dwtag  DW_TAG_member
    6408                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$38)
    6409                      .dwattr $C$DW$790, DW_AT_name("flag_enableDcBusComp")
    6410                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6411                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6412                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    6413              
    6414              $C$DW$791       .dwtag  DW_TAG_member
    6415                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$38)
    6416                      .dwattr $C$DW$791, DW_AT_name("flag_enablePowerWarp")
    6417                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6418                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6419                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    6420              
    6421              $C$DW$792       .dwtag  DW_TAG_member
    6422                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$38)
    6423                      .dwattr $C$DW$792, DW_AT_name("flag_enableOffset")
    6424                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_flag_enableOffset")
    6425                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6426                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    6427              
    6428              $C$DW$793       .dwtag  DW_TAG_member
    6429                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$38)
    6430                      .dwattr $C$DW$793, DW_AT_name("flag_enableSpeedCtrl")
    6431                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6432                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6433                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    6434              
    6435              $C$DW$794       .dwtag  DW_TAG_member
    6436                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$38)
    6437                      .dwattr $C$DW$794, DW_AT_name("flag_enableUserMotorParams")
    6438                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6439                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6440                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    6441              
    6442              $C$DW$795       .dwtag  DW_TAG_member
    6443                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$70)
    6444                      .dwattr $C$DW$795, DW_AT_name("Idq_offset_pu")
    6445                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6446                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6447                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    6448              
    6449              $C$DW$796       .dwtag  DW_TAG_member
    6450                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$70)
    6451                      .dwattr $C$DW$796, DW_AT_name("Vdq_offset_pu")
    6452                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6453                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6454                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  124

    6455              
    6456              $C$DW$797       .dwtag  DW_TAG_member
    6457                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$31)
    6458                      .dwattr $C$DW$797, DW_AT_name("angle_pu")
    6459                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_angle_pu")
    6460                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6461                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    6462              
    6463              $C$DW$798       .dwtag  DW_TAG_member
    6464                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$31)
    6465                      .dwattr $C$DW$798, DW_AT_name("speed_ref_pu")
    6466                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_speed_ref_pu")
    6467                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6468                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    6469              
    6470              $C$DW$799       .dwtag  DW_TAG_member
    6471                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$31)
    6472                      .dwattr $C$DW$799, DW_AT_name("speed_fb_pu")
    6473                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_speed_fb_pu")
    6474                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6475                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    6476              
    6477              $C$DW$800       .dwtag  DW_TAG_member
    6478                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$31)
    6479                      .dwattr $C$DW$800, DW_AT_name("speed_outMax_pu")
    6480                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6481                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6482                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    6483              
    6484              $C$DW$801       .dwtag  DW_TAG_member
    6485                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$38)
    6486                      .dwattr $C$DW$801, DW_AT_name("flag_enableCurrentCtrl")
    6487                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6488                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6489                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    6490              
    6491                      .dwendtag $C$DW$T$71
    6492              
    6493              $C$DW$T$274     .dwtag  DW_TAG_typedef
    6494                      .dwattr $C$DW$T$274, DW_AT_name("CTRL_Obj")
    6495                      .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$71)
    6496                      .dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
    6497              
    6498              $C$DW$T$275     .dwtag  DW_TAG_pointer_type
    6499                      .dwattr $C$DW$T$275, DW_AT_type(*$C$DW$T$274)
    6500                      .dwattr $C$DW$T$275, DW_AT_address_class(0x20)
    6501              
    6502              $C$DW$T$238     .dwtag  DW_TAG_pointer_type
    6503                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$71)
    6504                      .dwattr $C$DW$T$238, DW_AT_address_class(0x20)
    6505              
    6506              $C$DW$T$239     .dwtag  DW_TAG_typedef
    6507                      .dwattr $C$DW$T$239, DW_AT_name("CTRL_Handle")
    6508                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$238)
    6509                      .dwattr $C$DW$T$239, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  125

    6510              
    6511              $C$DW$802       .dwtag  DW_TAG_TI_far_type
    6512                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$239)
    6513              
    6514              $C$DW$T$276     .dwtag  DW_TAG_const_type
    6515                      .dwattr $C$DW$T$276, DW_AT_type(*$C$DW$802)
    6516              
    6517              
    6518              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    6519                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    6520                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    6521              $C$DW$803       .dwtag  DW_TAG_member
    6522                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$22)
    6523                      .dwattr $C$DW$803, DW_AT_name("rsvd")
    6524                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_rsvd")
    6525                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6526                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    6527              
    6528              $C$DW$804       .dwtag  DW_TAG_member
    6529                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$73)
    6530                      .dwattr $C$DW$804, DW_AT_name("targetProc")
    6531                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_targetProc")
    6532                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6533                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    6534              
    6535              $C$DW$805       .dwtag  DW_TAG_member
    6536                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$22)
    6537                      .dwattr $C$DW$805, DW_AT_name("major")
    6538                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_major")
    6539                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6540                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    6541              
    6542              $C$DW$806       .dwtag  DW_TAG_member
    6543                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$22)
    6544                      .dwattr $C$DW$806, DW_AT_name("minor")
    6545                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_minor")
    6546                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6547                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    6548              
    6549                      .dwendtag $C$DW$T$74
    6550              
    6551              $C$DW$T$40      .dwtag  DW_TAG_typedef
    6552                      .dwattr $C$DW$T$40, DW_AT_name("CTRL_Version")
    6553                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$74)
    6554                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    6555              
    6556              $C$DW$T$282     .dwtag  DW_TAG_pointer_type
    6557                      .dwattr $C$DW$T$282, DW_AT_type(*$C$DW$T$40)
    6558                      .dwattr $C$DW$T$282, DW_AT_address_class(0x20)
    6559              
    6560              
    6561              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    6562                      .dwattr $C$DW$T$81, DW_AT_name("_DRV8305_Obj_")
    6563                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x08)
    6564              $C$DW$807       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  126

    6565                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$76)
    6566                      .dwattr $C$DW$807, DW_AT_name("spiHandle")
    6567                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_spiHandle")
    6568                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6569                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    6570              
    6571              $C$DW$808       .dwtag  DW_TAG_member
    6572                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$78)
    6573                      .dwattr $C$DW$808, DW_AT_name("gpioHandle")
    6574                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_gpioHandle")
    6575                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6576                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    6577              
    6578              $C$DW$809       .dwtag  DW_TAG_member
    6579                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$80)
    6580                      .dwattr $C$DW$809, DW_AT_name("gpioNumber")
    6581                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_gpioNumber")
    6582                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6583                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    6584              
    6585              $C$DW$810       .dwtag  DW_TAG_member
    6586                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$38)
    6587                      .dwattr $C$DW$810, DW_AT_name("RxTimeOut")
    6588                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_RxTimeOut")
    6589                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6590                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    6591              
    6592              $C$DW$811       .dwtag  DW_TAG_member
    6593                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$38)
    6594                      .dwattr $C$DW$811, DW_AT_name("enableTimeOut")
    6595                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_enableTimeOut")
    6596                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6597                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    6598              
    6599                      .dwendtag $C$DW$T$81
    6600              
    6601              $C$DW$T$191     .dwtag  DW_TAG_typedef
    6602                      .dwattr $C$DW$T$191, DW_AT_name("DRV8305_Obj")
    6603                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$81)
    6604                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    6605              
    6606              $C$DW$T$189     .dwtag  DW_TAG_pointer_type
    6607                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$81)
    6608                      .dwattr $C$DW$T$189, DW_AT_address_class(0x20)
    6609              
    6610              $C$DW$T$190     .dwtag  DW_TAG_typedef
    6611                      .dwattr $C$DW$T$190, DW_AT_name("DRV8305_Handle")
    6612                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
    6613                      .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    6614              
    6615              
    6616              $C$DW$T$88      .dwtag  DW_TAG_structure_type
    6617                      .dwattr $C$DW$T$88, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
    6618                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x04)
    6619              $C$DW$812       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  127

    6620                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$83)
    6621                      .dwattr $C$DW$812, DW_AT_name("IDRIVEP_HS")
    6622                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    6623                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6624                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    6625              
    6626              $C$DW$813       .dwtag  DW_TAG_member
    6627                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$85)
    6628                      .dwattr $C$DW$813, DW_AT_name("IDRIVEN_HS")
    6629                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    6630                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6631                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    6632              
    6633              $C$DW$814       .dwtag  DW_TAG_member
    6634                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$87)
    6635                      .dwattr $C$DW$814, DW_AT_name("TDRIVEN")
    6636                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_TDRIVEN")
    6637                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6638                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    6639              
    6640              $C$DW$815       .dwtag  DW_TAG_member
    6641                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$38)
    6642                      .dwattr $C$DW$815, DW_AT_name("CTRL05_RSV1")
    6643                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_CTRL05_RSV1")
    6644                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6645                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    6646              
    6647                      .dwendtag $C$DW$T$88
    6648              
    6649              $C$DW$T$140     .dwtag  DW_TAG_typedef
    6650                      .dwattr $C$DW$T$140, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
    6651                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$88)
    6652                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    6653              
    6654              
    6655              $C$DW$T$95      .dwtag  DW_TAG_structure_type
    6656                      .dwattr $C$DW$T$95, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
    6657                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x04)
    6658              $C$DW$816       .dwtag  DW_TAG_member
    6659                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$90)
    6660                      .dwattr $C$DW$816, DW_AT_name("IDRIVEP_LS")
    6661                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    6662                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6663                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    6664              
    6665              $C$DW$817       .dwtag  DW_TAG_member
    6666                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$92)
    6667                      .dwattr $C$DW$817, DW_AT_name("IDRIVEN_LS")
    6668                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    6669                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6670                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    6671              
    6672              $C$DW$818       .dwtag  DW_TAG_member
    6673                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$94)
    6674                      .dwattr $C$DW$818, DW_AT_name("TDRIVEP")
TMS320C2000 Assembler PC v16.9.6 Sun Jan 28 18:08:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Zulolo\AppData\Local\Temp\{B65F9D21-0B3A-4BFD-BCAC-2D0C7E64D4CD} PAGE  128

    6675                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_TDRIVEP")
    6676                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6677                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    6678              
    6679              $C$DW$819       .dwtag  DW_TAG_member
    6680                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$38)
    6681                      .dwattr $C$DW$819, DW_AT_name("CTRL06_RSV1")
    6682                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_CTRL06_RSV1")
    6683                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6684                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    6685              
    6686                      .dwendtag $C$DW$T$95
    6687              
    6688              $C$DW$T$141     .dwtag  DW_TAG_typedef
    6689                      .dwattr $C$DW$T$141, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
    6690                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$95)
    6691                      .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    6692              
    6693              
    6694              $C$DW$T$106     .dwtag  DW_TAG_structure_type
    6695                      .dwattr $C$DW$T$106, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
